import streamlit as st
import numpy as np
import random as rnd
import matplotlib as mpl
import matplotlib.pyplot as plt
from datetime import datetime as dt
import time
import datetime

mpl.rcParams["font.sans-serif"] = ["SimHei"]  # 保证显示中文字
mpl.rcParams["axes.unicode_minus"] = False  # 保证负号显示
mpl.rcParams["font.size"] = 18  # 设置字体大小
mpl.rcParams["ytick.right"] = True
mpl.rcParams["xtick.top"] = True
mpl.rcParams["xtick.direction"] = "in"  # 坐标轴上的短线朝内，默认朝外
mpl.rcParams["ytick.direction"] = "in"

# https://gzlgfang-st-apps-safe1-test-1r5r8r.streamlitapp.com/

# streamlit  run "g:/st-app/safe1_test.py"

# 化学化工实验室基本安全题目
# 包含消防安全、用电用水安全、实验化学品性质使用、基本操作规则、废液收集、基本防护
# str_test[序号] = ["下面有关一字的四个词组，哪个不是成语:", '一成不变', '一个不剩', '一夫当关', '一蹴而就']
# start_time = dt.now()
# start_time = time.time()
start_time = time.process_time()
answer = list()
str_test = 1201 * [5 * ["NA"]]
# str_test = list()
# 实验室消防安全、实验化学品性质使用
str_test[0] = [
    "实验室发生火灾时，若火势和范围较大，以达到人员无法控制的情况下，应该怎么做？",
    "尝试救火",
    "立即放弃自行灭火，通知所有人员沿消防通道紧急疏散，并立即拨打119",
    "找一个房间躲起来",
    "立即乘坐电梯离开",
]
str_test[1] = ["如果被烫伤、烧伤，最有效的应急方法是？", "用冷水浸泡、冰敷等紧急散热措施", "立即包扎", "前往医院", "用牙膏涂抹"]
str_test[2] = ["二氧化碳灭火器适用于以下哪些物品？", "钾", "钠", "贵重仪器", "氢化物"]
str_test[3] = ["扑灭电器火灾不宜使用的灭火器材是（ ）。", "二氧化碳灭火器", "干粉灭火器", "灭火砂", "泡沫灭火器"]
str_test[4] = ["金属钠着火时，应怎样做？", "用泡沫灭火器灭火", "用水灭火", "用二氧化碳灭火器灭火", "将砂子倒在它上面"]
str_test[5] = [
    "关于实验室安全问题，下列说法错误的是（ ）",
    "离开实验室时，一定要将室内检查一遍，应将水、电、气的开关关好，门窗锁好。",
    "若不慎将浓酸、浓碱溅在实验台上或地面，不用在意。",
    "使用可燃物，特别是易燃物时，应特别小心。不要大量放在桌上，更不要在靠近火焰处。",
    "使用电器设备（如烘箱、恒温水浴、离心机、电炉等）时，不可用湿手或在眼睛旁视时开关电闸和电器开关。",
]
str_test[6] = [
    "关于实验室灭火法，说法错误的是（ ）",
    "酒精及他可溶于水的液体着火时，可用水灭火。",
    "金属钠着火时，可把砂子倒在它的上面。",
    "汽油、乙醚、甲苯等有机溶剂着火时，应用石棉布或砂土扑灭。",
    "导线着火时，用水及二氧化碳灭火器灭火。",
]
str_test[7] = [
    "关于实验室急救，说法错误的是（ ）",
    "强碱（如氢氧化钠，氢氧化钾）触及皮肤而引起灼伤时，用酸中和。 ",
    "强酸、溴等触及皮肤而致灼伤时，应立即用大量自来水冲洗，再以5％碳酸氢钠溶液或5％氢氧化铵溶液洗涤。",
    "若媒气中毒时，应到室外呼吸新鲜空气，若严重时应立即到医院诊治。",
    "如酚触及皮肤引起灼伤，应该用大量的水清洗，并用肥皂和水洗涤，忌用乙醇。",
]
str_test[8] = [
    "强碱（如氢氧化钠，氢氧化钾）触及皮肤而引起灼伤时，应怎样处理？",
    "用水冲洗就行了",
    "用酸中和",
    "先用大量自来水冲洗，再用5％乙酸溶液或2％硼酸溶液涂洗。",
    "先用大量自来水冲洗，再以5％碳酸氢钠溶液或5％氢氧化铵溶液洗涤。",
]
str_test[9] = [
    "关于实验室常识，说法错误的是（ ）",
    "挪动干净玻璃仪器时，勿使手指接触仪器内部。",
    "不要用滤纸称量药品，更不能用滤纸作记录。",
    "一般容量仪器的容积都是在20℃下校准的。使用时如温度差异在5℃以内．容积改变不大，可以忽略不计。",
    "洗净的仪器可以用抹布擦拭仪器内壁",
]
str_test[10] = [
    "关于实验室废液废弃物收集处理，说法错误的是（ ）。",
    "实验产生的废液必须倒入专用的收集桶内，严禁倒入下水道。",
    "剧毒废液可以与其它剧毒废液混放在一个容器中。",
    "专用桶内倒入废液后必须将桶盖盖紧，以防挥发、溢出等引发安全隐患。",
    "存放废液的专用桶必须远离电源、气源、火源，采取严格的安全措施。",
]
str_test[11] = ["若空间不够，在保证安全的情况下，实验室废液桶可以叠放，最高不超过（ ）层。", "三层", "四层", "两层", "一层"]
str_test[12] = [
    "关于实验室安全规范，说法错误的是（ ）。",
    "实验室内应穿实验衣，必要时戴护目镜及口罩。",
    "进行化验时可以中途离开。",
    "不可用口或鼻直接尝、嗅化学试剂。",
    "实验室内不得嬉闹、吸烟、吃东西，不准用实验器皿盛装食物。",
]
str_test[13] = [
    "关于实验室个人防护措施，说法错误的是（ ）。",
    "为了防止工作服上附着的化学药品的扩散，工作服不得穿到其它公共场所如食堂、会议室等。",
    "在实验室中为了防止手受到伤害，可根据需要选戴各种手套。",
    "所有人员进入实验室都必须穿工作服，其目的是为了统一服装。",
    "工作人员应穿平底、防滑、合成皮或皮质的满口鞋，不得穿凉鞋、拖鞋、高跟鞋。",
]
str_test[14] = [
    "关于易燃易爆危险品的操作，错误的是（ ）。",
    "钾、钠操作时可以与水、卤代烷接触。",
    "操作、倾倒易燃液体，应远离火源。",
    "黄磷、金属钾、纳、氢化铝锉，氢化钠等自燃物，数量较大者应在防火实验室内操作",
    "接触可引起燃爆事故的性质不相容物，如氧化剂与易燃物，不得一起研磨。",
]
str_test[15] = ["下列物品不是剧毒物的是（ ）。", "氰化钠", "三氯化磷", "氢气", "乙酸汞"]
str_test[16] = [
    "下列物品相互接触时，可能会大量放热并着火、爆炸的有（ ）。",
    "水和乙醇",
    "高锰酸钾和浓硫酸",
    "四氯化碳和乙醇",
    "苯和四氯化碳",
]
str_test[17] = ["遇水会发生剧烈反应的有（ ）。", "乙醇", "苯", "四氯化碳", "金属钠"]
str_test[18] = ["下列药品常温下可以与水接触的是（ ）。", "金属钠", "电石", "白磷", "金属氢化物"]
str_test[19] = ["实验室常用的重铬酸钾洗液，当它失效时洗液颜色变为（ ）。", "绿色", "无色", "红色", "黄色"]
str_test[20] = [
    "苯酚毒性非常大，实验室发生苯酚泄露时，应该采取的措施是（ ）。",
    "用水冲洗",
    "直接扫走",
    "用酸处理",
    "用沙土，干燥石灰或苏打灰混合覆盖",
]
str_test[21] = ["乙醚的沸点是34.6℃，正确的保存方式是（ ）。", "低温通风保存", "开口放置", "放在普通冰箱保存", "露天存放"]
str_test[22] = ["高毒性药品砒霜是（ ）。", "三氧化二砷", "三氯化砷", "砷酸", "砷酸钠"]
str_test[23] = ["久置空气中会发生颜色变化，但颜色变化不是由于跟氧气反应引起的固体物质是（ ）", "过氧化钠", "亚硫酸钠", "硫酸亚铁", "苯酚"]
str_test[24] = ["下列药品需要用专柜由专人负责贮存的是（ ）。", "氢氧化钠", "氰化钾", "高锰酸钾", "浓硫酸"]
str_test[25] = ["下列物质无毒的是（ ）。", "乙二醇", "硫化氢", "乙醇", "甲醛"]
str_test[26] = ["氮氧化物气体主要伤害人体的（ ）。", "眼睛", "皮肤", "耳朵", "呼吸道深部的细支气管、肺泡"]
str_test[27] = ["氯气一般是什么颜色的？", "无色", "棕色", "红色", "黄绿色"]
str_test[28] = [
    "当有汞撒落时，现场应（ ）。",
    "用水擦",
    "用拖把拖",
    "扫干净后倒入垃圾桶",
    "将撒落的水银收集至密封容器中，加水或甘油液封，地面或桌面再用硫磺粉覆盖，收集后统一处理",
]
str_test[29] = [
    "室温较高时，开启易挥发溶剂瓶盖时，应先（ ）。",
    "振荡一段时间",
    "先将试剂瓶在热水中浸泡一段时间",
    "先将试剂瓶在冷水中浸泡一段时间",
    "直接打开",
]
str_test[30] = ["白磷接触空气会发生强烈氧化作用，保存时应该（ ）。", "在水中保存", "放在试剂瓶中保存", "用纸包裹", "放在煤油中保存"]
str_test[31] = ["易燃化学试剂允许存放最高室温不得超过（ ）。", "20℃", "30℃", "40℃", "50℃"]
str_test[32] = ["用过的废洗液应（ ）。", "直接倒入下水道", "倒入厕所", "倒入废液桶交给相关部门统一处理", "倒入洗手池中"]
str_test[33] = ["实验完成后，废液应（ ）。", "倒入垃圾桶", "倒入废液桶交给相关部门统一处理", "倒入洗手池中", "任意弃置"]
str_test[34] = [
    "当不慎把大量浓硫酸滴在皮肤上时，正确的处理方法是（ ）。",
    "以吸水性强的纸吸去后，用大量水冲洗",
    "用水冲洗",
    "用酒精擦",
    "马上去医院",
]
str_test[35] = ["下列气体中，有毒的气体为（ ）。", "氧气", "氮气", "二氧化碳", "氯气"]
str_test[36] = ["实验室常用溶剂应（ ）。", "按药品类别分开存放", "按字母顺序存放", "按生产日期存放", "随便存放"]
str_test[37] = [
    "配制稀硫酸时，应（ ）。",
    "将水慢慢分批倒入酸中，并不时搅拌",
    "将浓硫酸慢慢分批加入水中，并不时搅拌",
    "将水和浓硫酸同时倒入容器中，并不时搅拌",
    "将浓硫酸快速加入水中，并迅速搅拌",
]
str_test[38] = ["在常压条件下加热蒸馏或回流时，液体量不能超过烧瓶容量的（ ）。", "1/4", "2/3", "1/2", "1"]
str_test[39] = ["清洁分光光度计比色皿的透光面可以用（ ）擦拭。", "滤纸", "纱布", "镜头纸", "毛巾"]
str_test[40] = ["盐酸、甲醛溶液、乙醚等易挥发试剂存放时应（ ）。", "随便放置", "和其他试剂混放", "放在冰箱中", "放在干燥通风处且瓶口蜡封"]
str_test[41] = [
    "关于实验室防毒措施，下列说法错误的是（）。",
    "实验前，应了解所用药品的毒性及防护措施。",
    "可以在实验室内喝水、吃东西。",
    "饮食用具不要带进实验室，以防毒物污染，离开实验室及饭前要冼净双手",
    "操作有毒气体(如H2S、Cl2、Br2、NO2、浓HCl和HF等)应在通风橱内进行。",
]
str_test[42] = [
    "关于实验室防爆措施，下列说法错误的是（ ）。",
    "强氧化剂和强还原剂可以放在一起。",
    "使用可燃性气体时，要防止气体逸出，室内通风要良好。",
    "久藏的乙醚使用前应除去其中可能产生的过氧化物。",
    "操作大量可燃性气体时，严禁同时使用明火，还要防止发生电火花及其它撞击火花。",
]
str_test[43] = [
    "关于实验室防火措施，下列说法错误的是（ ）。",
    "许多有机溶剂如乙醚、丙酮、乙醇、苯等非常容易燃烧，大量使用时室内不能有明火、电火花或静电放电。",
    "实验室内不可存放过多可燃物，用后还要及时回收处理，不可倒入下水道，以免聚集引起火灾。",
    "金属钠、钾、镁、铝粉、电石、过氧化钠着火，应用水灭火。",
    "比水轻的易燃液体，如汽油、笨、丙酮等着火，可用泡沫灭火器。",
]
str_test[44] = [
    "高压气体钢瓶是指实验室使用的各类压缩气体钢瓶，正确使用高压气瓶是从事实验操作保证安全的必备条件之一，下列说法错误的是（ ）。",
    "钢瓶应存放在阴凉、干燥、远离热源的地方。",
    "搬运钢瓶要小心轻放，钢瓶帽要旋上。",
    "不要让油或易燃有机物沾染气瓶上",
    "可燃性气瓶不需要与氧气瓶分开存放。",
]
str_test[45] = [
    "违章用电常常可能造成人身伤亡，火灾，损坏仪器设备等严重事故。下列说法错误的是（ ）。",
    "可以用潮湿的手接触电器。",
    "所有电器的金属外壳都应保护接地。",
    "如有人触电，应迅速切断电源，然后进行抢救。",
    "室内若有氢气、煤气等易燃易爆气体，应避免产生电火花。",
]
str_test[46] = [
    "关于苯甲酸的储存，下列说法错误的是（ ）。",
    "储存于阴凉、通风的库房。",
    "可以与其它酸类混放。",
    "远离火种、热源。要求密封，不可与空气接触。",
    "应与氧化剂、酸类分开存放，切忌混储。",
]
str_test[47] = [
    "关于溴的储存，下列说法错误的是（ ）。",
    "储存于阴凉、通风的库房。",
    "远离火种、热源。",
    "可以与金属粉末混放。",
    "应保持容器密封。",
]
str_test[48] = ["下列物质为氧化剂的是（ ）。", "钠、铝等金属单质", "氢化铝锂", "溴", "氢气"]
str_test[49] = ["下列物质哪个不是强酸？", "高锰酸", "盐酸", "硫酸", "碳酸"]
str_test[50] = ["下列哪种物质不属于食用化学品？", "酒精\t", "柠檬酸钠", "盐酸", "碳酸"]
str_test[51] = [
    "危险化学品具有易燃、易爆、腐蚀、毒害、放射性等危险性质。关于危化品的储存，下列说法错误的是（ ）。",
    "危化品和其它化学品可以用相同方式储存，不用太过小心。",
    "灭火方法相抵触的化学危险品，不得在同一仓库或同一储存室内存放。",
    "禁止在危化品贮存区域内堆积可燃废弃物品，同时须远离热源和火源。",
    "禁忌物料、化学性质相抵触或灭火方法不同的化学物料，不得混放。",
]
str_test[52] = [
    "关于废液的排放，下列说法错误的是（ ）。",
    "对于废酸液，放到指定废液桶",
    "实验室内大量使用冷凝用水，无污染可直接排放",
    "洗刷产生的废水，污染不大，可排入下水道",
    "酸、碱水溶液可不经处理直接排入下水道",
]
str_test[53] = ["活泼金属应存放在（ ）。", "放在水中保存", "泡在煤油里密封避光保存", "密封容器中并放入冰箱", "密封容器中并放入干燥器"]
str_test[54] = [
    "危险化学品的急性毒性中LD50代表的意义是（ ）。",
    "致死量",
    "导致一半受试动物死亡的致死量",
    "导致一半受试动物死亡的致死浓度",
    "导致一个受试动物死亡的致死浓度",
]
str_test[55] = ["甲苯的毒性级别是（ ）。", "剧毒", "高毒", "低毒", "微毒"]
str_test[56] = ["苯的毒性级别是（ ）。", "剧毒", "高毒", "低毒", "微毒"]
str_test[57] = ["甲醇的毒性级别是（ ）。", "剧毒", "高毒", "低毒", "微毒"]
str_test[58] = ["铝粉、保险粉自燃时的扑救措施是（ ）。", "用水灭火", "用泡沫灭火器灭火", "用干粉灭火器灭火", "用干砂子灭火"]
str_test[59] = ["氮氧化物主要伤害人体的（ ）。", "眼", "皮肤", "上呼吸道", "呼吸道深部的细支气管、肺泡"]
str_test[60] = ["天气较热时，打开腐蚀性液体，应该（ ）。", "戴橡胶手套", "用毛巾包住塞子", "直接用手", "用塑料袋"]
str_test[61] = ["加热、回流易燃液体，为防止暴沸、喷溅（ ）。", "蒸馏之前添加沸石", "蒸馏途中添加沸石", "暴沸时再添加沸石", "不用添加沸石"]
str_test[62] = [
    "生石灰烧伤应（ ）。",
    "立即用大量水冲洗",
    "立即用1%~2%的醋酸冲洗",
    "立即去医院处理",
    "先用卫生纸或干布尽量清除皮肤上的生石灰，再用大量水清洗",
]
str_test[63] = ["离心时，离心管中液体样品装量一般为离心管体积的（ ）为宜，以防液体溢出。", "2/3", "1/3", "1/4", "1/2"]
str_test[64] = ["玻璃电极的玻璃膜表面若粘有油污，使用（ ）浸洗，最后用蒸馏水洗净。", "水", "四氯化碳", "酒精和四氯化碳", "四氯化碳"]
str_test[65] = ["下列化学试剂中，毒性较大的是（ ）。", "水", "氯化钠", "氰化物", "乙醇"]
str_test[66] = [
    "关于实验室操作，下列说法错误的是（ ）。",
    "实验过程中应仔细观察实验现象并及时做好实验记录，原始记录要完整、真实、准确、清楚。",
    "加热试管内物质时，管口应朝向自己，以便看清楚反应过程。",
    "凡进行有危险性的实验，应先检查防护措施，确证防护妥当后，才可进行实验。",
    "实验中，进行高温操作时，必须佩戴防高温手套。",
]
str_test[67] = [
    "下列实验室操作及安全的叙述正确的是（ ）。",
    "加热设备使用期间须按照操作规程进行操作，使用人员不得离岗或应定时检查，用毕，应及时断掉电源。",
    "使用通风橱前，应检查通风橱内抽风和排气系统是否正常工作。",
    "使用低温设备时，应戴好低温手套和其他防护用品，以免冻伤。",
    "在使用干冰、液氮、液氦等低温物质时，转移、倾倒时，不用戴低温手套。",
]
str_test[68] = [
    "为了防止在开启或关闭玻璃容器时发生危险，下列瓶塞中不适宜作为盛放具有爆炸危险性物质的玻璃容器的瓶塞的是（ ）。",
    "磨口玻璃塞",
    "软木塞",
    "胶皮塞",
    "橡胶塞",
]
str_test[69] = ["苯酚的毒性级别是（ ）。", "剧毒", "高毒", "低毒", "无毒"]
str_test[70] = ["以下液体中，投入金属钠最可能发火燃烧的是（ ）。", "水", "无水乙醇", "苯", "四氯化碳"]
str_test[71] = ["为了安全，须贮存于煤油中的金属是（ ）。", "钙", "铝", "铁", "钠"]
str_test[72] = [
    "稀硫酸溶液的正确制备方法是（ ）。",
    "在搅拌下，加水于浓硫酸中",
    "在搅拌下，加浓硫酸于水中",
    "水加于浓硫酸，或浓硫酸加于水都可以",
    "水与浓硫酸两者一起倒入容器混合",
]
str_test[73] = ["欲除去氯气时，以下物质作为吸收剂最为有效的是（ ）。", "氯化钙", "稀硫酸", "硫代硫酸钠", "氢氧化铅"]
str_test[74] = ["下列物质贮存于空气中易发生爆炸的是（ ）。", "苯", "甲苯", "对二甲苯", "苯乙烯"]
str_test[75] = ["减压蒸馏时应用下列器皿作为接收瓶和反应瓶的是（ ）。", "试管", "烧杯", "锥形瓶", "圆底烧瓶"]
str_test[76] = ["不属于危险化学品的是（ ）。", "易燃液体", "汽油", "水", "放射性物品"]
str_test[77] = [
    "关于实验室用水安全，说法错误的是（ ）。",
    "当需要接的水量较多时，可以打开水龙头，自己去做别的实验，节约时间。",
    "定期检查上下管路是否通畅。",
    "设备或化学反应冷却系统的橡胶管易出现老化或松动，应及时更换或加固。",
    "严格用水管理制度，杜绝水龙头打开而无人监管的现象。",
]
str_test[78] = [
    "关于实验室用电安全，下列说法错误的是（ ）。",
    "实验室内严禁私拉乱接电线。",
    "一旦遇到触电，我们要沉着冷静、果断地采取合适的应急措施。",
    "发现有人触电时，立即拔掉插头，关闭空气开关或者拉下闸刀。",
    "发现有人触电时，立即用手拉住对方，帮助对方脱离电器。",
]
str_test[79] = [
    "关于口罩类型与作用，下列说法正确的是（ ）。",
    "活性炭口罩可以在化学有毒气体浓度较高的场所使用",
    "防尘口罩有防毒作用",
    "防毒面具可以保护部位吸器官(口、鼻)外和眼睛及面部皮肤，密合效果好。",
    "医用口罩对经空气、血液、体液或飞溅物传播的呼吸道传染病没有防护作用",
]
str_test[80] = [
    "电在人们的日常工作与生活中应用极其广泛，但如果使用不当，小则损坏机器设备，大则危及人身安全。下列说法错误的是（ ）。",
    "有人触电时，救护人不得采用金属和其他潮湿的物品作为救护工具。",
    "触电急救是首先要使触电者迅速脱离电源，所以有人触电时立即用手拉住对方帮助脱离。",
    "夜间发生触电事故时，在切断电源时会同时使照明失电，应考虑切断后的临时照明，如应急灯等，以利于救护。",
    "实验室内严禁私拉乱接电线。",
]
str_test[81] = ["以下哪个不是实验室常用的消毒剂？", "碘酒", "水", "75%的卫生酒精棉球", "3%双氧水"]
str_test[82] = [
    "关于实验室化学品防范措施，下列说法错误的是（ ）。",
    "盛放放危险化学品的容器应该密封，防止由于容器或者包装泄露致使危险化学品释放",
    "所有存储的包装物应该贴上准确易于辨认的标签",
    "当房间存储有易燃物质或者热敏感化学物质，明火或者电辐射加热器等都不能用于加热房间",
    "化学试剂及其容器可以被阳光直射",
]
str_test[83] = [
    "进入化学清洗间，下列陈述错误的是（ ）。",
    "仅在化学间用自来水或去离子水，不接触化学品，可以不戴防护手套",
    "使用规定类型的手套时，注意检查手套是否破损",
    "严格禁止将头部伸入通风橱",
    "不要用手套碰自己的脸，如果需要扶正眼镜或者整理头发，用胳膊或者肩膀，手套上有可能带有危险化学品",
]
str_test[84] = [
    "需要你将硫酸、氢氟酸、盐酸和氢氧化钠各一瓶从化学品柜搬到通风橱内，正确的方法是（ ）。",
    "硫酸和盐酸同一次搬运，氢氟酸和氢氧化钠同一次搬运",
    "硫酸和氢氟酸同一次搬运，盐酸和氢氧化钠同一次搬运",
    "可以一起搬运",
    "一次只搬运一瓶",
]
str_test[85] = [
    "不慎发生意外，下列操作正确的是（ ）。",
    "如果不慎将化学品弄洒或污染，立即自行回收或者清理现场，以免对他人产生危险 ",
    "任何时候见到他人洒落的液体不要首先认为是水，应置之不理，以免发生危险",
    "pH值中性即意味着液体是水，自行清理即可",
    "不慎将化学试剂弄到衣物和身体上，立即用大量清水冲洗10－15分钟",
]
str_test[86] = [
    "移液时，当有生物污染性物质溅出，为防止扩散应（ ）。",
    "立即用浸过消毒剂的布或纸处理，然后将被污染的容器进行高压消毒",
    "立即用布或纸处理",
    "立即用水冲走",
    "立即采用高压消毒",
]
str_test[87] = ["当油脂等有机物沾污氧气钢瓶时，应立即用（ ）洗净。", "乙醇", "四氯化碳", "水", "汽油"]
str_test[88] = ["实验室各种管理规章制度应该（ ）。", "集中挂在醒目的地方", "由相关人员保管", "保存在档案柜中", "不展示"]
str_test[89] = ["在使用设备时，如果发现设备工作异常，应（ ）。", "停机并报告相关负责人员", "关机走人", "继续使用", "感觉没什么事，不理会"]
str_test[90] = ["塑料、有机玻璃制品的加热温度不能超过（ ）。", "40℃", "60℃", "80℃", "100℃"]
str_test[91] = ["下列哪种操作不能处理溴灼伤？", "涂甘油或烫伤膏", "立即用大量水洗", "用强碱擦拭", "用乙醇擦至灼伤处呈白色"]
str_test[92] = ["下列哪种物质不是禁水性物质？", "金属钠", "氨基钠", "氢化铝锂", "氯化钠"]
str_test[93] = ["下列哪种物质不是特别易燃物质？", "氯化钠", "乙醚", "乙醛", "烷基铝"]
str_test[94] = [
    "关于实验室安全，下列说法错误的是（ ）。",
    "夏季打开易挥发试剂瓶塞前，应先用冷水冷却，瓶口不要对着人。",
    "打开浓硫酸，浓硝酸，浓氨水试剂瓶塞时无需带防护用具",
    "废弃的有害固体药品严禁倒入生活垃圾处，必须经处理解毒后丢弃。",
    "实验完毕检查水、电、气、窗，进行安全登记后方可锁门离开",
]
str_test[95] = [
    "对于废液的处理，说法错误的是（ ）。",
    "对于含氟废液可以加入石灰使生成氟化钙沉淀",
    "对于含氰废液，CN根含量高时，可加入过量的次氯酸钙和氢氧化钠溶液",
    "对于含汞、砷、锑、铋等离子的废液，控制酸度0.3mol/L[H+]，使其生成硫化物沉淀",
    "对于无机酸类废液，不用处理可直接排入下水道",
]
str_test[96] = [
    "易燃化学品的泄漏处理不当，随时都有可能转化为火灾爆炸事故。因此，进行实验前应对化学品的化学性质和反应特性有充分的了解。下列说法错误的是（ ）。",
    "如果泄漏物化学品是易燃易爆的，应严禁火种。",
    "当泄漏量小时，可用沙子、吸附材料、中和材料等吸收中和。",
    "对于大型泄漏，可选择用隔膜泵将泄漏出的物料抽人容器内或槽车内",
    "对于贮罐区发生液体泄漏时，用水清洗就行了。",
]
str_test[97] = [
    "危险化学品容易发生火灾、爆炸事故。下列说法错误的是（ ）。",
    "发生化学品火灾时，灭火人员不应单独灭火，出口应始终保持清洁和畅通，要选择正确的灭火剂，灭火时还应考虑人员的安全。",
    "扑救危险化学品火灾决不可盲目行动，应针对每一类化学品，选择正确的灭火剂和灭火方法来安全地控制火灾",
    "化学品火灾的扑救应由专业消防队来进行。其他人员不可盲目行动，待消防队到达后，介绍物料介质，配合扑救。",
    "碱金属燃烧时应用泡沫灭火器灭火",
]
str_test[98] = [
    "活泼金属遇水即可发生激烈反应，存放时应（ ）。",
    "直接放在试剂瓶中保存",
    "浸没在煤油或石蜡中密闭保存",
    "用纸密封包裹存放",
    "和酸性物质及氧化剂一起存放",
]
str_test[99] = ["以下哪些环境对人体无害？", "毒性", "辐射", "高温", "常温"]
answer[0:100:1] = [
    2,
    1,
    3,
    4,
    4,
    2,
    4,
    1,
    3,
    4,
    2,
    1,
    2,
    3,
    1,
    3,
    2,
    4,
    3,
    1,
    4,
    1,
    1,
    1,
    2,
    3,
    4,
    4,
    4,
    3,
    1,
    2,
    3,
    2,
    1,
    4,
    1,
    2,
    2,
    3,
    4,
    2,
    1,
    3,
    4,
    1,
    2,
    3,
    3,
    4,
    3,
    1,
    4,
    2,
    2,
    3,
    2,
    3,
    4,
    4,
    2,
    1,
    4,
    1,
    3,
    3,
    2,
    4,
    1,
    2,
    1,
    4,
    2,
    3,
    4,
    4,
    3,
    1,
    4,
    3,
    2,
    2,
    4,
    1,
    4,
    4,
    1,
    2,
    1,
    1,
    2,
    3,
    4,
    1,
    2,
    4,
    4,
    4,
    2,
    4,
]
str_test[100] = ["易燃材料如酒精，一定不能在以下哪种情况下使用：", "附近有未关闭的门", "周围有明火", "附近有其他同学", "水槽旁"]
str_test[101] = ["易燃化学品一般储存在：", "方便拿的地方", "易燃物储存柜中", "靠近水源的地方", "玻璃容器中"]
str_test[102] = ["下列物质中，与乙醇混溶时容易发生爆炸的是：", "高氯酸", "乙醚", "水", "丙酮"]
str_test[103] = ["下列物质会引发爆炸的是：", "氯化锌", "四氯化碳", "三硝基甲苯", "氯化铁"]
str_test[104] = ["投入金属钠可能会发生燃烧的液体是：", "无水乙醇", "苯", "汽油", "水"]
str_test[105] = ["失效的重铬酸钾洗液呈现什么颜色：", "绿色", "无色", "粉色", "暗红"]
str_test[106] = ["关于易燃液体的安全标志，错误的是：", "底色为黄色", "底色为红色", "图形为火焰（黑色）", "文字为黑色"]
str_test[107] = ["金属钠着火应当采取什么方式灭火：", "开窗通风", "水", "干粉灭火器", "泡沫灭火器"]
str_test[108] = ["以下哪种物质无毒：", "乙二醇", "乙醇", "硫化氢", "甲醛"]
str_test[109] = ["易燃类液体的特点有：", "闪点在25℃以下的液体", "极易挥发成气体", "遇明火即燃烧", "以上都是"]
str_test[110] = ["实验室内操作乙炔气时，应注意的有：", "室内不可有明火", "房间应密闭", "室内应有高湿度", "以上都不对"]
str_test[111] = [
    "实验时需要加热易燃液体实验，应采取哪种方式：",
    "用电炉加热，要有人看管",
    "用电热套加热，可以不用看管",
    "用水浴加热，要有人看管",
    "用酒精灯加热，要有人看管",
]
str_test[112] = ["自燃性试剂不应该存放在：", "单独储存", "储存于通风、干燥、阴凉处", "存放于试剂架上", "远离明火及热源，避免太阳直射"]
str_test[113] = ["下列粉尘中，不会发生爆炸的是：", "生石灰", "铝粉", "面粉", "镁粉"]
str_test[114] = ["黄磷自燃应当采取哪种方式扑救：", "用高压水枪", "用高压灭火器", "用雾状水灭火并用泥土覆盖", "立马开窗通风"]
str_test[115] = ["下列物质应避免与水接触以免发生危险的是：", "氯化钠", "氯化钙", "硫酸钙", "氢化铝锂"]
str_test[116] = ["K、Na、Mg、Ca、Li、MgO、电石中，遇水激烈反应的有多少种：", "4", "5", "6", "7"]
str_test[117] = [
    "关于硝酸铵的说法中，错误的是：",
    "强氧化剂，可做烟花",
    "与皮肤接触没有问题",
    "与易燃物混合可能爆炸",
    "与还原物、有机物混合可能爆炸",
]
str_test[118] = ["以下物质相互接触时，可能会大量放热并着火爆炸的有：", "高锰酸钾和乙醇", "浓硝酸和胺类", "四氯化碳和碱金属", "以上均是"]
str_test[119] = ["不属于易燃液体的是：", "乙醇", "乙醚", "乙酸", "甲苯"]
str_test[120] = ["以下药品中，严禁与水接触的是：", "金属钠、钾", "电石", "金属氢化物", "以上都是"]
str_test[121] = ["甲苯在储存时，其储存温度应不超过：", "20℃", "25℃", "30℃", "35℃"]
str_test[122] = [
    "容器中的溶剂或易燃化学品发生燃烧时，应当如何处置：",
    "用灭火器或加砂子灭火",
    "加水灭火",
    "用不易燃的瓷砖、玻璃片盖住瓶口",
    "用湿抹布盖住瓶口",
]
str_test[123] = ["实验室发生火灾、爆炸等危险事故时，首先要：", "迅速撤离实验室", "自己留下来排查事故原因", "打电话求救", "切断电源"]
str_test[124] = ["扑救爆炸物品火灾时，用沙土盖压是：", "首要的", "没有必要的", "禁止的", "可以的"]
str_test[125] = ["由于过失操作引起火灾，造成严重后果和损失的行为，构成：", "纵火罪", "失火罪", "重大责任事故罪", "无罪"]
str_test[126] = [
    "当实验室发生重大火灾无法扑灭时，要：",
    "往着火相反的方向逃生",
    "迅速从最近的安全出口逃生",
    "往人员多的方向逃生",
    "往人员少的方向逃生",
]
str_test[127] = [
    "被困在火场时，错误的求救方法是：",
    "在窗口、阳台或屋顶处向外大声呼叫",
    "条件允许，立马拨打119",
    "白天可挥动鲜艳布条发出求救信号，夜晚可挥动手电筒或手机闪光灯",
    "大声哭泣",
]
str_test[128] = ["储存有爆炸危险物品的实验室，其电总闸开关一般在：", "室内门旁", "室外门旁", "室内明灯附近", "储存药品的附近"]
str_test[129] = ["发生危险化学品事故后，应当向什么方向疏散：", "下风", "上风", "顺风", "任意"]
str_test[130] = [
    "如果在实验过程中，闻到烧焦气味应当：",
    "关机走人",
    "打开通风装置通风",
    "请同实验的人帮忙检查",
    "立即关机并报告相关负责人员",
]
str_test[131] = [
    "易燃易爆试剂应放在：",
    "铁柜中，柜的顶部要有通风口",
    "木柜中，柜的顶部要有通风口",
    "铁柜中，并密封保存",
    "木柜中，并密封保存",
]
str_test[132] = ["HCN的气味是：", "无味", "大蒜味", "苦杏仁味", "臭鸡蛋味"]
str_test[133] = ["在实验室放置盛汞的容器时，应注意：", "密封即可", "在汞面上加盖一层硫粉", "在汞面上加盖一层水封", "放入通风橱中"]
str_test[134] = ["当油脂等有机物沾污氧气瓶时，应用什么试剂洗净：", "乙醇", "四氯化碳", "水", "汽油"]
str_test[135] = ["稀释浓硫酸时，应该：", "把水缓慢加入浓硫酸中", "把浓硫酸缓慢加入水中", "把浓硫酸迅速倒入水中", "把水迅速加入浓硫酸中"]
str_test[136] = ["不具有强腐蚀性的酸是：", "硝酸", "冰醋酸", "硼酸", "硫酸"]
str_test[137] = ["以下几种气体中，有毒的气体为：", "氯气", "二氧化硫", "三氧化硫", "以上都有毒"]
str_test[138] = [
    "下列物品中，属于强氧化剂并能与有机物、镁粉、铝粉、锌粉形成爆炸性混合物的是：",
    "过氧化氢",
    "高氯酸及其盐",
    "高锰酸及其盐",
    "以上都是",
]
str_test[139] = ["以下属于剧毒化学试剂的是：", "氰化钾", "氰化钠", "二氯化汞", "以上都是"]
str_test[140] = ["下列物质会灼伤皮肤的是：", "液氮", "强碱", "冰醋酸", "以上都是"]
str_test[141] = [
    "实验中吸入Cl2或HCl气体时，应如何处理：",
    "人工呼吸",
    "立即到室外呼吸新鲜空气",
    "吸入少量酒精和乙醚的混合蒸汽使之解毒",
    "不用管，过一会就好了",
]
str_test[142] = ["天气较热时，打开腐蚀性液体，应该：", "直接用手", "用毛巾先包住塞子", "戴橡胶手套", "用纸包住塞子"]
str_test[143] = [
    "实验室内使用乙炔气时，说法正确的是：",
    "室内不可有明火。不可有产生电火花的电器",
    "房间应密闭",
    "室内应保持高湿度",
    "用铜管道输送",
]
str_test[144] = ["以下几种气体中，最毒的气体为：", "氯气", "光气（COCl2）", "二氧化硫", "三氧化硫"]
str_test[145] = ["氧气瓶与乙炔发生器间距不得小于多少米：", "5米", "3米", "2米", "1米"]
str_test[146] = ["镁粉发生火灾时，正确的灭火方式是：", "用水灭火", "用特殊干粉灭火", "用二氧化碳灭火", "开窗通风"]

# 用电、用水安全
str_test[147] = ["在遇到高压电线断落地面，在多大的范围内应避免进入：", "10米", "20米", "30米", "50米"]
str_test[148] = [
    "实验室需要增设电气设备时，说法正确的是：",
    "老师自行改装",
    "须经学校有关部门批准，由学校安排电工安装",
    "学生私自接装",
    "只要空间足够，可以随意添加电气设备",
]
str_test[149] = [
    "实验室有人员发生触电时，下列哪种行为是不正确的：",
    "应迅速切断电源，将触电者的上衣解开，取出口中异物，然后进行人工呼吸",
    "应迅速注射兴奋剂",
    "当患者伤势严重时，应立即送医院抢救",
    "直接去触碰触电者",
]
str_test[150] = ["电线插座损坏时，可能造成的危险有：", "空气开关跳闸", "吸潮漏电", "触电伤害", "以上都是"]
str_test[151] = ["低压验电笔一般适用于交流、直流电压为多少伏特以下：", "220V", "380V", "500V", "110V"]
str_test[152] = ["触电者能否获救，关键在于：", "触电的部位", "能否尽快脱离电源和实施紧急救护", "触电电压的高低", "触电电流的高低"]
str_test[153] = ["漏电保护器在以下哪种情况时，无法起作用：", "单手碰到带电体", "人体碰到带电设备", "双手碰到两相电线", "人体碰到漏电机壳"]
str_test[154] = ["发生电气火灾时，首先采取的措施是：", "打电话报警", "切断电源", "扑灭明火", "保护现场。分析火因，以便采取措施，杜绝隐患"]
str_test[155] = ["我国民用照明电路电压是：", "直流电压220V", "交流电压380V", "直流电压380V", "交流电压220V"]
str_test[156] = [
    "实验室有人员触电时，使触电人员脱离电源的方式错误的是：",
    "抓触电人的手",
    "借助工具使触电者脱离电源",
    "抓触电人的干燥外衣",
    "切断电源",
]
str_test[157] = ["电压在多少伏以下不必考虑点击危险：", "36V", "65V", "25V", "18V"]
str_test[158] = ["实验室使用冷凝水时，应该注意：", "检查水龙头是否畅通", "接水管时是否接紧固", "使用结束关闭水龙头", "以上都对"]
str_test[159] = ["我国把实验室用水分为几个等级：", "2", "3", "4", "5"]
str_test[160] = [
    "关于实验室用水的注意事项，说法正确的是",
    "应当了解实验楼自来水总闸的位置，发生水患时，立即关闭总闸",
    "要杜绝水龙头打开而无人监管的现象，定期检查上下管路",
    "冬季做好水管的保暖工作，防止水管受冻爆裂",
    "以上都对",
]

# 基本操作规则
str_test[161] = ["倾倒液体试剂时，瓶上的标签应朝向：", "上方", "下方", "左方", "右方"]
str_test[162] = [
    "取用试剂时，说法正确的是：",
    "不能用手直接接触试剂，以防危害健康和沾污试剂",
    "要用干净的药匙取固体试剂，用过的药匙要洗净擦干后才能再用",
    "瓶塞应倒置桌面上，以免弄脏，取用试剂后，立即盖严，将试剂瓶放回原处，标签朝外",
    "以上都对",
]
str_test[163] = ["关于药品标签的说法正确的是：", "标明药品名称", "标有质量规格", "标明来货日期、危险性质", "以上都对"]
str_test[164] = [
    "使用显微镜时，需要注意的有：",
    "显微镜要放置在干燥通风的地方，并避免阳光直射或暴晒",
    "避免与酸、碱和易挥发、腐蚀性的化学试剂放在一起",
    "物镜和目镜必须保持清洁，如有灰尘应用擦镜纸擦拭，不能用布或其他物品擦拭",
    "以上都对",
]
str_test[165] = [
    "实验开始前，需要做好的准备有：",
    "预习实验，理清实验思路和实验内容",
    "弄清水、电、气的管线开关和标记",
    "检查仪器是否有破损",
    "以上都对",
]
str_test[166] = [
    "使用干燥箱和恒温箱时，需要注意的事项有：",
    "使用前检查电源，检查接地线是否良好",
    "箱内保持清洁，置物篮不得有锈",
    "使用温度不能超过最高允许温度，用完及时切断电源",
    "以上都对",
]
str_test[167] = [
    "下列实验操作中，说法正确的是：",
    "可以对容量瓶、量筒进行加热",
    "可以抓住塑料瓶或玻璃瓶的盖子搬运瓶子",
    "非一次性防护手套脱下前必须冲洗干净",
    "在通风橱操作时，可以将头伸入通风柜内观察",
]
str_test[168] = ["下列溶液不能储存普通冰箱中的是：", "普通化学试剂", "酶溶液", "菌体", "有机溶剂"]
str_test[169] = ["在实验室区域内，可以做的事情是：", "吸烟、烹饪、吃饭", "睡觉过夜", "学习、工作", "与实验室的同学玩闹"]
str_test[170] = ["到实验室阴暗处找东西时，应使用的照明设备是：", "手电筒", "油灯", "蜡烛", "酒精灯"]
str_test[171] = [
    "关于化学药品的存放，说法错误的是：",
    "化学药品应分类存放",
    "有机溶剂，固体化学药品可以存放在同一药品柜中",
    "确认容器标签是否与药品一致",
    "要清楚化学药品的危害标识和图样",
]
str_test[172] = ["用试管加热液体时，试管内液体不得超过试管的：", "1/3", "2/3", "3/4", "4/5"]
str_test[173] = ["在实验室进行实验时，错误的行为有：", "穿凉拖鞋", "穿运动服", "直接用手拿含酸、碱试剂的药瓶", "以上都是"]

# 废液收集
str_test[174] = [
    "下列有关有害废液的处理，正确的是：",
    "量不大可以倒在土地上自然渗掉",
    "集中一定量后卖给小贩",
    "集中一定量后交设备处",
    "倒入下水道",
]
str_test[175] = [
    "实验结束后，正确处理废液的方式是：",
    "用剩的液体倒回原瓶，防止浪费",
    "废液收集起来放在指定位置，等待统一处理",
    "将废液倒入下水道",
    "不做任何处理，下次使用时直接取用",
]
str_test[176] = [
    "实验用剩的活泼金属残渣，正确的处理方式是：",
    "放回原瓶",
    "将金属取出暴露在空气中等待其氧化完全",
    "缓慢滴加乙醇将金属全部反应，整体作为废液处理",
    "随意放置",
]
str_test[177] = [
    "下列关于处置实验过程产生的有毒废液，说法错误的是：",
    "不得随意丢弃、掩埋",
    "贴标识，妥善保管",
    "交由有关部门统一处理",
    "稀释后用大量水冲洗",
]
str_test[178] = [
    "实验室的“三废”包括下列哪三种物质",
    "废气、废液、固体废物",
    "废气、废屑、废有机溶剂",
    "废料、废品、废气",
    "废液、废渣、剩余药品",
]
str_test[179] = [
    "处理废弃的固体有害药品的正确方法是：",
    "直接丢在生活垃圾处",
    "经过处理解毒后，才可以丢在生活垃圾处",
    "收集起来由专业公司处理",
    "带回去当纪念",
]
str_test[180] = [
    "学校对危险化学废物处理的工作原则是：",
    "自行处理",
    "分类收集、定点存放、专人管理、集中处理",
    "当作生活垃圾处理",
    "以上都不对",
]
str_test[181] = [
    "某些废液混合时可能发生危险，正确的做法是：",
    "直接向下水口倾倒",
    "随其他垃圾一起丢弃",
    "单独存放于可密闭的容器中，并贴上标签",
    "以上都不对",
]
str_test[182] = [
    "剧毒物品的残留物的正确处理方式是：",
    "与生活垃圾一起丢弃",
    "严禁随意丢弃，须放回原处，妥善保管，待学校相关部门统一处理",
    "与普通废液一同处理",
    "以上都不对",
]
str_test[183] = ["用过的废洗液应：", "直接倒入下水道", "作为废液交相关部门统一处理", "倒回原瓶", "用来洗厕所"]
str_test[184] = ["完成实验后，废液的处理方式正确的是：", "可直接倒入水槽中", "分类收集后交专业回收单位处理", "倒入垃圾桶中", "任意弃置"]
str_test[185] = [
    "下列关于实验室废液处理的方式，说法错误的是：",
    "直接向环境排放废液",
    "未经处理不得向环境排放",
    "分别收集，集中处理，将毒害降低至国家规定范围再排放",
    "配备专门废液回收桶，交由有关部门处理回收",
]
str_test[186] = ["甲苯的毒性等级是：", "剧毒", "高毒", "微毒", "低毒"]
str_test[187] = ["苯的毒性等级是：", "剧毒", "高毒", "微毒", "低毒"]
str_test[188] = ["丙酮的毒性等级是：", "剧毒", "高毒", "微毒", "低毒"]
str_test[189] = ["甲醛的毒性等级是：", "剧毒", "高毒", "中等毒性", "低毒"]
str_test[190] = ["乙醇的毒性等级是：", "剧毒", "高毒", "微毒", "低毒"]

# 基本防护
str_test[191] = ["实验中被玻璃划伤，首先要如何处理：", "用大量水冲洗", "先止血", "应把碎玻璃从伤口挑出", "立即就医"]
str_test[192] = ["处理酸灼伤的方式有：", "严重时消毒，擦干后涂烫伤膏", "立即用大量水冲洗", "以1~2%的碳酸氢钠溶液冲洗", "以上都对"]
str_test[193] = ["处理碱烧伤的正确方式是：", "立即用1~2%的醋酸冲洗", "立即用大量水冲洗", "立即就医", "以上都对"]
str_test[194] = ["处理溴灼伤的方式是：", "涂甘油或烫伤膏", "立即用大量水冲洗", "用乙醇擦至伤口呈白色", "以上都对"]
str_test[195] = ["进行危险物质、挥发性有机溶剂的操作实验或研究时，需要佩戴的防护用具有：", "防护口罩", "防护手套", "防护眼镜", "以上都要"]
str_test[196] = ["常用的化学防具有：", "工作服", "防护眼镜", "橡胶手套", "以上都是"]
str_test[197] = ["下列不属于化学防护用具的是", "工作服", "一次性口罩", "橡胶手套", "防护眼镜"]
str_test[198] = ["适合在化学实验室穿着的鞋有：", "凉鞋", "高跟鞋", "胶底鞋", "拖鞋"]
str_test[199] = [
    "为避免误食化学药品，应做到：",
    "不准把食物、饮用水、食具带入实验室",
    "禁止在实验室里吃口香糖",
    "使用化学药品后须洗净手后才能进食",
    "以上都对",
]

answer[100:200:1] = [
    2,
    2,
    1,
    3,
    4,
    1,
    1,
    3,
    2,
    4,
    1,
    3,
    3,
    1,
    3,
    4,
    2,
    2,
    4,
    3,
    4,
    3,
    1,
    4,
    3,
    2,
    2,
    4,
    2,
    2,
    4,
    1,
    3,
    3,
    2,
    2,
    3,
    4,
    4,
    4,
    4,
    2,
    2,
    1,
    2,
    1,
    2,
    2,
    2,
    4,
    4,
    3,
    2,
    3,
    2,
    4,
    1,
    3,
    4,
    2,
    4,
    1,
    4,
    4,
    4,
    4,
    4,
    3,
    4,
    3,
    1,
    2,
    1,
    4,
    3,
    2,
    3,
    4,
    1,
    3,
    2,
    3,
    2,
    2,
    2,
    1,
    4,
    2,
    4,
    3,
    3,
    3,
    4,
    4,
    4,
    4,
    4,
    2,
    3,
    4,
]
# 曾佩欣出题200-299
str_test[200] = [
    "化学实验室必须坚持的安全生产方针是:",
    "安全第一，预防为主",
    "安全为主，预防第一",
    "安全为主，处理第一",
    "处理第一，安全为主",
]
str_test[201] = [
    "以下关于用电的说法正确的是:",
    "所有仪器设备的金属外壳都必须接地线",
    "实验室可以在短时间内超量存放易燃易爆物品",
    "不应过度依赖电器开关自动控制",
    "雷雨天气时应当停止带电的实验操作",
]
str_test[202] = [
    "以下国家标准中，不是化学实验室纯水遵循的标准的是:",
    "GB 19298-2014",
    "GB/T 601-2016",
    "GB/T 602-2002",
    "GB/T 33087-2016",
]
str_test[203] = ["以下物质中不是剧毒品的是:", "氰化钾", "二氧化氢", "氰化钠", "丙烯腈"]
str_test[204] = [
    "以下物质中熔点最低的是:",
    "N,N-二异丙基乙胺",
    "1-羟基苯并三唑",
    "1-(3-二甲氨基丙基)-3-乙基碳二亚胺盐酸盐",
    "对硝基苯胺",
]
str_test[205] = ["配制好的氢氧化钠溶液应储存在什么容器中:", "棕色橡皮塞试剂瓶", "棕色磨口试剂瓶", "无色橡皮塞试剂瓶", "无色磨口试剂瓶"]
str_test[206] = ["以下操作中，无法加速溶解的是:", "过滤", "加热", "研细", "搅拌"]
str_test[207] = ["易燃、有毒挥发性物质的分析化验工作，要在哪里进行:", "通风处", "通风橱", "户外", "净化工作台"]
str_test[208] = [
    "如需在实验室中安装新的电气设备，以下做法正确的是:",
    "学生自行安装",
    "导师自行安装",
    "联系电工安装",
    "向学校有关部门提出申请并得到批准后，由学校安排的电工安装",
]
str_test[209] = [
    "以下关于实验室用水的说法正确的是:",
    "水龙头漏水量较小时，可不用理会",
    "人离开，水要关掉",
    "上水管与水龙头的连接处必须夹紧，下水管与冷凝管的连接处不必夹紧",
    "上水管与水龙头的连接处不必夹紧，下水管与冷凝管的连接处必须夹紧",
]
str_test[210] = [
    "由浓硫酸制备稀盐酸应该按以下操作:",
    "将浓盐酸倒入水中",
    "将水倒入浓盐酸中",
    "用玻璃棒一边轻轻搅拌一边将浓盐酸倒入水中",
    "用玻璃棒一边轻轻搅拌一边将水倒入浓盐酸中",
]
str_test[211] = [
    "铬酸洗液的配置材料是:",
    "K2CrO4和浓HCl",
    "K2CrO4和浓H2SO4",
    "K2CrO7和浓HCl",
    "K2CrO7和浓H2SO4",
]
str_test[212] = ["在实验室中，以下哪种物品有关的实验不需要在通风柜中进行:", "一氧化碳", "一氧化二氢", "硫化氢", "二氧化氮"]
str_test[213] = ["在化学实验室中，废液的含义是:", "污水", "已失去使用价值或无法利用的溶液", "放置很久的溶液", "经过蒸发后的溶液"]
str_test[214] = ["以下哪个物品不可接触皮肤及冷水:", "洗净的试管", "试管刷", "刚加热过的玻璃容器", "容量瓶"]
str_test[215] = ["若即将进行的实验有引发静电爆炸的危险，应提前将实验室的相对湿度调节至:", "10%", "20%", "50%", "80%"]
str_test[216] = ["以下哪个不是分析实验室用水的级别:", "一级水", "二级水", "三级水", "四级水"]
str_test[217] = ["以下化学性质中，不属于HCl的是:", "易燃", "有强腐蚀性", "有毒", "能与碱发生反应"]
str_test[218] = ["干燥剂变色硅胶失效后呈什么颜色:", "红色", "白色", "黑色", "蓝色"]
str_test[219] = ["搬运和使用腐蚀性药品时，不必要的装备是:", "隔热手套", "橡皮手套", "护目镜", "深筒胶鞋"]
str_test[220] = ["以下选项中，不属于常见的废液分类的是:", "有机废液", "强酸废液", "强碱废液", "水溶液"]
str_test[221] = ["发现火灾应当拨打以下哪个电话:", "110", "119", "120", "12345"]
str_test[222] = ["漏电保护器可以防止:", "触电事故", "电压过载", "电器超负荷", "火灾"]
str_test[223] = ["以下不是实验室用水安全隐患的是:", "使用蒸馏水", "冷凝装置胶管老化", "冷凝装置胶管滑脱", "半年更换一次冷凝装置胶管"]
str_test[224] = [
    "以下关于HCl的意外事故中，处理方法错误的是:",
    "皮肤接触时，立即脱去污染的衣物并用大量流动水清洗",
    "不慎食用时，立即服用牛奶或蛋清",
    "少量吸入时，迅速脱离现场到空气新鲜处",
    "少量泄露时，立即用石灰乳或苏打粉混合",
]
str_test[225] = [
    "搬运酸碱前，不是必须做的检查是:",
    "检查搬运器具的强度",
    "检查酸碱的纯度",
    "检查容器的位置固定是否稳定",
    "检查容器是否密封",
]
str_test[226] = ["含哪种元素的废液不必经过处理达标后才能排放:", "贡", "氮", "镉", "铅"]
str_test[227] = ["以下不属于实验室废液常见收集分类的是:", "可燃性物质", "难燃性物质", "含碳物质", "固体物质"]
str_test[228] = ["窒息灭火法应当使用的工具是:", "玻璃瓶", "水", "二氧化碳灭火器", "干粉灭火器"]
str_test[229] = ["下面分别是实验室内照明线路的四条回路的总容量，请问哪个是合理的:", "1.5kW", "2.01kW", "3kW", "10kW"]
str_test[230] = [
    "以下关于实验室用水的操作中，哪一个是正确的:",
    "冬天时，室外水管可用麻绳缠绕",
    "对已冰冻的水表，可以用沸水融化",
    "为了使自来水管解冻，可以用火烘烤",
    "冬天时，可在室外水管下烤火以防止冰冻",
]
str_test[231] = ["以下性质中，不属于浓硫酸的是:", "强氧化性", "脱水性", "吸水性", "碱性"]
str_test[232] = ["以下器皿可以用来测量体积的是:", "烧杯", "三角烧瓶", "试剂瓶", "量筒"]
str_test[233] = ["废液的处理方法不包括:", "蒸馏法", "焚烧法", "溶液萃取法", "生物化学处理法"]
str_test[234] = ["下列废液中，可以互相混合的是:", "过氧化物和有机物", "硫化物和酸", "盐酸和氢氟酸", "铵盐和碱"]
str_test[235] = ["实验室内储存可燃物资的仓库的管理，必须执行国家有关什么内容的规定:", "消防安全", "物资安全", "劳动安全", "人员安全"]
str_test[236] = ["以下物品中可以在实验室安装和使用的是:", "闸刀开关", "木质配电板", "电炉", "静电测试仪"]
str_test[237] = ["以下不属于实验室一级水应用范围的是:", "液相色谱/质谱", "动物饮用水", "原子吸收", "细胞培养"]
str_test[238] = ["浓硫酸与稀硫酸的区别是:", "浓硫酸具有强氧化性", "浓硫酸具有腐蚀性", "浓硫酸具有酸性", "稀硫酸吸水性更强"]
str_test[239] = ["加热乙醚时，不可以使用的加热方法是:", "酒精灯加热", "水浴加热", "油浴加热", "电热套加热"]
str_test[240] = ["根据国标，废液中贡的最高容许排放浓度为多少mg/L:", "0.01", "0.05", "0.1", "0.5"]
str_test[241] = ["以下废液中，一般不使用沉淀法来处理的是:", "含氰废液", "有机废液", "含重金属废液", "含砷废液"]
str_test[242] = ["使用灭火器或高压水枪灭火时，应该对准火焰的什么部位喷射:", "外焰", "内焰", "焰心", "都可以"]
str_test[243] = ["在做需要带电操作的低电压电路实验时，安全的做法是:", "双手操作", "单手操作", "戴上隔热手套操作", "使用镊子等工具操作"]
str_test[244] = ["以下方法中，无法获得纯水的是:", "蒸馏法", "反渗透法", "离子交换法", "萃取法"]
str_test[245] = ["皮肤接触浓硫酸后，错误的处理方法是:", "用棉布吸去皮肤上的硫酸", "用小苏打溶液冲洗", "就医", "直接用清水冲洗"]
str_test[246] = ["为防止加热时暴沸，可往容器中加入:", "干冰", "砂砾", "沸石", "玻璃片"]
str_test[247] = ["下列选项中，不属于化学实验室基本防护要求的是:", "必须佩戴防护眼镜", "穿胶鞋", "不得在实验室披散长发", "佩戴护目镜"]
str_test[248] = [
    "下列措施中，哪一种无益于防毒:",
    "实验前了解药品的毒性和防护措施",
    "使用有毒气体时在通风橱中进行",
    "避免与有机溶液进行直接接触",
    "实验前服用解毒剂",
]
str_test[249] = ["实验室的电器燃烧发生火灾，在没有灭火器的情况下应当:", "用水扑救", "用毛巾包裹", "切断电源", "用玻璃罩罩住着火电器"]
str_test[250] = ["使用电烙铁时，我们可以做的事情是:", "乱甩焊锡", "将电烙铁放在桌面上", "用完及时切断电源", "在周围放一瓶汽油"]
str_test[251] = [
    "用蒸馏法制备pH=7的高纯水时，错误的操作是:",
    "加入氢氧化钠与高锰酸钾",
    "加入磷酸",
    "用石英蒸馏器蒸馏",
    "直接在空气中进行实验",
]
str_test[252] = ["以下性质中，不属于硝酸的是:", "强酸", "强还原剂", "具有腐蚀性", "遇光易分解"]
str_test[253] = ["以下选项中，不属于量器类器皿的是:", "量筒", "烧杯", "移液管", "滴定管"]
str_test[254] = ["以下物质中，易发生支链爆炸的是:", "氢", "过氧化物", "乙炔铜", "三硝基甲苯"]
str_test[255] = ["以下物品中，不属于易灼伤皮肤的物品的是:", "稀盐酸", "高温物体", "溴", "霖"]
str_test[256] = ["有机物着火时，应当用什么灭火:", "其它有机物", "自来水", "蒸馏水", "灭火器或沙子"]
str_test[257] = ["以下措施中不能防静电的是:", "铺设导电性地板", "穿着防静电工作服", "在高压带电体上加装屏蔽措施", "保持空气干燥"]
str_test[258] = ["氢氧化钠不可以用来制备不含以下哪种物质的蒸馏水:", "氯化钠", "酚类物质", "亚硝酸", "碘"]
str_test[259] = ["以下储存环境中，不适合用来储存硝酸的是:", "棕色瓶", "阴凉通风处", "距离热源较近", "储存柜内只有氧化剂"]
str_test[260] = ["向试管中加入固体粉末试剂时，纸条应该深入到试管的:", "底部", "2/3处", "1/3处", "1/2处"]
str_test[261] = [
    "以下操作中，无益于防止触电的是:",
    "修理或安装电器时先切断电源",
    "使用电器时保持手部干燥",
    "保持相对湿度处于一个稳定的水平",
    "不用双手同时触碰电线",
]
str_test[262] = ["氧气瓶的颜色是:", "红色", "白色", "天蓝色", "灰色"]
str_test[263] = ["以下哪种仪器的电源、导线要经常检查，以防止火灾:", "加热仪器", "称重仪器", "离心机", "通风橱"]
str_test[264] = ["以下措施中不能预防电气火灾的是:", "经常检查电气设备的运行情况", "合理选用电气设备", "保持空气干燥", "室内通风"]
str_test[265] = [
    "根据25℃时的电导率（mS/m）判断，以下哪一个选项的水不能作为实验使用水（包括一二三级）:",
    "0.01",
    "0.1",
    "0.5",
    "0.99",
]
str_test[266] = ["高氯酸的分子式是:", "HClO", "HClO2", "HClO3", "HClO4"]
str_test[267] = [
    "蒸馏时，正确的操作是:",
    "圆底烧瓶中加入的液体体积不能超过容积的2/3",
    "圆底烧瓶中加入的液体体积不能超过容积的1/3",
    "平底烧瓶中加入的液体体积不能超过容积的2/3",
    "平底烧瓶中加入的液体体积不能超过容积的1/3",
]
str_test[268] = [
    "使用高压气瓶时，不需要注意的是:",
    "气瓶与明火的距离不小于5米",
    "气瓶搬运要轻要稳",
    "气瓶内气体不可以用尽",
    "使用气瓶时，戴上橡胶手套",
]
str_test[269] = ["长期反复接受X光照射，一般不会导致:", "疲倦", "发烧", "记忆力减退", "白血球降低"]
str_test[270] = [
    "实验室预防火灾“三懂三会”不包括:",
    "懂所在实验室的火灾危险性，会拨打火警电话119",
    "懂预防火灾的措施，会使用灭火器材",
    "懂灭火的基本方法，会扑灭初期火灾",
    "懂灭火器的工作原理，会正确使用灭火器",
]
str_test[271] = ["发生触电事故的电压临界值是:", "20V", "36V", "65V", "220V"]
str_test[272] = [
    "以下步骤中，不属于由二级水制备一级水的过程的是:",
    "用三级水清理试管",
    "通过石英设备蒸馏",
    "经过离子交换混合床处理",
    "经0.2μm微孔滤膜过滤",
]
str_test[273] = ["冰醋酸的分子式是:", "C2H4", "C2H4O2", "C2H4O4", "C2H4O6"]
str_test[274] = [
    "判断玻璃仪器是否清洗干净的标准是:",
    "器壁上的水凝成水滴",
    "器壁上的水成股流下",
    "器壁上的水既不凝成水滴，也不成股流下",
    "器壁上无水",
]
str_test[275] = ["化学实验室应配备的个人防护用具不包括:", "洗淋装置", "洗眼器", "防护眼镜", "防护口罩"]
str_test[276] = ["化学实验室应配备的防护器材不包括:", "通风橱", "集气罩", "过滤式呼吸器", "电子体温枪"]
str_test[277] = ["黄磷自燃应如何扑灭:", "用高压水枪", "用泡沫灭火器", "用抹布盖住", "用雾状水"]
str_test[278] = ["实验室若要防止触电，应选择的漏电保护开关的漏电动作电流为:", "10mA", "30mA", "50mA", "110mA"]
str_test[279] = ["不属于分析用水质量要求的指标是:", "可氧化物质", "密度", "吸光度", "电导率"]
str_test[280] = ["以下酸中酸性最强的是:", "HCl", "HClO4", "HClO", "HClO3"]
str_test[281] = ["干燥烧杯时，错误的做法是:", "用火烤干", "用纸擦干", "酒精润洗后吹干", "放在烘箱内烘干"]
str_test[282] = ["对爆炸品、毒害品和腐蚀品的存放原则不包括:", "隔离贮存", "隔开贮存", "分离贮存", "分开贮存"]
str_test[283] = ["使用三硝基甲苯时，要注意避免的不包括:", "摩擦", "光照", "震动", "明火"]
str_test[284] = ["实验室金属钠着火应如何扑灭:", "用泡沫灭火器", "用高压水枪", "用沙子覆盖", "用煤油"]
str_test[285] = ["我国的民用电路电压为:", "直流电压110V", "直流电压220V", "交流电压110V", "交流电压220V"]
str_test[286] = ["国家规定的实验室用水分为多少级:", "1", "2", "3", "4"]
str_test[287] = ["无水硫酸亚铁晶体的颜色是:", "蓝色", "棕色", "白色", "浅绿色"]
str_test[288] = [
    "用pH试纸测定溶液的pH时，正确的做法是:",
    "将试纸放入溶液中浸润",
    "将溶液倒在试纸上",
    "用手指蘸取溶液，涂抹在试纸上",
    "用玻璃棒蘸取溶液，滴在试纸上",
]
str_test[289] = ["乙二醇中毒的应急处理方法不包括:", "服用牛奶和鸡蛋清", "洗胃", "静脉注射10毫升10％的葡萄糖酸钙", "进行人工呼吸"]
str_test[290] = ["甲醇中毒的应急处理方法不包括:", "大量光照", "洗胃", "吞服碳酸氢钠", "饮服50％的乙醇溶液"]
str_test[291] = ["火灾蔓延可能的途径有:", "热传导", "热对流", "热辐射", "以上都可能"]
str_test[292] = [
    "下列实验室用电操作中，不正确的是:",
    "电器保险丝烧断后，用其它金属导线代替",
    "实验前先检查电路完整，再打开电源",
    "实验结束后，先关闭实验设备，再关闭电源",
    "离开实验室时，随手关闭电源",
]
str_test[293] = ["一级水的吸光度标准是:", "大于等于0.01", "大于等于0.001", "小于等于0.01", "小于等于0.001"]
str_test[294] = ["重铬酸钾的性质是:", "溶于水", "溶于乙醇", "水溶液呈弱碱性", "无毒"]
str_test[295] = ["蒸发时，不需要使用的仪器是:", "蒸发皿", "酒精灯", "温度计", "玻璃棒"]
str_test[296] = ["重金属铬的哪一个价态毒性最强:", "金属铬", "二价铬", "三价铬", "六价铬"]
str_test[297] = ["碘化汞结晶的颜色是:", "白色", "黄色", "红色", "红棕色"]
str_test[298] = ["全国消防安全宣传教育日是哪一天:", "9月11日", "11月9日", "10月1日", "12月12日"]
str_test[299] = ["以下物质中，可以在烘箱中烘干的是:", "硼砂", "重铬酸钾", "苯甲酸", "乙醚抽提物"]

answer[200:300:1] = [
    1,
    4,
    1,
    2,
    1,
    3,
    1,
    2,
    4,
    2,
    3,
    4,
    2,
    2,
    3,
    3,
    4,
    1,
    1,
    1,
    4,
    2,
    1,
    1,
    4,
    2,
    2,
    3,
    3,
    1,
    1,
    4,
    4,
    1,
    3,
    1,
    4,
    2,
    1,
    1,
    2,
    2,
    3,
    2,
    4,
    4,
    3,
    2,
    4,
    3,
    3,
    4,
    2,
    2,
    1,
    1,
    4,
    4,
    1,
    3,
    2,
    2,
    3,
    2,
    4,
    4,
    3,
    2,
    4,
    3,
    3,
    4,
    2,
    2,
    1,
    1,
    4,
    4,
    1,
    3,
    2,
    2,
    4,
    2,
    3,
    4,
    3,
    3,
    3,
    1,
    4,
    4,
    1,
    4,
    1,
    3,
    4,
    2,
    2,
    2,
]

# 以下由李雨婕提供

str_test[300] = [
    "以下哪个地方不能用明火加热有机溶剂:",
    "开口容器或密闭体系中",
    "装有蒸气冷凝装置",
    "装有合适的尾气排放装置",
    "通风良好的环境",
]
str_test[301] = ["钠、钾等金属失火时，应该用什么方法灭火:", "用水灭火", "用CCl4灭火器", "用干燥的细沙覆盖", "用二氧化碳灭火器"]
str_test[302] = ["油脂和电器起火时，应该使用什么灭火:", "用水", "用CCl4灭火器", "用干燥的细沙覆盖", "用二氧化碳灭火器"]
str_test[303] = [
    "对在容器中(如烧杯，烧瓶，热水漏斗等)发生的局部小火，应该使用什么灭火:",
    "用水",
    "用石棉网表面皿等盖灭",
    "用干燥的细沙覆盖",
    "用二氧化碳灭火器",
]
str_test[304] = [
    "衣服着火时，以下做法错误的是:",
    "化纤织物不用立即脱除",
    "小火可用湿抹布、灭火毯等包裹使火熄灭",
    "火势较大，可就近用水龙头浇灭",
    "必要时可就地卧倒打滚",
]
str_test[305] = [
    "对于气体钢瓶，以下说法错误的是:",
    "不得让气体钢瓶在地上滚动",
    "不得撞击钢瓶表头",
    "不得随意调换表头",
    "搬运钢瓶时可以使用货车",
]
str_test[306] = [
    "对于以下皮肤灼伤后的急救措施，错误的是:",
    "酸（浓硫酸应先用干净的抹布吸去）灼伤先用大量水冲洗",
    "碱灼伤应先脱去污染衣物，用大量流动清水冲洗污染的皮肤10分钟左右",
    "对氢氧化钾灼伤，要冲洗到创面无肥皂样滑腻感",
    "若创面起水泡,均不宜把水泡挑破",
]
str_test[307] = [
    "干粉灭火器的使用方法，错误的是:",
    "拿着把手将灭火器提起，使用前先将瓶身颠倒几次",
    "拔去保险",
    "在离起火点一点五米以上的侧后方瞄准起火点",
    "左手握喷管，右手按住喷射装置，对准起火点喷射，且垂直竖向移动，将干粉包围覆盖起火点",
]
str_test[308] = ["疏散标志的据地面高度不能超过多少:", "25cm", "50cm", "1m", "1.5m"]
str_test[309] = ["疏散标志的安装距离不能超过多少:", "10m", "15m", "20m", "30m"]
str_test[310] = [
    "以下说法错误的是:",
    ".黄磷在空气中会着火，故要把它放入PH值7～9的水中保存，并避免阳光照射",
    "硫黄粉末吸潮会发热而引起着火",
    "金属粉末若在空气中加热，即会剧烈燃烧",
    "碳化钙与水反应产生乙烯，会引起着火、爆炸",
]
str_test[311] = ["人体通过多少mA以上的交流电会致死:", "25", "50", "75", "100"]
str_test[312] = [
    "以下做法正确的是:",
    "实验时先接好线路再插上电源",
    "实验时先插上电源再接好线路",
    "实验结束后先拆好线路再切断电源",
    "实验时可以不用切断电源更换线路",
]
str_test[313] = ["如遇电线走火，下列做法错误的是:", "立即切断电源", "用水灭火", "用沙灭火", "用二氧化碳灭火器灭火"]
str_test[314] = ["使用煤气时，下列做法正确的是:", "可以直接点火", "点火前先关闭空气阀", "点火后关闭空气阀", "点火前先开空气阀"]
str_test[315] = ["对于触电急救，以下做法正确的是:", "立即切断电源或设法使触电人脱离电源", "直接拉开触电者", "直接拿走电线", "什么也不做"]
str_test[316] = ["室内若有哪种气体时，应避免产生电火花:", "氧气", "氦气", "二氧化碳", "氢气"]
str_test[317] = [
    "电源或电器设备的保险丝烧断时，正确的做法是:",
    "先查明烧断原因",
    "直接按原负荷选用适宜的保险丝进行更换",
    "选用加大负荷的保险丝进行更换",
    "用其它金属线代用",
]
str_test[318] = [
    "高压气瓶的减压器应该如何正确使用:",
    "开、关减压器时，动作必须迅速",
    "使用时应先开减压器，后旋动开关阀",
    "安装时旋紧，防止泄漏",
    "用完，先关闭减压器，再关开关阀",
]
str_test[319] = ["蒸馏水不含下列哪种物质:", "一氧化碳", "氨", "二氧化碳", "二氧化硅"]
str_test[320] = ["实验室用水种类不包括:", "反渗水", "蒸馏水", "超纯水", "自来水"]
str_test[321] = [
    "下列关于实验室用水说法错误的是:",
    "上水管与水龙头连接处必须用管箍夹紧固定",
    "上、下水管与仪器或冷凝水管的连接处必须用管箍夹紧固定",
    "冷却水输水管使用乳胶管",
    "水管必须插入水槽中的下水管道中",
]
str_test[322] = [
    "对于液氨的使用，下列做法错误的是:",
    "戴上绝缘防护手套",
    "穿上长度过膝的长袖实验服",
    "穿上过脚踝不露脚面的鞋，戴好防护眼镜，必要时戴防护面罩",
    "关闭门窗",
]
str_test[323] = ["下列不属于洗液的分类的是:", "酸性洗液", "低碱性洗液", "碱性洗液", "中性洗液"]
str_test[324] = ["下列哪种气体无毒:", "一氧化碳", "氯气", "二氧化碳", "二硫化氢"]
str_test[325] = ["使用下列哪种气体的实验需要在通风橱上进行:", "氧气", "氟化氢", "二氧化碳", "氦气"]
str_test[326] = ["下列哪个东西的作用主要是吸收过滤有毒物质:", "防护眼镜", "防护服", "防护面罩", "防护手套"]
str_test[327] = ["存放化学品中，氨可以与什么接触:", "碱", "卤素", "汞", "次氯酸"]
str_test[328] = ["下列说法正确的是:", "金属钠应贮存于煤油中", "黄磷应贮存于水中", "汞应贮存于水中", "金属钾应贮存于水中"]
str_test[329] = ["易爆品宜宜存于多少℃以下:", "10", "15", "20", "25"]
str_test[330] = ["关于易燃固体药品的保存方法错误的是:", "密封置于阴凉处避光保存", "远离火源", "注意通风", "可以跟氧化剂一起存放"]
str_test[331] = [
    "关于有腐蚀性危险化学品的保存方法错误的是:",
    "盛于带盖（塞）的铁质容器中",
    "置于低温阴凉处",
    "不要与氧化剂放在一起",
    "不要与易燃易爆药品放在一起",
]
str_test[332] = ["下列哪个属于有毒类危险化学品:", "过氧化钠", "过氧化钡", "过氧化氢", "三氧化二砷"]
str_test[333] = ["在正常储存条件下，一般化学试剂贮有不宜超过多少年:", "1", "2", "3", "4"]
str_test[334] = ["使用苦味酸时，需要避免与以下哪个接触:", "还原剂", "酸类", "重金属粉末", "非金属粉末"]
str_test[335] = ["使用重铬酸钾时，需要避免与什么接触:", "还原剂", "氧化剂", "酸类", "碱类"]
str_test[336] = ["对于硝酸铵，下列操作人员的穿戴错误的是:", "佩戴自吸过滤式防尘口罩", "戴化学安全防护眼镜", "穿胶布防毒衣", "戴橡胶手套"]
str_test[337] = ["对于石油醚，下列操作人员的穿戴错误的是:", "佩戴过滤式防毒面具", "戴化学安全防护眼镜", "穿聚乙烯防毒衣", "戴橡胶耐油手套"]
str_test[338] = ["使用哪种化学品时，需要穿防静电工作服:", "过硫酸铵", "丙酮", "二异丙胺", "高锰酸钾"]
str_test[339] = ["使用哪种化学品时，需要穿防毒物渗透工作服:", "过硫酸铵", "丙酮", "二异丙胺", "高锰酸钾"]
str_test[340] = ["使用氨水时，操作人员应该穿什么类型的服装:", "胶布防毒衣", "聚乙烯防毒衣", "防静电工作服", "防酸碱工作服"]
str_test[341] = ["使用邻联甲苯胺时，操作人员应该穿什么类型的服装:", "连衣式胶布防毒衣", "聚乙烯防毒衣", "防静电工作服", "防酸碱工作服"]
str_test[342] = ["使用三氯甲烷时，操作人员应该穿什么类型的服装:", "胶布防毒衣", "防毒物渗透工作服", "防静电工作服", "防酸碱工作服"]
str_test[343] = ["使用以下哪种化学品时，操作人员不是戴橡胶手套:", "硝酸铵", "石油醚", "三氯甲烷", "铬酸钾"]
str_test[344] = ["哪种化学品需要避免与玻璃制品接触:", "氢氟酸", "氢氧化钠", "盐酸", "硫酸"]
str_test[345] = ["以下哪种酸稀释时，可以把水加入酸中:", "硫酸", "盐酸", "磷酸", "硝酸"]
str_test[346] = ["下列物品不属于易燃液体的是:", "乙醚", "乙醇", "苯", "5%稀硫酸"]
str_test[347] = ["以下物品不需要储存在棕色瓶中且置于低温阴凉处的是:", "卤化银", "浓硝酸", "过氧化氢", "催化剂"]
str_test[348] = ["除了高温以外，下列物质会灼伤皮肤的是:", "强碱", "强氧化剂", "稀草酸", "冰醋酸"]
str_test[349] = ["下列物质不属于剧毒化学品的是:", "氯乙酸", "硫酸钡", "丙烯醛", "铊"]
str_test[350] = [
    "对于废液处理，下列说法正确的是:",
    "在证明废液浓度已相当小而又安全时，可以排放到排水沟中",
    "实验室内大量使用冷凝用水，无污染可直接排放",
    "用剩的废液倒回原瓶避免浪费",
    "洗刷用，污染不大，可排入下水道",
]
str_test[351] = ["实验室“三废”指的是:", "废气、废液、固体废物", "废气、废水、固体废物", "废气、废料、废屑", "废液、废渣、废料"]
str_test[352] = [
    "如何处理废弃的有害固体药品:",
    "倒入生活垃圾处",
    "经处理解毒后，倒入生活垃圾处",
    "收集起来卖给小贩",
    "收集起来由专业公司处理",
]
str_test[353] = ["如何处理用过的废洗液:", "排放到排水沟中", "收集起来洗厕所", "收集起来卖给小贩", "作为废液交由相关部门统一处理"]
str_test[354] = [
    "当金属汞不小心撒落地面时，下列处理方法不正确的是:",
    "撒上硫磺粉，生成毒性较小的硫化汞",
    "立即打扫干净或收集起来",
    "喷上用盐酸酸化过的高锰酸钾溶液",
    "喷上20%三氯化铁水溶液，干后再清除",
]
str_test[355] = ["下列废液不能互相混合的是:", "过氧化物和氧化物", "盐酸和氢氟酸", "铵盐与碱", "过硫化物和硫化物"]
str_test[356] = [
    "对于实验室废渣的处理方法，下列说法不正确的是:",
    "有毒的废渣应及时处理",
    "一般固体，可定期集中处理",
    "一律都采用深埋或焚烧的方式处理",
    "有价值的回收处理，少量无价值的可深埋或焚烧",
]
str_test[357] = ["下列物质属于剧毒化学品的是:", "四氯化碳", "环己烷", "二氯化汞", "乙酸乙酯"]
str_test[358] = [
    "处理有毒的废液时，下列说法不正确的是:",
    "稀释后用大量水冲净",
    "不得随意排放到下水道",
    "贴标识，妥善处理",
    "交由相关部门统一处理",
]
str_test[359] = ["下列物质属于高毒化学品的是:", "甲苯", "苯", "丙酮", "甲醇"]
str_test[360] = ["白磷应如何存放:", "直接存放在广口瓶中", "直接存放在细口瓶中", "存放在煤油中", "存放在水中"]
str_test[361] = [
    "下列说法正确的是:",
    "实验用品不足时可以手拿药品",
    "需要嗅闻气体的气味，应用手在瓶口轻轻扇动，仅使极少量的气体进入鼻孔",
    "可以舌尝药品的味道",
    "直接用鼻闻试剂",
]
str_test[362] = ["块状及条状药品如何取用:", "用药匙", "用V形纸槽", "用镊子夹取", "直接倾倒"]
str_test[363] = [
    "滴管应如何滴入试剂:",
    "保持垂直悬于容器口上方滴加",
    "倾斜并在容器口上方滴加",
    "滴管紧挨容器壁滴加",
    "保持垂直并伸入容器口滴加",
]
str_test[364] = ["如何正确倾倒液体试剂:", "标签应向着手心", "标签应正对着自己", "标签应背对着自己", "标签应向着容器"]
str_test[365] = ["如何正确读取量筒示数:", "眼睛仰视液面最低处", "眼睛俯视液面最低处", "眼睛平视液面最低处", "眼睛平视液面最高处"]
str_test[366] = [
    "关于胶头滴管的使用，下列说法错误的是:",
    "不能伸入和接触容器内壁",
    "不能平放和倒拿",
    "不能随意放置",
    "吸取别的试剂前不需要清洗",
]
str_test[367] = ["下列不能作为反应容器的是:", "烧杯", "容量瓶", "试管", "锥形瓶"]
str_test[368] = [
    "用容量瓶定容时不小心超过了刻度线，正确的做法是:",
    "将多余的液体倒回烧杯中",
    "重新配制溶液",
    "用滴管吸取多余的液体倒入废液缸",
    "用滴管吸取多余的液体倒入排放口",
]
str_test[369] = ["实验室中不可以直接加热的仪器是:", "试管", "蒸发皿", "烧杯", "坩埚"]
str_test[370] = [
    "过氧化苯甲酸在适当条件下可放出氧发生爆炸，在使用时下列说法错误的是:",
    "在手套箱内操作",
    "环境温度不要高于30℃",
    "通风要良好",
    "不要与有机物或还原性物质共同使用",
]
str_test[371] = ["下列物质中不可以盛放在金属离心管的是:", "有机溶剂", "酶溶液", "盐溶液", "普通水溶液"]
str_test[372] = [
    "关于做普通溶剂时的操作，下列说法错误的是:",
    "充分了解各馏分的沸点",
    "蒸馏瓶内可以不用加入沸石",
    "仔细检查装置的密闭性",
    "具有充分的冷却效果，并尽量使蒸馏在通风柜里操作",
]
str_test[373] = [
    "关于氮气瓶的使用，下列说法错误的是:",
    "氮气瓶的存放应远离火源",
    "发生火灾时，应尽量将氮气瓶移至空旷处",
    "发生泄漏时，应迅速撤离人员至安全处",
    "氮气发生泄漏时，由于氮气无毒不燃，不需要注意现场通风",
]
str_test[374] = [
    "使用乙炔气时，下列说法错误的是:",
    "周围不可有明火，避免产生电火花",
    "操作人员必须穿防静电工作服",
    "房间应通风良好",
    "室内应有高湿度",
]
str_test[375] = [
    "取用化学品时，下列说法错误的是:",
    "不能用手直接接触化学品",
    "取用时，瓶塞应倒置于桌面上，取用后立即盖严",
    "取出后多余的药品可以倒回原瓶，减少浪费",
    "使用干净器具，且禁止混用",
]
str_test[376] = ["可以在化学实验室穿着的鞋是:", "运动鞋", "高跟鞋", "拖鞋", "洞洞鞋"]
str_test[377] = [
    "使用高温实验装置时，下列说法错误的是:",
    "在通风密闭的房间内使用",
    "注意防护，避免烫伤",
    "熟悉高温实验装置的使用方法，并严格规范操作",
    "使用时，要求在有防火设施的室内进行",
]
str_test[378] = [
    "涉及有毒试剂的操作时，下列说法错误的是:",
    "在通风橱中操作",
    "只需要穿戴防毒的工作服",
    "做好应急救援预案",
    "了解试剂的毒性",
]
str_test[379] = ["下列加热方式在实验室中原则上不得使用的是:", "水浴", "明火电炉", "油浴", "电热板"]
str_test[380] = ["箱式电阻炉使用过程中，当温度降至多少以下，才可以打开炉门:", "200℃", "300℃", "400℃", "500℃"]
str_test[381] = ["易燃化学试剂允许存放的最高室温是:", "20℃", "30℃", "40℃", "50℃"]
str_test[382] = [
    "稀释浓硫酸时，应如何操作:",
    "将水缓慢倒入酸中，并不断搅拌",
    "将水和浓硫酸同时倒入容器中，并不断搅拌",
    "将浓硫酸缓慢倒入水中，并不断搅拌",
    "将浓硫酸迅速倒入水中，并不断搅拌",
]
str_test[383] = [
    "领取及存放化学药品时，下列说法错误的是:",
    "确认标签上的中文名称是否为所需的化学药品",
    "学习并清楚化学药品的危害标示及图样",
    "化学药品应按照各自的类别分类存放",
    "有机溶剂、固体药品、酸碱化合物可以放在同一药品柜中",
]
str_test[384] = ["下列不属于易燃化学试剂的是:", "乙醚", "苯", "水", "汽油"]
str_test[385] = ["显微镜的物镜和目镜如有灰尘，应用什么来擦拭:", "纸巾", "纱布", "毛刷", "镜头纸"]
str_test[386] = ["恒温培养箱的使用最高温度是:", "60℃", "50℃", "100℃", "25℃"]
str_test[387] = ["分光光度计的比色皿盛样品液应为:", "三分之一左右", "三分之二左右", "二分之一左右", "装满"]
str_test[388] = ["干燥箱的使用温度范围为:", "50℃-250℃", "60℃-250℃", "50℃-150", "60℃-150℃"]
str_test[389] = ["用光电池为检测器的分光光度计连续使用不能超过多少个小时:", "1", "2", "3", "4"]
str_test[390] = ["下列不属于实验室防护着装的是:", "护目镜", "橡胶手套", "防静电服", "一次性口罩"]
str_test[391] = ["毒性级别为微毒的物质是:", "甲醛", "甲苯", "乙醇", "甲醇"]
str_test[392] = ["离心管中液体样品装量一般为离心管体积的多少为宜:", "三分之一", "三分之二", "二分之一", "四分之一"]
str_test[393] = [
    "关于化学品的使用、管理、存放，下列说法错误的是:",
    "有毒有害化学品不得敞放，取用称量应在通风橱内进行",
    "按照正规指南，安全处理危险物品",
    "谨慎对待没有做过的反应和没有用过的化学品",
    "有机溶剂可以置于冰箱保存",
]
str_test[394] = [
    "下列说法正确的是:",
    "放射性废物经过屏蔽处理后可以当作一般垃圾处理",
    "实验产生的易挥发物可以倒入废液缸中",
    "生物污染的液体在排放前必须进行污染清楚处理",
    "待处置的污染材料可以和生活垃圾一起集中处理",
]
str_test[395] = ["加热普通玻璃制品时，温度不能超过:", "100℃", "140℃", "180℃", "200℃"]
str_test[396] = ["氮气急性中毒会引起:", "中、重度昏迷", "慢性支气管炎", "猝死", "抽搐"]
str_test[397] = ["加热塑料和有机玻璃制品时，温度不能超过:", "40℃", "60℃", "80℃", "100℃"]
str_test[398] = ["化验室内的瓶装易燃液体存放总量不能大于:", "15L", "20L", "25L", "30L"]
str_test[399] = ["热线风速仪探头的工作温度是:", "150℃", "250℃", "350℃", "450℃"]

answer[300:400:1] = [
    1,
    3,
    4,
    2,
    1,
    4,
    2,
    4,
    3,
    3,
    4,
    4,
    1,
    2,
    2,
    1,
    4,
    1,
    3,
    1,
    4,
    3,
    4,
    2,
    3,
    2,
    1,
    1,
    4,
    3,
    4,
    1,
    4,
    2,
    3,
    1,
    3,
    3,
    2,
    3,
    4,
    1,
    2,
    3,
    1,
    2,
    4,
    4,
    3,
    2,
    3,
    1,
    4,
    4,
    2,
    3,
    4,
    3,
    1,
    2,
    4,
    2,
    3,
    1,
    1,
    3,
    4,
    2,
    2,
    3,
    1,
    3,
    2,
    4,
    4,
    3,
    1,
    1,
    2,
    2,
    1,
    2,
    3,
    4,
    3,
    4,
    1,
    2,
    1,
    2,
    4,
    3,
    2,
    4,
    3,
    3,
    1,
    2,
    2,
    2,
]


# 以下由谭杰提供
str_test[400] = ["火场逃生的原则", "抢救国家财产为上", "先带上日后生活必需钱财要紧", "安全撤离、救助结合", "逃命要紧"]
str_test[401] = ["楼内失火应", "从疏散通道逃离", "乘坐电梯逃离", "在现场等待救援", "见到门口就跑"]
str_test[402] = ["以下符合急救与防护“四先四后”原则的是", "先抢后救", "先轻后重", "先缓后急", "先病后伤"]
str_test[403] = ["电线插座损坏时，既不美观也不方便工作，并造成：", "吸潮漏电", "空气开关跳闸", "触电伤害", "以上都是"]
str_test[404] = ["触电事故中，导致人身伤亡的绝大部分是", "人体接受电流遭到电击", "烧伤", "电休克", "心肌梗塞"]
str_test[405] = [
    "有人触电时，使触电人员脱离电源的错误方法是：",
    "借助工具使触电者脱离电源",
    "抓触电人的手",
    "抓触电人的干燥外衣",
    "切断电源",
]
str_test[406] = ["被电击的人能否获救，关键在于：", "触电的方式", "能否尽快脱离电源和施行紧急救护", "触电电压的高低 人体电阻", "触电的位置"]
str_test[407] = ["国际规定，电压在( ) 伏以下不必考虑防止电击的危险", "36", "65", "25", "72"]
str_test[408] = ["以下不会引发火灾事故的是：", "电磁辐射", "冲击摩擦", "静电火花", "高温表面"]
str_test[409] = ["下列粉尘中，哪个的粉尘不能发生爆炸", "生石灰", "面粉", "煤粉", "铝粉"]
str_test[410] = ["下列属于不易燃液体的是：", "5%稀硫酸", "乙醇", "苯", "二硫化碳"]
str_test[411] = [
    "下面哪些物质彼此混合时，不容易引起火灾",
    "活性炭与硝酸铵",
    "硝酸、硫酸和盐酸",
    "抹布与浓硫酸",
    "可燃性物质（木材、织物等）与浓硫酸",
]
str_test[412] = [
    "可燃性及有毒气体钢瓶一律不得进入实验楼内，存放此类气体钢瓶的地方不需要注意什么问题",
    "阴凉通风",
    "严禁明火",
    "有防爆设施",
    "密闭",
]
str_test[413] = ["液化气发生火灾后不可采用哪种灭火器。", "清水灭火器", "干粉灭火器", "二氧化碳灭火器", "1211灭火器"]
str_test[414] = ["在遇到高压电线断落地面时，导线断落点多少米内，禁止人员进入。", "10", "20", "30", "40"]
str_test[415] = [
    "实验室安全管理实行哪种管理？",
    "校、（院）系、实验室三级管理",
    "校、（院）系两级管理",
    "院（系）、实验室两级管理",
    "实验事自行管理",
]
str_test[416] = ["火灾发生时，湿毛巾折叠8层为宜，其烟雾浓度消除率可达：", "40%", "60%", "80%", "95%"]
str_test[417] = ["眼睛被消毒液灼伤后，正确的急救方法是（ ）。", "点眼药膏", "立即打开眼睑，用清水冲洗眼睛", "马上到医院看急诊", "点眼药水"]
str_test[418] = ["如何在实验室放置盛汞的容器？", "密封即可", "在汞面上加盖一层硫粉", "在汞面上加盖一层水封", "放入通风橱中"]
str_test[419] = ["在普通冰箱中不可以存放什么物品？", "普通化学试剂", "酶溶液", "菌体", "有机溶剂"]
str_test[420] = [
    "实验时如果有有毒有害气体产生应该采取下列措施",
    "停止工作 ，人员离开实验室",
    "在通风橱内工作",
    "移到走廊工作",
    "戴上口罩继续工作",
]
str_test[421] = ["身上着火，最好的做法是：", "就地打滚或用水冲", "奔跑", "大声呼救", "边跑边脱衣服"]
str_test[422] = [
    "请从下列选项中选择万一发生电气火灾后首先应该采取的第一条措施",
    "打电话报警",
    "切断电源",
    "扑灭明火",
    "保护现场，分析火因，以便采取措施，杜绝隐患",
]
str_test[423] = ["天气较热时，打开腐蚀性液体，应该：", "直接用手", "用毛巾先包住塞子", "戴橡胶手套", "用纸包住塞子"]
str_test[424] = ["发生危险化学品事故后,应该向( )方向疏散", "下风", "上风", "顺风", "任意"]
str_test[425] = [
    "当不慎把大量浓硫酸滴在皮肤上时，正确的处理方法是",
    "用酒精棉球擦",
    "不作处理，马上去医院",
    "用碱液中和后，用水冲洗",
    "迅速以吸水性强的纸或布吸去后，马上再用大量水冲洗",
]
str_test[426] = ["欲除去氯气时，以下哪一种物质作为吸收剂最为有效？", "氯化钙", "稀硫酸", "硫代硫酸钠", "氢氧化铅"]
str_test[427] = ["不具有强酸性和强腐蚀性的物质是：", "氢氟酸", "碳酸", "稀硫酸", "稀硝酸"]
str_test[428] = ["对钠、钾等金属着火用什么扑灭？", "通常用干燥的细沙覆盖", "用水灭火", "CCl4灭火器", "CO2灭火器"]
str_test[429] = [
    "领取及存放化学药品时，以下说法错误的是",
    "确认容器上标示的中文名称是否为需要的实验用药品",
    "学习并清楚化学药品危害标示和图样",
    "化学药品应分类存放",
    "有机溶剂，固体化学药品，酸、碱化合物可以存放于同一药品柜中",
]
str_test[430] = ["甲苯在储存时，应远离火种、热源，防止阳光直射，其储存库温度应不超过多少度", "25", "30", "35", "40"]
str_test[431] = [
    "容器中的溶剂或易燃化学品发生燃烧应如何处理？",
    "用灭火器灭火或加砂子灭火",
    "加水灭火",
    "用不易燃的瓷砖、玻璃片盖住瓶口",
    "用湿抹布盖住瓶口",
]
str_test[432] = ["烘箱干燥玻璃仪器时，须将待烘干的仪器按（ ）顺序放置。", "从上层到下层", "从下层到上层", "从中间层到上下层", "随机"]
str_test[433] = ["反应烧瓶里添加的物料不要超过烧瓶容积的", "1/2", "2/3", "3/5", "1/3"]
str_test[434] = ["下列不属于硬质玻璃仪器的有", "圆底烧瓶", "量筒", "锥形瓶", "三口瓶"]
str_test[435] = ["以下试剂无需避光保存于低温阴凉处的是", "过氧化氢", "硝酸银", "汞", "氢溴酸"]
str_test[436] = ["过氧化氢中含有下列哪种物质时会加速其分解", "乙酰苯胺", "二氧化锰", "锡酸盐", "焦磷酸钠"]
str_test[437] = ["下列无机酸中，不属于一级腐蚀性酸的是", "发烟硝酸", "高氯酸", "盐酸", "发烟硫酸"]
str_test[438] = ["汞与下列哪些化合物作用会生成爆炸性化合物", "叠氮化物", "乙炔", "盐酸", "氨"]
str_test[439] = [
    "关于溴说法错误的是",
    "溴常温下为黑褐色液体，极易挥发",
    "溴对金属有强腐蚀性，遇氨、氢等气体能引起爆炸",
    "实验室保存溴时需置于无色试剂瓶，加水形成水封",
    "溴不得与有机物、还原剂、氧化剂等同库贮存",
]
str_test[440] = [
    "关于镁的存储说法错误的是",
    "应储存在阴凉、通风、干燥处",
    "库房照明和排风设备应使用防爆和封闭式电器",
    "可与其他金属粉末或卤族元素同库贮存",
    "需与氧化剂、酸类及相互反应的物品分开存放",
]
str_test[441] = ["下面哪些化学药品的存放期限不得超过一年，且在见光条件下若接触空气可形成过氧化物", "乙醇", "四氢呋喃", "乙酸乙酯", "苯酚"]
str_test[442] = ["有机物化学药品着火，应采用的措施是", "其它有机物灭火，避免碰撞", "高压水枪", "灭火器或沙子扑灭", "湿布盖灭"]
str_test[443] = [
    "有关化学试剂存放的说法中错误的是",
    "易潮解吸湿、易挥发、易挥发的化学试剂需密封储存。",
    "化学性质或灭火方法相抵触的化学试剂不得在同一柜中储存。",
    "为取用方便，实验室可多储存一些常用试剂。",
    "灭火器、沙桶等消防用品应设置在显眼顺手的地方。",
]
str_test[444] = ["危险化学品进入人体的途径有", "呼吸道吸入", "通过皮肤接触渗入", "通过消化道吞入", "都有可能"]
str_test[445] = [
    "化学实验中使用公用仪器或试剂时",
    "立即放回原处",
    "用后放在方便取用处",
    "试剂瓶中试剂不足时，应自己补充",
    "试剂瓶敞口放置，取用方便",
]
str_test[446] = ["下列物质不属于剧毒物的是", "碘甲烷、丙腈", "氯乙酸、丙烯醛", "五氯苯酚", "硫酸钡"]
str_test[447] = ["下列不属于危险化学品的是", "汽油、易燃液体", "放射性物品;", "氧化剂、有机过氧化物、剧毒药品和感染性物品", "氯化钾"]
str_test[448] = [
    "下列关于混合物的描述错误的是",
    "三氧化铬的硫酸溶液与有机物混合，可能爆炸",
    "硝酸氨与活性炭混合可能燃烧",
    "高氯酸与金属盐混合可能爆炸",
    "高氯酸与盐酸混合可能爆炸",
]
str_test[449] = ["下列何者是会发生爆炸的物质", "氧化锌", "三硝基甲苯", "四氯化碳", "氧化铁"]
str_test[450] = ["下列何种物质贮存于空气中易发生爆炸", "苯乙烯", "对二甲苯", "苯", "甲苯"]
str_test[451] = ["下列哪种物质与乙醇混溶时易发生爆炸", "盐酸", "乙醚", "高氯酸", "丙酮"]
str_test[452] = [
    "不是实验室常用于皮肤或普通实验器械的消毒液为",
    "0.2%-1%漂白粉",
    "70%乙醇",
    "2%碘酊",
    "0.2%-0.5%的洗必泰",
]
str_test[453] = [
    "闪点越低，越容易燃烧。闪点在一4℃以上的溶剂是",
    "甲醇、乙醇、乙腈",
    "乙酸乙酯、乙酸甲酯",
    "乙醚、石油醚",
    "汽油、丙酮、苯",
]
str_test[454] = [
    "混和或相互接触时，不会产生大量热量而着火、爆炸的是",
    "KMnO4和浓硫酸",
    "CC14和碱金属",
    "硝铵和酸",
    "浓 HNO4和胺类",
]
str_test[455] = [
    "混和或相互接触时，不会产生大量热量而着火、爆炸的是",
    "(亚、次）氯酸盐和酸",
    "CrO3和可燃物",
    "KMnO4和可燃物",
    "CC14和碱金属",
]
str_test[456] = [
    "活泼金属应存放在何处",
    "密封容器中并放入冰箱",
    "密封容器中并放入干燥器",
    "泡在煤油里密封避光保存",
    "密封容器中并放入密闭柜子内",
]
str_test[457] = ["氮氧化物主要伤害人体的", "眼、上呼吸道", "呼吸道深部的细支气管、肺泡", "皮肤", "消化道"]
str_test[458] = ["苯乙烯、乙酸乙烯酯应如何存放", "放在防爆冰箱里", "和其它试剂混放", "放在通风橱内", "放在密闭的柜子中"]
str_test[459] = ["不需要放在密封的干燥器内的药品是", "过硫酸盐", "五氧化二磷", "三氯化磷", "盐酸"]
str_test[460] = ["不需在棕色瓶中或用黑纸包裹，置于低温阴凉处的药品是", "卤化银", "浓硝酸", "过氧化氢", "汞"]
str_test[461] = ["以下哪种物质不会灼伤皮肤", "强碱、强酸", "强氧化剂", "溴", "KBr、NaBr水溶液"]
str_test[462] = [
    "危险化学品的急性毒性表述中，半致死量LD50代表什么意义",
    "致死量",
    "导致一半受试动物死亡的量",
    "导致一半受试动物死亡的浓度",
    "导致全部受试动物死亡的浓度",
]
str_test[463] = ["表示危险化学品的急性毒性的LD50的单位是什么", "mg/kg", "g/kg", "mL/kg", "ug/kg"]
str_test[464] = [
    "下列说法错误的是",
    "丙酮、乙醇都有较强的挥发性和易燃性，二者都不能在任何有明火的地方使用",
    "丙酮会对肝脏和大脑造成损害，因此避免吸入丙酮气体",
    "强酸强碱等不能与身体接触",
    "弱酸弱碱在使用中可以与身体接触",
]
str_test[465] = ["金属Hg具有高毒性，常温下挥发情况如何", "不挥发", "慢慢挥发", "很快挥发", "需要在一定条件下才会挥发"]
str_test[466] = [
    "领取及存放化学药品时，以下说法错误的是",
    "确认容器上标示的中文名称是否为需要的实验用药品",
    "学习并清楚化学药品危害标示和图样",
    "化学药品应分类存放",
    "有机溶剂，固体化学药品，酸、碱化合物可以存放于同一药品柜中",
]
str_test[467] = [
    "氯气急性中毒可引起严重并发症，如气胸、纵隔气肿等，不会引起什么症状",
    "中、重度昏迷",
    "支气管哮喘",
    "慢性支气管炎",
    "严重窒息",
]
str_test[468] = ["钠，钾等碱金属须贮存于", "水中", "酒精中", "煤油中", "暴露在空气中"]
str_test[469] = [
    "以下药品按毒性从大到小排序正确的是",
    "甲醛、苯、苯乙烯、丙酮",
    "苯、甲醛、甲苯、丙酮",
    "甲苯、甲醛、苯、丙酮",
    "苯、丙酮、甲苯、甲醛",
]
str_test[470] = ["当油脂等有机物沾污氧气钢瓶时，应立即用什么洗净", "乙醇", "四氯化碳", "水", "汽油"]
str_test[471] = [
    "丙酮属于低毒类化学品，下列叙述正确的是",
    "它的闪点只有-18℃,具有高度易燃性",
    "对神经系统有麻醉作用，并对黏膜有刺激作用。",
    "它的沸点只有56℃，极易挥发;",
    "以上都对",
]
str_test[472] = ["以下液体中，投入金属钠最可能发火燃烧的是", "无水乙醇", "苯", "水", "汽油"]
str_test[473] = ["以下药品中，可以与水直接接触的是", "金属钠", "金属氢化物", "电石", "白磷"]
str_test[474] = ["下面哪组溶剂不属易燃类液体", "甲醇、乙醇", "四氯化碳、乙酸", "乙酸丁酯", "丙酮、甲苯"]
str_test[475] = ["下面所列试剂不用分开保存的是", "乙醚与高氯酸", "苯与过氧化氢", "丙酮与硝基化合物", "浓硫酸与盐酸"]
str_test[476] = ["以下几种气体中，无毒的气体为", "氧气", "一氧化碳", "硫化氢", "氰化氢"]
str_test[477] = ["列试剂哪个不用放在棕色瓶内保藏", "硫酸亚铁", "高锰酸钾", "亚硫酸钠", "硫酸钠"]
str_test[478] = ["下列物质无毒的是", "乙二醇", "硫化氢", "乙醇", "甲醛"]
str_test[479] = ["下列物质应避免与水接触以免发生危险的是", "氯化钠", "氯化钙", "四氢化铝", "硫酸钙"]
str_test[480] = [
    "实验中吸入Cl2或HCl气体时，应如何处理？",
    "人工呼吸",
    "立即到室外呼吸新鲜空气",
    "吸入少量酒精和乙醚的混合蒸气使之解毒",
    "不用管，过一会就好了",
]
str_test[481] = ["以下几种气体中，最毒的气体为：", "氯气", "光气", "二氧化硫", "三氧化硫"]
str_test[482] = ["剧毒物品必须保管、储存在什么地方？", "铁皮柜", "木柜子", "带双锁的铁皮保险柜", "带双锁的木柜子"]
str_test[483] = [
    "涉及有毒试剂的操作时，应采取的保护措施包括：",
    "佩戴适当的个人防护器具",
    "了解试剂毒性，在通风橱中操作",
    "做好应急救援预案",
    "以上都是",
]
str_test[484] = [
    "危险化学品的毒害包括：",
    "皮肤腐蚀性/刺激性，眼损伤/眼刺激",
    "急性中毒致死，器官或呼吸系统损伤，生殖细胞突变性，致癌性",
    "水环境危害性, 放射性危害",
    "以上都是",
]
str_test[485] = [
    "室温较高时，有些试剂如氨水等，打开瓶塞的瞬间很易冲出气液流，应先如何处理，再打开瓶塞？",
    "先将试剂瓶在热水中浸泡一段时间",
    "振荡一段时间",
    "先将试剂瓶在冷水中浸泡一段时间",
    "先将试剂瓶颠倒一下",
]
str_test[486] = ["氯气是一种（ ），有强烈的刺激气味", "黄绿色的剧毒气体", "红色的气体", "绿色的气体", "棕色的气体"]
str_test[487] = ["镁粉发生火灾时，应使用（ ）灭火", "水", "特殊干粉", "二氧化碳", "盐酸"]
str_test[488] = ["硫磺在燃烧时产生（ ）和刺激性气体，扑救时必须注意戴好防毒面具", "有毒", "剧毒", "无色无味", "碱性"]
str_test[489] = ["氢氟酸的主要危险在于其：", "毒性", "燃烧爆炸危险", "放射性", "腐蚀性"]
str_test[490] = [
    "浓硫酸溶于水时，能释放出大量热量。因此，稀释浓硫酸时必须十分小心，应该",
    "把水缓缓加入浓硫酸中",
    "把浓硫酸缓缓加入水中",
    "把浓硫酸迅速倒入水中",
    "把浓硫酸缓缓倒入水中",
]
str_test[491] = ["下列物质无毒的是：", "乙二醇", "硫化氢", "乙醇", "甲醛"]
str_test[492] = [
    "如果在试验过程中，闻到烧焦的气味应如何办？",
    "关机走人",
    "打开通风装置通风",
    "立即关机并报告相关负责人员",
    "请同实验的人帮忙检查",
]
str_test[493] = [
    "实验室内使用乙炔气时，说法正确的是：",
    "室内不可有明火，不可有产生电火花的电器",
    "房间应密闭",
    "室内应有高湿度",
    "乙炔气可用铜管道输送",
]
str_test[494] = ["以下物质中，哪些应该在通风橱内操作? ", "氢气", "氮气", "氦气", "氯化氢"]
str_test[495] = ["二氧化碳钢瓶瓶身颜色是什么？", "黄色", "天蓝色", "黑色", "铝白色"]
str_test[496] = [
    "为了防止在开启或关闭玻璃容器时发生危险，下列哪一种瓶塞不适宜作为盛放具有爆炸危险性物质的玻璃容器的瓶塞？",
    "软木塞",
    "磨口玻璃塞",
    "胶皮塞",
    "橡胶塞",
]
str_test[497] = [
    "遇水发生剧烈反应,容易产生爆炸或燃烧的化学品是",
    "K、Na、Mg、Ca、Li、AlH3、电石",
    "K、Na、Ca、Li、AlH3、MgO、电石",
    "K、Na、Ca、Li、AlH3、电石",
    "K、Na、Mg、Li、AlH3、电石",
]
str_test[498] = [
    "实验室内的汞蒸气会造成人员慢性中毒，为了减少汞液面的蒸发，可在汞液面上覆盖什么液体，效果最好？",
    "水",
    "甘油",
    "5%Na2SO4",
    "盐酸",
]
str_test[499] = [
    "混和或相互接触时，不会产生大量热量而着火、爆炸的是",
    "KMnO4和浓硫酸",
    "CCl4和碱金属",
    "硝铵和酸",
    "浓HNO4和胺类",
]

answer[400:500:1] = [
    3,
    1,
    1,
    4,
    1,
    2,
    2,
    3,
    1,
    1,
    1,
    2,
    4,
    1,
    2,
    1,
    2,
    2,
    3,
    4,
    2,
    1,
    2,
    2,
    2,
    4,
    3,
    2,
    1,
    4,
    2,
    1,
    1,
    2,
    2,
    3,
    2,
    3,
    2,
    3,
    3,
    2,
    3,
    3,
    4,
    1,
    4,
    4,
    4,
    2,
    1,
    3,
    1,
    1,
    2,
    4,
    3,
    2,
    1,
    4,
    3,
    4,
    2,
    1,
    4,
    2,
    4,
    3,
    3,
    2,
    2,
    4,
    3,
    4,
    2,
    4,
    1,
    4,
    3,
    3,
    2,
    2,
    3,
    4,
    4,
    3,
    1,
    2,
    1,
    4,
    2,
    3,
    3,
    1,
    4,
    4,
    2,
    3,
    2,
    2,
]


# 以下题目由杨思维提供
str_test[500] = ["实验开始前不需要做的工作是什么:", "完成预习报告", "检查仪器设备", "记录实验条件", "进行数据处理"]
str_test[501] = ["实验中如何读取数据:", "直接读取一次数据", "直接读取两次数据", "待示数稳定后读取两次数据", "直接读取三次数据"]
str_test[502] = ["实验数据应保留几位小数:", "3位", "2位", "最小分度的那一位", "最小分度的下一位"]
str_test[503] = [
    "实验结果不正常时下面那个操作是不正确的:",
    "自己修改数据",
    "再次进行相同实验验证",
    "向老师同学询问问题",
    "询问老师后再备注栏备注",
]
str_test[504] = ["进行雷诺实验时下列那种情况不能开始实验:", "实验用水清洁", "实验墨水与水的密度不想当", "装置放置平稳", "高位槽稳定"]
str_test[505] = ["开启离心泵前为什么需进行灌泵:", "防止气蚀", "防止气缚", "防止水倒吸", "防止离心泵烧坏"]
str_test[506] = [
    "实验开始时打开一起总开关后需要做什么:",
    "等待5分钟后进行实验",
    "立即开始实验",
    "等待仪器自检完成后进行实验",
    "等待10分钟后进行实验",
]
str_test[507] = ["出口阀关闭情况下泵的最长运行时间是多少:", "1分钟", "3分钟", "5分钟", "10分钟"]
str_test[508] = ["传热实验中热稳定时间需几分钟以上以保证数据的可靠性:", "1分钟", "3分钟", "5分钟", "10分钟"]
str_test[509] = ["常量分析天平的极值误差为多少:", "0.1mg", "0.2mg", "0.3mg", "0.4mg"]
str_test[510] = ["常量分析天平的称量量最少为多少:", "200mg", "300mg", "500mg", "800mg"]
str_test[511] = ["干燥过程不包括哪个阶段:", "预热段", "加热段", "恒速干燥阶段", "减速干燥阶段"]
str_test[512] = [
    "干燥实验中结束实验时如何操作:",
    "先关加热电源后立即关闭风机",
    "先关闭风机后立即关闭加热电源",
    "先关闭加热电源等冷却后关闭风机",
    "先关闭风机数分钟后关闭加热电源",
]
str_test[513] = ["干燥实验开始时应如何操作:", "先开启风机后开启加热电源", "先开启加热电源后开启风机", "只开加热电源", "只开启风机"]
str_test[514] = ["实验室应在什么情况下才能开启气瓶阀:", "老师监督下自己动手开启", "由老师开启", "自己开启", "叫同学帮忙开启"]
str_test[515] = ["实验室中酒精灯如何熄灭:", "盖上酒精灯盖隔绝氧气", "使用抹布覆盖", "等待酒精燃烧完自动熄灭", "使用嘴吹灭"]
str_test[516] = [
    "实验室中使用酒精灯撒出来着火了怎么办:",
    "立马离开实验室",
    "使用水浇灭",
    "使用湿抹布盖住隔绝空气",
    "等待酒精消耗完自动熄灭",
]
str_test[517] = ["进入实验室时不需要准备什么防护装备:", "护目镜", "实验服", "手套", "头盔"]
str_test[518] = ["下面那种行为是实验室不允许的:", "佩戴眼镜", "穿着拖鞋", "扎起头发", "佩戴护目镜"]
str_test[519] = ["下面那些行为是实验室允许的:", "喝水", "吃饭", "玩手机", "穿运动鞋"]
str_test[520] = ["如何处理实验废水:", "倒进废液桶", "放着不管", "直接倒进下水道", "喝掉"]
str_test[521] = ["实验室中实验完成后如何处理电器:", "断开电源放回原位", "断开电源", "放回原位", "放着不管"]
str_test[522] = ["实验过程中出现不正常现象时如何做:", "当做没看见", "记录现象并请教老师", "只记录现象", "自己重做实验"]
str_test[523] = ["实验室出现大型火灾时怎么做:", "尝试使用灭火器灭火", "当做不知情", "马上撤离并报火警", "尝试使用自来水灭火"]
str_test[524] = ["实验过程中操作失误怎么办:", "向老师报告并询问意见", "当做不知情", "自己重做实验", "自己使用化学品补救"]
str_test[525] = ["实验室如何取用危险化学品:", "在老师监督下取用", "自己动手取用", "请老师取用", "请同学取用"]
str_test[526] = [
    "分析天平如何称量药品:",
    "所有药品都放称量纸上称量",
    "直接放在天平上称量",
    "用不用称量纸都可以",
    "不同的药品在对应的载体上测量",
]
str_test[527] = ["滴定时眼睛应看向哪里:", "左手", "右手", "锥形瓶", "滴定管"]
str_test[528] = ["滴定时不需要哪个仪器:", "洗耳球", "滴定管", "铁架台", "锥形瓶"]
str_test[529] = ["滴定结束仰视读数会对被滴定物质造成什么影响:", "浓度偏大", "浓度偏小", "没有影响", "不能确定"]
str_test[530] = ["滴定结束俯视读数会对被滴定物质造成什么影响:", "浓度偏大", "浓度偏小", "没有影响", "不能确定"]
str_test[531] = ["滴定前俯视读数会对被滴定物质造成什么影响:", "浓度偏大", "浓度偏小", "没有影响", "不能确定"]
str_test[532] = ["滴定前仰视读数会对被滴定物质造成什么影响:", "浓度偏大", "浓度偏小", "没有影响", "不能确定"]
str_test[533] = [
    "如何确定滴定终点:",
    "直接滴定过量至变色后不再变回",
    "滴定至溶液快要变色时停止",
    "溶液变色后立即停止",
    "溶液变色后半分钟不变回时停止",
]
str_test[534] = ["分析天平称量药品不包括哪种方法:", "增量法", "减量法", "倾倒法", "直接法"]
str_test[535] = ["使用分析天平时是否需要调零:", "需要", "不需要", "有无都可以", "不清楚"]
str_test[536] = ["多人实验时实验台需要有多少人在:", "不需要", "一个人", "最少一个人", "最多一个人"]
str_test[537] = ["使用减量法称量药品时多出来的药品怎么办:", "倒回原药品瓶中", "直接丢弃", "放置在天平上", "倒进废液桶中"]
str_test[538] = ["使用增量法多称量了药品怎么办:", "用药勺去掉多出来部分", "当做没看见", "重新称量", "询问老师"]
str_test[539] = ["滴定时过量滴定了怎么办:", "当做没看见继续实验", "重新配置药品滴定", "倒掉后伪造数据", "加入部分被滴定溶液后重新滴定"]
str_test[540] = ["如何处理实验后的产品:", "倒入下水道", "倒入废液桶", "直接丢弃", "倒入产品收集瓶"]
str_test[541] = ["滴定时锥形瓶需不需要润洗:", "需要", "不需要", "有无都可以", "不清楚"]
str_test[542] = ["滴定时滴定管需不需要润洗:", "需要", "不需要", "有无都可以", "不清楚"]
str_test[543] = ["进行蒸馏时温度计放置在什么位置:", "支管口下端", "被蒸馏溶液中", "随便一个位置", "馏出液中"]
str_test[544] = ["进行蒸馏实验时冷凝水如何流:", "上进下出", "下进上出", "上进上出", "下进下出"]
str_test[545] = ["进行蒸馏实验时冷凝管是否需要需要夹住固定:", "不需要", "需要", "有无都可以", "不清楚"]
str_test[546] = ["实验时安装装置顺序是什么:", "从下到上", "从上到下", "从右到左", "随便安装"]
str_test[547] = ["蒸馏实验时什么馏出液速度比较合理:", "每秒两滴", "每分钟两滴", "每秒十滴", "每分钟十滴"]
str_test[548] = ["接收馏出液时圆底烧瓶如何放置:", "直接悬空", "放置到实验台上", "使用架子夹住固定", "用手扶着"]
str_test[549] = ["蒸馏时设置温度为多少:", "一百摄氏度", "两百摄氏度", "三百摄氏度", "根据药品的不同而定"]
str_test[550] = ["进入实验室需要戴手套吗:", "需要", "不需要", "有无都可以", "不清楚"]
str_test[551] = ["药品溅到皮肤上时应该怎么做:", "用纸巾擦掉", "用水冲洗", "向老师求助", "当做没事发生"]
str_test[552] = ["进入实验室为什么需要穿实验服:", "美观", "保护皮肤", "容易清洗", "别人穿我也穿"]
str_test[553] = ["实验中进行定量计算时需要使用什么仪器取用药品:", "烧杯", "量筒", "移液管", "锥形瓶"]
str_test[554] = ["如何取用一般的药品:", "自己动手取用", "请老师帮忙取用", "请同学帮忙取用", "在老师的监督下取用"]
str_test[555] = ["在使用布氏漏斗时里面应该垫什么:", "纸巾", "不需要垫东西", "滤纸", "产品"]
str_test[556] = ["抽滤时使用什么漏斗:", "分液漏斗", "普通漏斗", "布氏漏斗", "常压漏斗"]
str_test[557] = ["趁热抽滤时布氏漏斗需不需要预热:", "需要", "不需要", "有无都可以", "不清楚"]
str_test[558] = ["趁热抽滤时布氏漏斗怎么预热:", "直接加热", "水浴加热", "使用热水传递热量加热", "用手焐热"]
str_test[559] = ["实验中常用的干燥器不包括那个:", "无水硫酸镁", "无水氯化钙", "无水硫酸钠", "无水氯化铝"]
str_test[560] = ["如何确定干燥剂的用量:", "少量即可", "少量多次反复试验", "过量", "不清楚"]
str_test[561] = ["称量下面哪种物质不能使用称量纸:", "氢氧化钠", "氢氧化铝", "氯化铝", "氯化钠"]
str_test[562] = ["下面那种物质需要放在棕色瓶中:", "碘液", "氢氧化钠溶液", "乙酸乙酯", "乙醇溶液"]
str_test[563] = ["下面那个组合不会分层:", "四氯化碳和水", "乙醚和水", "丙酮和水", "乙醚和丙酮"]
str_test[564] = ["下面那种物质在和水分液时处于下层:", "乙醚", "丙酮", "四氯化碳", "乙酸乙酯"]
str_test[565] = ["下面那种物质不能装在酸式滴定管中:", "氢氟酸", "高锰酸钾", "盐酸", "高氯酸"]
str_test[566] = ["使用分液漏斗进行萃取或洗涤时为什么需要时不时放气:", "防止气压过大或过小", "别人放气我也放", "老师说的", "去掉有害气体"]
str_test[567] = [
    "使用电位器测量溶液点电动势时需要怎么洗涤电位计:",
    "每次测量完使用清水习洗涤",
    "每次使用完用清水洗涤后使用待测液润洗",
    "直接使用待测液体润洗",
    "不用洗涤",
]
str_test[568] = ["酸碱滴定终点变色的是什么物质:", "酸性物质", "碱性物质", "水", "酸碱指示剂"]
str_test[569] = ["取用完药品后需不需要将瓶盖盖上:", "需要", "不需要", "有无都可以", "不清楚"]
str_test[570] = ["实验室中的无害物质能否直接品尝:", "可以", "不可以", "看具体物质情况而定", "不清楚"]
str_test[571] = ["能否将饮料或食物带到实验室中品尝:", "可以", "不可以", "询问老师可不可以", "不清楚"]
str_test[572] = ["在使用完药品后哪种行为是错误的:", "盖回瓶盖", "放回原位", "放着不管", "用完及时向老师报告"]
str_test[573] = ["在使用完仪器是否需要清洗:", "需要", "不需要", "视情况而定", "不清楚"]
str_test[574] = ["在使用磁力搅拌器时一般需要放入多少磁子:", "1个", "2个", "3个", "5个"]
str_test[575] = ["在开启高压气瓶时气体应经过什么操作:", "过滤", "干燥", "加压", "减压"]
str_test[576] = ["金属钠着火时可以使用什么东西灭火:", "砂子", "水", "乙醇", "湿布"]
str_test[577] = ["强碱触及皮肤引起灼伤时应怎么做:", "当做没事发生", "使用抹布擦除", "使用大量水冲洗后涂上低浓度乙酸溶液", "使用水冲洗"]
str_test[578] = ["洗净的仪器能否使用抹布擦干:", "可以", "不可以", "不清楚", "询问老师"]
str_test[579] = ["低浓度无害废液可否直接倒进下水道:", "可以", "不可以", "看情况而定", "不清楚"]
str_test[580] = ["在使用电气设备时是否需要保持手干燥:", "需要", "不需要", "看情况而定", "不清楚"]
str_test[581] = ["有机废液桶中废液到达多少时便不能再倒进废液:", "1/2", "3/4", "3/5", "4/5"]
str_test[582] = ["除有机废液外的其他废液到达多少时不能再倒进废液:", "1/2", "3/4", "3/5", "4/5"]
str_test[583] = ["实验室接水水流较慢的情况下能否离开:", "能", "不能", "询问老师", "不清楚"]
str_test[584] = ["胶头滴管一滴大概为多少毫升:", "0.5", "0.05", "0.005", "0.25"]
str_test[585] = ["滴定管一滴为多少毫升:", "4", "0.4", "0.04", "0.004"]
str_test[586] = ["使用完仪器时是否需要立即清洗仪器:", "需要", "不需要", "视情况而定", "不清楚"]
str_test[587] = ["实验室中使用完的磁子能否重复利用:", "可以", "不可以", "不清楚", "询问老师"]
str_test[588] = ["实验中使用完磁子后是否需要清洗:", "需要", "不需要", "视情况而定", "不清楚"]
str_test[589] = ["实验室中能否直接闻或品尝无害药品:", "可以", "不可以", "视情况而定", "不清楚"]
str_test[590] = ["使用药品对产品进行干燥时如何判断干燥完成:", "药品溶解完", "产品消失", "产品澄清", "产品浑浊"]
str_test[591] = ["在洗涤试管的时候最多可以几个试管一起刷:", "1个", "2个", "3个", "5个"]
str_test[592] = ["称量固体试剂时取多的样品能否放回原瓶:", "可以", "不可以", "视情况而定", "不清楚"]
str_test[593] = ["下面那个物品是进入实验室时不需要的:", "实验报告", "实验服", "护目镜", "手机"]
str_test[594] = ["使用移液管取用液体时是用右手还是左手拿移液管:", "左手", "右手", "都可以", "不清楚"]
str_test[595] = ["稀释完溶液后能否使用移液管对液体进行搅拌:", "可以", "不可以", "视情况而定", "不清楚"]
str_test[596] = ["取用试剂时是否一定需要在通风橱下进行:", "需要", "不需要", "视情况而定", "不清楚"]
str_test[597] = ["下面那个仪器不能当做容器乘放试剂:", "锥形瓶", "烧杯", "量筒", "烧瓶"]
str_test[598] = ["实验中出现意料之外的情况时哪种方式时错误的:", "继续实验", "询问同学", "请教老师", "查找资料"]
str_test[599] = ["实验时由于时间限制无法完成实验应该怎么做:", "伪造数据", "向同学索要数据", "草草结束实验", "向老师反映并争取下次补做实验"]

answer[500:600:1] = [
    4,
    3,
    4,
    1,
    2,
    2,
    3,
    2,
    3,
    2,
    1,
    2,
    3,
    1,
    1,
    1,
    3,
    4,
    2,
    4,
    1,
    1,
    2,
    3,
    1,
    1,
    4,
    3,
    1,
    1,
    2,
    1,
    2,
    4,
    3,
    1,
    3,
    1,
    3,
    2,
    4,
    2,
    1,
    1,
    2,
    2,
    1,
    1,
    3,
    4,
    1,
    3,
    2,
    3,
    1,
    3,
    3,
    1,
    3,
    4,
    2,
    1,
    1,
    4,
    3,
    1,
    1,
    2,
    4,
    1,
    2,
    2,
    3,
    3,
    1,
    4,
    1,
    3,
    2,
    1,
    1,
    2,
    4,
    2,
    2,
    3,
    3,
    1,
    1,
    2,
    3,
    1,
    2,
    4,
    1,
    2,
    3,
    3,
    1,
    4,
]

# 600-700:1题目
str_test[600] = [
    "取用试剂时，正确的做法为",
    "取出瓶塞后，瓶塞可以随意放置",
    "取用完毕时，可以先不盖上瓶塞，方便下次取用",
    "瓶塞要放在洁净处，取用完毕后立即盖好密封",
    "取用时，先闻一闻确认试剂无误",
]
str_test[601] = ["实验剩余药品的处置，正确做法为", "放回原瓶", "随意丢弃", "拿出实验室", "放回指定的容器内"]
str_test[602] = [
    "灯火加热时，哪种做法是错误的",
    "酒精灯熄灭时，用口吹灭",
    "酒精灯中的酒精不得超过容量的2/3",
    "灯内酒精不足1/4时，应灭火后添加酒精",
    "在酒精灯快烧尽，灯火还没熄灭时，千万不能注入燃料",
]
str_test[603] = [
    "实验室中用电安全至关重要，下列说法错误的是",
    "注意保持电线和电器设备的干燥，防止线路和设备受潮漏电",
    "如遇电线走火，应切断电源，用泡沫灭火器灭火",
    "实验室内不应有裸露的电线头；电源开关箱内，不准堆放物品",
    "不得擅自更动或随意拆修电器设备",
]
str_test[604] = [
    "关于实验室中的易燃气体安全，下列说法错误的是",
    "在使用易燃气或保存有易燃气管道、器具的实验室，应开窗保持通风",
    "在易燃气器具附近，严禁放置易燃易爆物品",
    "当发现实验室里有可燃气泄漏时，应立即停止使用",
    "检查易燃气泄漏处时，先用火试漏",
]
str_test[605] = [
    "关于实验室有毒物品及化学药剂使用要求，下列说法错误的是",
    "一切有毒物品及化学药剂，要严格按类存放保管、发放、使用",
    "在实验中尽量采用无毒物质或少毒物质来代替有毒物质",
    "在觉得无毒的环境下工作时，可以不穿戴防护衣物",
    "工作时间内，须经仔细洗手、漱口后，才能在指定的房间饮水、用餐",
]
str_test[606] = [
    "对来自体外辐射的防护,下列说法错误的是",
    "隔离屏障对辐射防护无作用，不用设置隔离屏障",
    "选择放射性同位素时，应在满足实验要求的情况下，尽量选取危险性小的用",
    "不要在有放射性物质的附近做不必要的停留，尽量减少被辐射的时间",
    "在操作时，可利用各种夹具，增大接触距离，减少被辐射量",
]
str_test[607] = [
    "对于放射性物质进入体内的预防，下列说法错误的是",
    "工作时必须戴防护手套、口罩，实验中绝对禁止用口吸取溶液或口腔接触任何物品",
    "操作有关放射性物质的实验不用戴手套",
    "不要用有机溶液洗手和涂敷皮肤，以防增加放射性物质进入皮肤的渗透性能",
    "遇有污染物应慎重妥善处理",
]
str_test[608] = [
    "对于爆炸性物质的使用，下列说法错误的是",
    "实验时，切忌以脸面正对危险体，必要时应戴上防爆面具",
    "在有爆炸性物质的实验中，不要用带磨口塞的磨口仪器",
    "干燥爆炸性物质时，关闭烘箱门",
    "严格分类保管好爆炸性物质，实验剩余的残渣余物要及时妥善销毁",
]
str_test[609] = [
    "关于气体钢瓶的使用，下列说法错误的是",
    "在搬动存放气瓶时，应装上防震垫圈，旋紧安全帽",
    "高压气瓶必须分类分处保管",
    "气瓶要远离热源，避免曝晒和强烈振动",
    "一般实验室内存放气瓶量没有要求",
]
str_test[610] = [
    "关于化学废物的处理，下列说法错误的是",
    "严禁往下水口、垃圾道倾倒有机溶剂及有毒、有害废物",
    "可以将废弃液体和固体混合在一起",
    "收集容器上应清楚标注废弃物的主要成分",
    "药品使用后之废（液）弃物应倒入专用收集容器中回收",
]
str_test[611] = [
    "关于实验室的安全用电，下列说法错误的是",
    "使用动力电时，应先检查电源开关、电机和设备各部分是否良好",
    "启动或关闭电器设备时，必须将开关扣严或拉妥，防止似接非接状况",
    "注意保持电线和电器设备的干燥，防止线路和设备受潮漏电",
    "电源开关箱内，可以堆放物品",
]
str_test[612] = [
    "关于实验室防火，下列说法错误的是",
    "在实验室内、过道等处，须经常备有适宜的灭火材料",
    "电线及电器设备起火时，立即用泡沫灭火器灭火",
    "人员衣服着火时，立即用毯子之类物品蒙盖在着火者身上灭火，必要时也可用水扑灭",
    "易燃液体的固体着火时，不可用水去浇",
]
str_test[613] = [
    "如果在实验中烧伤，下列做法错误的是",
    "普通轻度烧伤，可擦用清凉乳剂于创伤处，并包扎好",
    "眼睛受到任何伤害时，应立即请眼科医生诊断化学烧伤时，应迅速解脱衣服，首先清除残存在皮肤上的化学药品，用水多次冲洗，同时视烧伤情况立即送医院救治",
    "普通轻度烧伤，可以不用理会",
    "略重的烧伤可视烧伤情况立即送医院处理",
]
str_test[614] = [
    "关于中毒的急救处置，下列说法错误的是",
    "发现有人中毒时，先在中毒者位置查看中毒物质",
    "发现有人中毒时，尽快将患者从中毒物质区域中移出",
    "尽量弄清致毒物质，以便协助医生排除中毒者体内毒物",
    "如遇中毒者呼吸停止，心脏停跳时，应立即施行人工呼吸、心脏按摩，直至医生到达或送到医院为止",
]
str_test[615] = [
    "关于实验室的着装要求，下列说法错误的是",
    "进行实验可以穿戴平常的衣服",
    "应将长发及松散衣服妥善固定",
    "进行危害物质、挥发性有机溶剂等化学药品操作实验或研究，必须要穿戴防护工具",
    "不得穿高跟鞋、拖鞋进入实验室",
]
str_test[616] = [
    "关于实验室用水，下列说法错误的是",
    "节约用水，按需求量取水",
    "洗刷玻璃器皿应先使用自来水，最后用纯水冲洗",
    "超纯水和纯水可以存储，待需要时取用",
    "用毕关好水龙",
]
str_test[617] = [
    "实验室使用液氮时，做法错误的是",
    "戴上绝缘防护手套",
    "可以穿上短袖实验服使用液氮",
    "保持环境空气流畅",
    "穿上过脚踝不露脚面的鞋",
]
str_test[618] = [
    "使用化学药品，错误的做法是",
    "严格遵照操作规程和使用方法进行使用",
    "了解化学药品的使用、保存、安全处理和废弃的程序",
    "佩戴合适的个人保护器具",
    "使用前，不需要充分了解化学品的物理和化学特性",
]
str_test[619] = [
    "关于易燃有机溶剂的使用，下列说法错误的是",
    "将易燃液体的容器置于较高的试剂架上",
    "保持容器密闭，需要倾倒液体时，方可打开密闭容器的盖子",
    "加热易燃液体时，最好使用油浴或水浴，不得用明火加热",
    "应在没有火源并且通风良好地方使用易燃有机溶剂",
]
str_test[620] = [
    "有机溶剂的毒性表现在溶剂与人体接触或被人体吸收时引起局部麻醉刺激，或整个机体功能发生障碍，在与有毒有机溶剂有关的实验中，下列做法错误的是：",
    "尽量不要将皮肤与有机溶剂直接接触",
    "穿短袖实验服进行实验",
    "注意保持实验场所通风",
    "在使用过程中如果有毒有机溶剂溢出，应根据溢出的量，移开所有火源",
]
str_test[621] = [
    "关于化学药品的储存，下列做法错误的是：",
    "所有化学药品的容器贴上清晰永久标签，标明内容及其潜在危险",
    "在通风橱内储存化学药品",
    "化学药品应储存在合适的高度",
    "装有腐蚀性液体容器的储存位置应当尽可能低，并加垫收集盘",
]
str_test[622] = ["接触危险化学品时，错误的穿着为：", "戴防护镜", "穿工作服", "穿露脚趾的鞋", "长发束起"]
str_test[623] = [
    "关于电子天平的使用方法，下列做法错误的是：",
    "电子天平使用前先预热10分钟",
    "称量物的温度与天平温度相同",
    "一些具有挥发性的腐蚀性的试剂放在密闭容器中称量",
    "称量物体时开着天平的侧门",
]
str_test[624] = [
    "电热恒温干燥箱是化学实验中用于对物品进行烘焙、干燥的常规仪器，选出下列中正确的使用方法：",
    "干燥箱使用过程中，用湿手触摸箱体和开关",
    "将可燃性和挥发性的化学物品放入箱内",
    "干燥箱如在使用过程中出现异常、气味、烟雾等情况，立即关闭电源",
    "箱内载物摆放在边缘部位进行干燥",
]
str_test[625] = [
    "在使用恒温水浴锅时，正确的做法为：",
    "加水之前接通电源",
    "锅内水量可低于二分之一",
    "注水时将水流入控制箱内",
    "不能无水或水位低于隔板加热",
]
str_test[626] = [
    "使用显微镜、分光光度计等光学仪器时，正确的做法为：",
    "机械装置如有污渍，用酒精、乙醚等化学晶擦拭",
    "关机时把光量调制最大关机",
    "仪器存放于干燥、无灰尘、无油污和无有害、易燃、易爆等气体的地方",
    "发现镜头发霉长雾时，用擦镜纸蘸大量无水酒精擦拭",
]
str_test[627] = [
    "使用离心机首重安全，离心力失控可能造成很大的破坏。下列做法正确的是：",
    "离心机套管底部要垫棉花或试管垫",
    "使用伪劣的离心使管",
    "用老化、变形、有裂纹的离心管",
    "分离结束后，在离心机未停止转动时打开离心机盖",
]
str_test[628] = [
    "实验室中的冰箱暂时均无防爆装置，不适用存放易燃、易爆、挥发性溶剂。下列做法正确的是：",
    "一次性放入的物品或其它制品超过箱内容积的三分之一",
    "存放易燃易爆等危险化学品",
    "一次性放入过热的物品",
    "使用时佩戴防冻伤手套",
]
str_test[629] = [
    "下列关于外用消毒药品，描述错误的是：",
    "高浓度硼酸无刺激作用",
    "双氧水可消毒杀菌，但浓度大，易灼伤患处皮肤",
    "碘酒主要用于非黏膜伤口的表面消毒",
    "医用消毒的酒精浓度为70%～75%",
]
str_test[630] = [
    "对于伤口的处理，下列做法错误的是：",
    "轻度的烫伤或烧伤，可用药棉棍浸90-95％的酒精轻涂伤处",
    "干石灰或浓硫酸灼伤时，先用水冲洗",
    "发现化学灼伤后，要立即脱去被污染的衣物、鞋袜，随后用大量清水冲洗创面15-20分钟",
    "较严重的烫伤或烧伤，不能弄破水泡，以防感染",
]
str_test[631] = [
    "对于三氯甲烷的化学性质，下列描述错误的是：",
    "是一种致癌剂",
    "对皮肤、眼睛、黏膜和呼吸道有刺激作用",
    "操作时戴合适的手套和安全眼镜并始终在化学通风橱里进行",
    "不易挥发",
]
str_test[632] = ["下列哪种化学药品是无毒的：", "氯化钠", "二甲基亚砜", "三氯甲烷", "甲醛"]
str_test[633] = [
    "在实验室必须注意防火，以免引起火灾，下列做法错误的是：",
    "乙醚、酒精、丙酮、二硫化碳、苯等有机溶剂易燃，实验室不得存放过多",
    "将金属钠存放在水中",
    "万一着火，根据不同情况，选用水、沙、泡沫、CO2 或 CCl4 灭火器灭火",
    "有机溶剂不可倒入下水道",
]
str_test[634] = [
    "实验室用到的石油醚、汽油等是最易燃液体，这些物质与一些强氧化剂接触，遇有摩擦、碰撞等就能爆炸，下列物品与之接触不会爆炸的是：",
    "氯化钠",
    "硝酸盐",
    "高锰酸钾",
    "氯酸钾",
]
str_test[635] = ["下列哪种化学药品不属于危险品", "易爆和不稳定物质", "有毒物质", "水", "腐蚀性物质"]
str_test[636] = ["处理下列哪种化学药品时，必须在通风橱进行？", "氢氧化钠溶液", "浓盐酸", "氯化钠溶液", "乙醇"]
str_test[637] = [
    "关于储存化学试剂的方式，下列说法错误的是：",
    "易燃易爆性化学试剂必须存放在不燃烧材料制作的柜、架上",
    "氧化性试剂不得与其它性质抵触的试剂共同储存",
    "酸类试剂应与碱类试剂混放",
    "剧毒性试剂应远离明火",
]
str_test[638] = [
    "关于实验室冰箱的使用，下列说法错误的是：",
    "不可将汽油、酒精、胶粘剂等易燃、易爆品放入冰箱内",
    "如发现可燃气体泄漏，立即拔去电源插头",
    "不可用水喷洒冰箱顶部",
    "冰箱应放置在平坦、坚实的地面上",
]
str_test[639] = [
    "对于离心机的操作，下列说法错误的是：",
    "将物品和离心管一起两两进行平衡，并对称放入离心机中",
    "使用离心机时，应将离心机放在平整台面上",
    "不能在盖门放置任何物品，以免出现凹凸不平",
    "离心完毕后，不用等待离心机停止即可取出物品",
]
str_test[640] = [
    "DMSO是二甲基亚砜，是毒性比较强的东西。下列有关说法错误的是：",
    "DMSO与蛋白质疏水集团会发生作用，导致蛋白质变性,具有血管毒性和肝肾毒性",
    "高挥发浓度DMSO可能导致头痛，晕眩和镇静",
    "DMSO对皮肤没有渗透性",
    "DMSO能够灼伤皮肤并使皮肤有刺痛感，如同所见的皮疹及水泡一样",
]
str_test[641] = [
    "下列关于氯仿（CHCl3）的说法，错误的是：",
    "对皮肤、眼睛、黏膜和呼吸道有刺激作用",
    "是一种致癌剂，会损害肝和肾",
    "操作时应在化学通风橱里进行",
    "不易挥发",
]
str_test[642] = ["下列关于甲醛（HCOH）的说法，错误的是：", "有很大的毒性", "易挥发", "使用时不用避开热、火花及明火", "是一种致癌剂"]
str_test[643] = [
    "EB（溴化乙锭）是一种高度灵敏的荧光染色剂，下列有关说法错误的是：",
    "实验结束后，对含EB的溶液可直接倒入下水道",
    "可用于观察琼脂糖和聚丙烯酰胺凝胶中的DNA",
    "EB是强诱变剂，具有高致癌性",
    "EB需要避光保存",
]
str_test[644] = [
    "二硫苏糖醇（DTT）是很强的还原剂，下列有关说法错误的是：",
    "DTT可用作蛋白质的保护剂，防止蛋白质内的半胱氨酸被氧化",
    "当使用固体或高浓度储存液时，戴手套和护目镜",
    "会因吸入、咽下或皮肤吸收而危害健康",
    "不需要在通风橱操作",
]
str_test[645] = [
    "过氧化氢（H2O2），水溶液俗称双氧水，下列有关说法错误的是：",
    "高浓度过氧化氢的腐蚀性较低",
    "其具有强氧化性，可作为杀菌剂",
    "过氧化氢自身不燃，但能与可燃物反应放出大量热量和氧气而引起着火爆炸",
    "吸入该蒸汽会对呼吸道有强烈刺激性",
]
str_test[646] = [
    "紫外光是实验室中常见的光源，下列有关说法错误的是",
    "紫外光能够用在无菌室进行灭菌",
    "裸眼观察紫外光源无危害",
    "紫外光会用来观察凝胶中的核酸",
    "紫外光可损伤眼视网膜",
]
str_test[647] = [
    "关于实验室的常用有毒药品，下列说法错误的是：",
    "溴化乙锭是一种高度灵敏的荧光染色剂，具有强诱变致癌性，使用时一定要戴一次性手套",
    "甲醇有毒，能引起失明",
    "甲醛毒性较大且易挥发，应在通风橱中操作",
    "氯仿对皮肤、眼睛、黏膜和呼吸道有刺激作用，但不易挥发，所以不用在化学通风橱里操作",
]
str_test[648] = [
    "关于实验室的常用有毒药品，下列说法错误的是：",
    "甲醛毒性较大但不易挥发",
    "二甲苯具有中等毒性，对眼及上呼吸道有刺激作用",
    "乙腈易挥发易燃，通风橱中需隔热、防火",
    "氟化钠有毒可致命，通风橱中操作",
]
str_test[649] = [
    "在实验室中，安全用电非常重要，下列做法错误的是：",
    "用潮湿的手接触电器",
    "已损坏的接头、插座、插头或绝缘不良的电线及时更换",
    "如遇人触电，切断电源后再行处理",
    "先接好线路再插上电源",
]
str_test[650] = [
    "化学实验室中，尤其要注意有毒药品的使用，使用不当会危害人体健康。腐蚀品是通过皮肤接触人体形成什么危害？",
    "化学烫伤",
    "化学烧伤",
    "化学灼伤",
    "化学冻伤",
]
str_test[651] = [
    "高锰酸钾为紫黑色结晶或颗粒，与某些有机物接触易发生爆炸。下列哪种物质与高锰酸钾接触会发生燃烧？",
    "氯化钠",
    "锌片",
    "氮气",
    "甘油",
]
str_test[652] = ["属于物理消毒的方法为：", "臭氧氧化", "紫外线照射", "加入液氯", "加入碘类消毒剂"]
str_test[653] = ["属于化学消毒的方法为", "煮沸", "紫外线照射", "臭氧氧化", "超声灭菌"]
str_test[654] = ["阀门的作用主要为：", "截断水流", "调节流速", "调节压力", "调节流量"]
str_test[655] = ["工业上用来衡量催化剂生产能力大小的是：", "催化剂选择性", "催化剂活性", "催化剂稳定性", "催化剂密度"]
str_test[656] = [
    "大气污染面源，是指在一个较大面积区域中较密集的排放大气污染物点连成一片的大气污染源。下列不会构成大气污染面源的是：",
    "家庭炉灶",
    "商业用锅炉",
    "一个烟囱",
    "工业污染",
]
str_test[657] = ["单位质量燃料完全燃烧所需的空气质量称为：", "理论空气量", "所需空气量", "实际空气量", "剩余空气量"]
str_test[658] = ["下列哪个物质不属于常用的污水消毒剂？", "臭氧", "氮气", "液氯", "次氯酸钠"]
str_test[659] = ["剧毒物品必须储存在什么地方？", "随意放置", "柜子高处", "带双锁的铁皮保险柜", "阴凉的地方"]
str_test[660] = ["实验室用过的废液如何处置？", "倒入水槽中", "倒入垃圾桶", "随意处置", "交相关部门统一处理"]
str_test[661] = ["下列物品中，不能存放在普通冰箱的是：", "水", "汽油", "菌体", "无机试剂"]
str_test[662] = ["搬运剧毒化学品后，应该：", "用布擦一擦手", "休息", "用流动的水洗手", "什么都不用做"]
str_test[663] = ["下列哪种瓶塞不适合作为盛放有爆炸性的物质的瓶塞：", "橡胶塞", "软木塞", "胶皮塞", "磨口玻璃塞"]
str_test[664] = ["氢氰酸是什么气味？", "无味", "苦杏仁味", "腥味", "汽油味"]
str_test[665] = ["发生爆炸的基本因素有：", "温度", "压力", "着火源", "选项都对"]
str_test[666] = ["下列不属于剧毒物的是：", "硫酸钡", "氯乙酸", "丙烯醛", "碘甲烷"]
str_test[667] = ["下列不属于危险化学品的是：", "氯化钠", "汽油", "剧毒品", "强氧化剂"]
str_test[668] = ["下列气体中，无毒的是：", "硫化氢", "氮气", "甲醛", "一氧化氮"]
str_test[669] = ["下列气体中，无刺激性气味的是：", "氧气", "氨气", "氯气", "光气"]
str_test[670] = ["窒息性气体，是指能造成机体缺氧的有毒气体。下列气体不属于窒息性气体的是：", "一氧化碳", "氧气", "氮气", "甲烷"]
str_test[671] = ["下列气体中，无刺激性气味的是：", "二氧化硫", "氟化氢", "氮气", "氨气"]
str_test[672] = ["丙酮是低毒类化学品，下列说法正确的是：", "丙酮极易挥发", "丙酮易燃", "丙酮对神经系统有麻醉作用", "选项都对"]
str_test[673] = ["下列哪种物品应放在防爆冰箱中保存？", "菌体", "甲基丙烯酸甲酯", "氯化钠溶液", "盐酸"]
str_test[674] = ["金属钠着火应该怎么扑灭？", "使用二氧化碳灭火器", "用水", "用干燥的细沙覆盖", "使用泡沫灭火器"]
str_test[675] = ["遇到火灾时，应如何逃离？", "往人多的方向走", "往人少的方向走", "从安全出口逃离", "乘坐电梯逃离"]
str_test[676] = ["实验时被玻璃划伤，首先应如何处理？", "止血", "往伤口冲水", "将伤口的碎玻璃挑出", "不理睬"]
str_test[677] = ["下列气体中，毒性最强的是：", "氧气", "氮气", "二氧化碳", "二氧化硫"]
str_test[678] = ["下列气体中，毒性最强的是：", "氩气", "氢气", "氦气", "氯气"]
str_test[679] = ["氯气是一种有强烈刺激性气味的剧毒气体，它在常温常压下的颜色是：", "黄绿色", "蓝色", "红色", "紫色"]
str_test[680] = [
    "闪点表示易燃液体的易燃程度。下列说法正确的是：",
    "液体的闪点越低，易燃性越大，危险性越大",
    "液体的闪点越低，易燃性越小，危险性越小",
    "液体的闪点越低，易燃性越小，危险性越大",
    "液体的闪点越低，易燃性越大，危险性越小",
]
str_test[681] = ["下列物品中，着火后可以用水扑灭的是：", "钠", "木材", "汽油", "电线"]
str_test[682] = ["下列哪种粉尘不具有爆炸性？", "水泥", "煤炭", "面粉", "铝粉"]
str_test[683] = ["液化气发生火灾，不能使用哪种灭火器？", "二氧化碳灭火器", "干粉灭火器", "泡沫灭火器", "1121灭火器"]
str_test[684] = [
    "实验室废气不容忽视，下列关于废气处理的说法错误的是：",
    "可能产生毒害性较小的气体的实验，在通风橱内操作，废气通过排气管道稀释排放到高空大气中",
    "毒害性不大的气体可以直接排放",
    "可能产生毒害性较大的气体，通过吸收瓶吸收转化",
    "产生的二氧化氮气体用碱液吸收",
]
str_test[685] = [
    "关于实验室的废渣处理问题，下列说法错误的是：",
    "会放出有毒气体的废料不能丢进废品箱内",
    "会自燃的危险废料不能排进废水管道中",
    "不溶于水的废气药品不能丢进废水管道中",
    "碎玻璃直接丢进废纸篓内",
]
str_test[686] = [
    "关于实验室的废渣处理问题，下列说法错误的是：",
    "易于燃烧的固体有机废物焚烧处理",
    "对环境无污染的废渣按一般垃圾处理",
    "会自燃的危险废料可以排进废水管道中",
    "无毒害的废渣按一般垃圾处理",
]
str_test[687] = [
    "关于实验室的废液处理问题，下列说法错误的是：",
    "废酸、废碱中和后稀释，再排入污水管道",
    "不同废液混合后排入下水道",
    "废液储存器必须贴上标签，写明种类、储存时间",
    "一般盐溶液可以直接排放，含有害离子的溶液进行化学法转化后稀释排放",
]
str_test[688] = ["下列哪个选项的废液不能互相混合：", "稀盐酸和氯化钠溶液", "苯和四氯化碳", "甲苯和乙苯", "稀盐酸和硫化钠溶液"]
str_test[689] = ["若选用氧化分解法处理废液，下列哪种物质无法用来处理废液：", "过氧化氢", "高锰酸钾溶液", "氯化钠溶液", "次氯酸钠溶液"]
str_test[690] = ["下列那种气体不属于实验室废气：", "氧气", "二氧化硫", "氯气", "一氧化碳"]
str_test[691] = ["产生温室效应的气体主要是：", "二氧化碳", "臭氧", "氢气", "氦气"]
str_test[692] = ["下列属于不可再生能源的是：", "水能", "潮汐能", "核能", "天然气"]
str_test[693] = ["下列气体中，对植物危害较大的是：", "一氧化碳", "二氧化碳", "氢气", "二氧化硫"]
str_test[694] = ["保护水环境，应选择使用哪种洗衣粉？", "无磷", "性价比高的", "价格高的", "便宜的"]
str_test[695] = [
    "下列说法错误的是：",
    "硫酸亚铁与空气接触易被氧化，须密封保存",
    "硝酸铵受热分解产生的气体无害",
    "金属钠与水和空气接触会反应，须密封保存",
    "铬化合物中六价铬毒性最大，会引起蛋白质变性",
]
str_test[696] = [
    "在实验室接触一些有毒有害物质时，需要做好防护工作。下列关于有毒物质的危害，说法错误的是：",
    "一氧化氮会抑制植物的光合作用，但对人体无危害",
    "汞急性中毒会引起牙龈出血、牙齿松动等症状",
    "二氧化硫大量吸入会引起喉水肿、肺水肿、窒息",
    "一氧化碳会随着人的呼吸进入血液，迅速与血液中的血红蛋白结合，使其失去携氧能力，致人缺氧",
]
str_test[697] = [
    "实验室的用电安全不可忽视。下列说法错误的是：",
    "不能使用接地不良的电气设备",
    "负载工作时，可以拔电气路线",
    "电源线接头要用绝缘胶布包好",
    "不能用湿布擦电源开关",
]
str_test[698] = [
    "实验过程中，用电安全也要时刻关注。下列说法错误的是：",
    "实验室里原则上不得使用明火电炉",
    "为了预防触电，电气设备金属外壳应接地",
    "移动电气设备时，不必切断电源",
    "电源插座附近不能堆放易燃物",
]
str_test[699] = [
    "在实验室中的行为，需要符合安全规范。下列做法正确的是：",
    "进入实验室穿好实验服",
    "在实验室打闹、抽烟",
    "在实验室内堆放个人物品",
    "在实验室冰箱中储存食物",
]

answer[600:700:1] = [
    3,
    4,
    1,
    2,
    4,
    3,
    1,
    2,
    3,
    4,
    2,
    4,
    2,
    3,
    1,
    1,
    3,
    2,
    4,
    1,
    2,
    2,
    3,
    4,
    3,
    4,
    3,
    1,
    4,
    1,
    2,
    4,
    1,
    2,
    1,
    3,
    2,
    3,
    2,
    4,
    3,
    4,
    3,
    1,
    4,
    1,
    2,
    4,
    1,
    1,
    3,
    4,
    2,
    3,
    4,
    2,
    3,
    1,
    2,
    3,
    4,
    2,
    3,
    4,
    2,
    4,
    1,
    1,
    2,
    1,
    2,
    3,
    4,
    2,
    3,
    3,
    3,
    4,
    4,
    1,
    1,
    2,
    1,
    3,
    2,
    4,
    3,
    2,
    4,
    3,
    3,
    1,
    4,
    4,
    1,
    2,
    1,
    2,
    3,
    4,
]
# answer[600:700:1]
# 700-800:1题目
# 实验室用水、用电、用气、仪器及设备操作、安全法律法规、环境保护、三废处理、药品毒性
# str_test[] = ["", '', '', '', '']

str_test[700] = [
    "把玻璃管或温度计插入橡皮塞或软木塞时，常常会折断而使人受伤。下列不正确的操作方法是:",
    "可在玻璃管上沾些水或涂上甘油等作润滑剂,一手拿着塞子，一手拿着玻璃管一端（两只手尽量靠近），边旋转边慢慢地把玻璃管插入塞子中",
    "橡皮塞等钻孔时，打出的孔比管径略小，可用圆锉把孔锉一下，适当扩大孔径",
    "无需润滑,且操作时与双手距离无关",
    "以上都正确",
]
str_test[701] = [
    "不慎发生意外，下列哪个操作是正确的？",
    "如果不慎将化学品弄洒或污染，立即自行回收或者清理现场，以免对他人产生危险",
    "任何时候见到他人洒落的液体应及时用抹布抹去，以免发生危险",
    "pH值中性即意味着液体是水，自行清理即可",
    "不慎将化学试剂弄到衣物和身体上，立即用大量清水冲洗10－15分钟",
]
str_test[702] = ["以下物质中，哪些应该在通风橱内操作?", "氢气", "氮气", "氦气", "氯化氢"]
str_test[703] = [
    "超级恒温水浴使用时错误的操作是：",
    "超级恒温水浴内应使用去离子水（或纯净水）",
    "恒温水浴内去离子水未加到“正常水位”严禁通电，防止干烧",
    "可以使用自来水",
    "以上都错",
]
str_test[704] = ["大量试剂应放在什么地方？", "试剂架上", "实验室内试剂柜中", "实验台下柜中", "试剂库内"]
str_test[705] = [
    "高温实验装置使用注意事项错误的是：",
    "使用高温装置的实验，要求在防火建筑内或配备有防火设施的室内进行，并要求密闭，减少热量损失",
    "注意防护高温对人体的辐射",
    "如不得已非将高温炉之类高温装置置于耐热性差的实验台上进行实验时，装置与台面之间要保留一厘米以上的间",
    "熟悉高温装置的使用方法，并细心地进行操作",
]
str_test[706] = [
    "过氧化酸、硝酸铵、硝酸钾、高氯酸及其盐、重铬酸及其盐、高锰酸及其盐、过氧化苯甲酸、五氧化二磷等是强氧化剂，使用时应注意：",
    "环境温度不要高于30℃",
    "通风要良好",
    "不要加热，不要与有机物或还原性物质共同使用",
    "以上都是",
]
str_test[707] = ["回流和加热时，液体量不能超过烧瓶容量的：", "1/2", "2/3", "3/4", "4/5"]
str_test[708] = [
    "化学危险药品对人身会有刺激眼睛、灼伤皮肤、损伤呼吸道、麻痹神经、燃烧爆炸等危险，一定要注意化学药品的使用安全，以下不正确的做法是：",
    "了解所使用的危险化学药品的特性，不盲目操作，不违章使用",
    "室内可存放大量危险化学药品",
    "妥善保管身边的危险化学药品，做到：标签完整，密封保存；避热、避光、远离火种",
    "严防室内积聚高浓度易燃易爆气体",
]
str_test[709] = ["离心操作时，为防液体溢出，离心管中样品装量不能超过离心管体积的多少？", "1/2", "2/3", "3/4", "4/5"]

str_test[710] = [
    "取用化学药品时，以下哪些事项操作是正确的？",
    "取用腐蚀和刺激性药品时，尽可能带上橡皮手套和防护眼镜",
    "倾倒时，切勿直对容器口俯视；吸取时，应该使用橡皮球",
    "开启有毒气体容器时应带防毒用具",
    "以上都是",
]
str_test[711] = [
    "取用试剂时，错误的说法是",
    "多取的试剂可倒回原瓶，避免浪费",
    "不能用手接触试剂，以免危害健康和沾污试剂",
    "瓶塞应倒置桌面上，以免弄脏，取用试剂后，立即盖严，将试剂瓶放回原处，标签朝外",
    "要用干净的药匙取固体试剂，用过的药匙要洗净擦干才能再用",
]
str_test[712] = [
    "互相起化学反应的药品存放应注意那些事项",
    "氧化剂与还原剂及有机物等不能混",
    "强酸尤其是硫酸忌与强氧化剂的盐类（如高猛酸钾、氯酸钾等）混放；与酸类反应发生有害气体的盐类（如氰化钾、硫化钠、亚硝酸钠、氯化钠、亚硫酸钠等），不能与酸混放",
    "易水解的药品（如醋酸酐、乙酰氯、二氯亚砜等）忌水、 酸及碱",
    "以上都是",
]
str_test[713] = [
    "化学实验注意事项有那些",
    "实验之前应先阅读使用化学品的安全技术说明书（MSDS），了解化学品特性，采取必要的防护措施",
    "严格按实验规程进行操作，在能够达到实验目的的前提下，尽量少用，或用危险性低的物质替代危险性高的物质",
    "使用化学品时，不能直接接触药品、品尝药品味道、把鼻子凑到容器口嗅闻药品的气味",
    "以上都是",
]
str_test[714] = ["检查燃气用具是否漏气时，通常采用（   ）来寻找漏气点", "涂抹肥皂水", "划火柴", "闻气味", "用手触摸"]
str_test[715] = ["按照国家工程建筑消防技术标准施工的项目竣工时，（   ）经公安消防机构进行消防验收", "可以", "必须", "应当", "不必"]
str_test[716] = ["公安消防队扑救火灾（   ）", "只收灭火器材药剂耗损费用", "只收取人工费", "不收取任何费用", "收取所有费用"]
str_test[717] = [
    "发生火灾时，正确的安全疏散主要有三个方向，向下可以跑到地面，向上可以爬到屋顶，还可以（  ）",
    "向外逃到阳台",
    "乘坐电梯逃跑",
    "躲到角落里",
    "钻到阁楼、大橱等处避难",
]
str_test[718] = [
    "化学品的毒性可以通过皮肤吸收、消化道吸收及呼吸道吸收等三种方式对人体健康产生危害，下列不对的预防措施是",
    "实验过程中使用三氯甲烷时戴防尘口罩",
    "实验过程中移取强酸、强碱溶液应带防酸碱手套",
    "实验场所严禁携带食物；禁止用饮料瓶装化学药品，防止误食",
    "称取粉末状的有毒药品时，要带口罩防止吸入",
]
str_test[719] = [
    "实验时如果有有毒有害气体产生应该采取下列措施( )",
    "停止工作 ，人员离开实验室",
    "在通风橱内工作",
    "移到走廊工作",
    "戴上口罩继续工作",
]

str_test[720] = ["液化气发生火灾后不可采用（ ）灭火器", "干粉灭火器", "清水灭火器", "二氧化碳灭火器", "1121灭火器"]
str_test[721] = [
    "下列实验操作中，说法对的是",
    "可以对容量瓶、量筒等容器加热",
    "在通风橱操作时, 可将头伸入通风柜内观察",
    "非一次性防护手套脱下前必须冲洗干净，而一次性手套时须从后向前把里面翻出来脱下后再扔掉",
    "可以抓住塑料瓶子或玻璃瓶子的盖子搬运瓶子",
]
str_test[722] = ["恒温培养箱的使用最高温度为", "60℃", "100℃", "80℃", "40℃"]
str_test[723] = ["在普通冰箱中不可以存放什么物品？", "普通化学试剂", "酶溶液", "菌体", "有机溶剂"]
str_test[724] = ["如何在实验室放置盛汞的容器？", "密封即可", "在汞面上加盖一层硫粉", "在汞面上加盖一层水封", "放入通风橱中"]
str_test[725] = ["普通玻璃制品的加热温度不能超过", "250℃", "180℃", "150℃", "120℃"]
str_test[726] = [
    "对于实验室的微波炉，下列哪种说法是错的？",
    "微波炉开启后，会产生很强的电磁辐射，操作人员应远离",
    "严禁将易燃易爆等危险化学品放入微波炉中加热",
    "实验室的微波炉也可加热食品",
    "对密闭压力容器使用微波炉加热时应注意严格按照安全规范操作",
]
str_test[727] = [
    "实验中吸入Cl2或HCl气体时，应如何处理？",
    "人工呼吸",
    "立即到室外呼吸新鲜空气",
    "吸入少量酒精和乙醚的混合蒸气使之解毒",
    "不用管，过一会就好了",
]
str_test[728] = [
    "生物实验中的一次性手套及沾染EB致癌物质的物品，应：",
    "统一收集和处理",
    "丢弃在普通垃圾箱内",
    "随意放在实验室",
    "重复使用",
]
str_test[729] = ["实验室各种管理规章制度应该", "上墙或便于取阅的地方", "存放在档案柜中", "由相关人员集中保管", "保存在计算机内"]

str_test[730] = [
    "实验室安全管理实行哪种管理？",
    "校、（院）系、实验室三级管理",
    "校、（院）系两级管理",
    "院（系）、实验室两级管理",
    "实验室自行管理",
]
str_test[731] = ["身上着火，最好的做法是：", "奔跑", "大声呼救", "边跑边脱衣服", "就地打滚或用水冲"]
str_test[732] = ["火灾发生时，湿毛巾折叠8层为宜，其烟雾浓度消除率可达：", "40%", "60%", "80%", "95%"]
str_test[733] = [
    "实验中如遇刺激性及神经性中毒，先服牛奶或鸡蛋白使之缓和，再服用：",
    "氢氧化铝膏，鸡蛋白",
    "硫酸铜溶液（30g溶于一杯水中）催吐",
    "乙酸果汁，鸡蛋白",
    "以上都可以",
]
str_test[734] = ["眼睛被消毒液灼伤后，正确的急救方法是（ ）", "点眼药膏", "马上到医院看急诊", "立即打开眼睑，用清水冲洗眼睛", "点眼药水"]
str_test[735] = ["以下哪项不是呼吸、心跳停止的表现?", "意识忽然丧失", "颈动脉搏动不能触及", "面色苍白转而紫绀", "瞳孔缩小"]
str_test[736] = [
    "请从下列选项中选择万一发生电气火灾后首先应该采取的第一条措施",
    "打电话报警",
    "切断电源",
    "扑灭明火",
    "保护现场，分析火因，以便采取措施，杜绝隐患",
]
str_test[737] = ["天气较热时，打开腐蚀性液体，应该：", "用毛巾先包住塞子", "直接用手", "戴橡胶手套", "用纸包住塞子"]
str_test[738] = ["以下几种气体中，最毒的气体为：", "氯气", "光气（COCl2）", "二氧化硫", "三氧化硫"]
str_test[739] = ["剧毒物品必须保管、储存在什么地方？", "铁皮柜", "木柜子", "带双锁的木柜子", "带双锁的铁皮保险柜"]

str_test[740] = [
    "涉及有毒试剂的操作时，应采取的保护措施包括：",
    "佩戴适当的个人防护器具",
    "了解试剂毒性，在通风橱中操作",
    "做好应急救援预案",
    "以上都是",
]
str_test[741] = [
    "危险化学品的毒害包括：",
    "皮肤腐蚀性/刺激性，眼损伤/眼刺激",
    "急性中毒致死，器官或呼吸系统损伤，生殖细胞突变性，致癌性",
    "水环境危害性, 放射性危害",
    "以上都是",
]
str_test[742] = [
    "室温较高时，有些试剂如氨水等，打开瓶塞的瞬间很易冲出气液流，应先如何处理，再打开瓶塞？",
    "先将试剂瓶在热水中浸泡一段时间",
    "振荡一段时间",
    "先将试剂瓶在冷水中浸泡一段时间",
    "先将试剂瓶颠倒一下",
]
str_test[743] = ["各种气瓶的存放，必须距离明火（ ）以上，避免阳光暴晒，搬运时不得碰撞", "1米", "3米", "5米", "10米"]
str_test[744] = [
    "对于全部参数可调的科研用激光器，为保证安全运行，必须严格按照激光器注入能量限制匹配原则对激光加工参数进行设定，应由（ ） 操作，（ ） 负责管理。",
    "本科生，教师",
    "研究生，教师",
    "博士生，教师",
    "专人，专人",
]
str_test[745] = ["我国气体钢瓶常用的颜色标记中，氮气的瓶身和标字颜色分别为", "黑 蓝", "黄 黑", "黑 黄", "蓝 黑"]
str_test[746] = ["当油脂等有机物沾污氧气钢瓶时，应立即用什么洗净", "四氯化碳", "乙醇", "水", "汽油"]
str_test[747] = ["以下不会引发火灾事故的是：", "电磁辐射", "冲击摩擦", "静电火花", "高温表面"]
str_test[748] = [
    "苯是无色透明液体，易挥发，具有芳香气味；易溶于有机溶剂，不溶于水，故（ ）用水扑救苯引起的火灾",
    "不能",
    "能",
    "完全可以",
    "看情况",
]
str_test[749] = ["易燃液体的蒸汽与空气的混合物可被点燃产生瞬间闪光的最低温度称为（ ）", "闪点", "着火点", "起爆点", "沸点"]

str_test[750] = [
    "电石（学名碳化钙）为灰色的不规则的块状物，有强烈的吸湿性，能从空气中吸收水分而发生反应，放出（ ）易燃气体",
    "甲烷",
    "乙烷",
    "乙炔",
    "一氧化碳",
]
str_test[751] = ["欲除去氯气时，以下哪一种物质作为吸收剂最为有效？", "氯化钙", "稀硫酸", "硫代硫酸钠", "氢氧化铅"]
str_test[752] = ["二氧化碳钢瓶瓶身颜色是什么？", "黄色", "天蓝色", "黑色", "铝白色"]
str_test[753] = [
    "关于氢氟酸的描述哪个是错误的",
    "稀的氢氟酸危害性很低，不会产生严重烧伤",
    "氢氟酸有强烈的腐蚀性和危害性，皮肤接触氢氟酸后可出现疼痛及灼伤，随时间疼痛渐剧，皮肤下组织被破坏，这种破坏会传播到骨骼",
    "氢氟酸蒸气溶于眼球内的液体中会对人的视力造成永久损害",
    "使用氢氟酸一定要戴防护手套，工作中注意不要接触氢氟酸蒸汽 工作结束后要注意用水冲洗手套、器皿等，不能有任何残余留下",
]
str_test[754] = ["对钠、钾等金属着火用什么扑灭？", "用水灭火", "通常用干燥的细沙覆盖", "CCl4灭火器", "CO2灭火器"]
str_test[755] = [
    "静电的电量虽然不大，但其放电时产生的静电火花有可能引起爆炸和火灾，比较常见的是放电时瞬间的电流造成精密实验仪器损坏，不正确的预防措施有:",
    "适当提高工作场所的湿度",
    "在易产生静电的场所梳理头发",
    "进行特殊危险实验时，操作人员应先接触设置在安全区内的金属接地棒，以消除人体电位",
    "计算机进行维护时，使用防静电毯",
]
str_test[756] = ["安装使用漏电保护器，是属于哪种安全技术措施? ", "应急安全措施", "绝对安全措施", "辅助安全措施", "基本安全措施"]
str_test[757] = ["在作业场所液化气浓度较高时，应该佩戴", "口罩", "眼罩", "面罩", "防毒面罩"]
str_test[758] = [
    "如果在试验过程中，闻到烧焦的气味应如何办？",
    "关机走人",
    "立即关机并报告相关负责人员",
    "打开通风装置通风",
    "请同实验的人帮忙检查",
]
str_test[759] = ["当炸药中混入惰性物质（如石蜡、硬脂酸、机油等）时，则其撞击感度降低，危险性也", "降低", "升高", "不变", "无法确定"]

str_test[760] = ["下列粉尘中，哪种不可能发生爆炸", "生石灰", "面粉", "煤粉", "铝粉"]
str_test[761] = [
    "实验中用到很多玻璃器皿，容易破碎，为避免造成割伤应该注意什么？",
    "装配时不可用力过猛，用力处不可远离连接部位",
    "不能口径不合而勉强连接",
    "玻璃折断面需烧圆滑，不能有棱角",
    "以上都是",
]
str_test[762] = ["下列气体须在通风橱内进行操作的是", "硫化氢", "氟化氢", "氯化氢", "以上都是"]
str_test[763] = [
    "下列实验室操作及安全的叙述，正确的是？",
    "实验后所取用剩余的药品应小心倒回原容器，以免浪费",
    "当强碱溶液溅出时，可先用大量的水稀释后再处理",
    "温度计破碎流出的汞，宜洒上盐酸使反应为氯化汞后再弃之",
    "以上都对",
]
str_test[764] = [
    "需要你将硫酸、氢氟酸、盐酸和氢氧化钠各一瓶从化学品柜搬到通风橱内，正确的方法是",
    "硫酸和盐酸同一次搬运，氢氟酸和氢氧化钠同一次搬运",
    "硫酸和氢氟酸同一次搬运，盐酸和氢氧化钠同一次搬运",
    "硫酸和氢氧化钠同一次搬运，盐酸和氢氟酸同一次搬运",
    "硫酸和盐酸同一次搬运，氢氟酸、氢氧化钠分别单独搬运",
]
str_test[765] = [
    "盐酸、甲醛溶液、乙醚等易挥发试剂应如何合理存放",
    "和其它试剂混放",
    "放在冰箱中",
    "分类存放在干燥通风处",
    "放在密闭的柜子中",
]
str_test[766] = ["以下哪个药品（试剂）在使用时不用注意干燥防潮？", "二氧化硅", "锂", "碳化钙", "磷化钙"]
str_test[767] = [
    "应如何简单辨认有味的化学药品？",
    "用鼻子对着瓶口去辨认气味",
    "用舌头品尝试剂",
    "将瓶口远离鼻子，用手在瓶口上方扇动，稍闻其味即可",
    "取出一点，用鼻子对着闻",
]
str_test[768] = [
    "用剩的活泼金属残渣的正确处理方法是",
    "连同溶剂一起作为废液处理",
    "在氮气保护下，缓慢滴加乙醇，进行搅拌使所有金属反应完毕后，整体作为废液处理",
    "将金属取出暴露在空气中使其氧化完全",
    "以上都对",
]
str_test[769] = [
    "有些固体化学试剂（如硫化磷、赤磷、镁粉等）与氧化剂接触或在空气中受热、受冲击或磨擦能引起急剧燃烧，甚至爆炸。使用这些化学试剂时，要注意什么",
    "要注意周围环境湿度不要太高",
    "周围温度一般不要超过30℃，最好在20℃以下",
    "不要与强氧化剂接触",
    "以上都是",
]

str_test[770] = ["在蒸馏低沸点有机化合物时应采取哪种方法加热", "酒精灯", "热水浴", "电炉", "砂浴"]
str_test[771] = [
    "关于重铬酸钾洗液，下列说法错误的是",
    "将化学反应用过的玻璃器皿不经处理，直接放入重铬酸钾洗液浸泡",
    "从洗液中捞出器皿后，立即放进清洗杯，避免洗液滴落在洗液缸外等处。然后马上用水连同手套一起清洗。",
    "取放器皿应戴上专用手套，但仍不能在洗液里的时间过长",
    "浸泡玻璃器皿时，不可以将手直接插入洗液缸里取放器皿",
]
str_test[772] = [
    "处理使用后的废液时，下列哪个说法是错误的",
    "不明的废液不可混合收集存放",
    "废液不可任意处理",
    "少量废液用水稀释后，可直接倒入下水道",
    "禁止将水以外的任何物质倒入下水道，以免造成环境污染和处理人员危险",
]
str_test[773] = ["剧毒物品保管人员应做到", "日清月结", "帐物相符", "手续齐全", "以上都对"]
str_test[774] = [
    "处置实验过程产生的剧毒药品废液，说法错误的是",
    "稀释后用大量水冲净",
    "妥善保管",
    "不得随意丢弃、掩埋",
    "集中保存，统一处理",
]
str_test[775] = [
    "实验室冰箱和超低温冰箱使用注意事项错误的是",
    "定期除霜、清理，清理后要对内表面进行消毒",
    "储存的所有容器，应当标明物品名称、储存日期和储存者姓名",
    "可以在冰箱内冷冻食品和水",
    "除非有防爆措施，否则冰箱内不能放置易燃易爆化学品溶液，冰箱门上应注明这一点",
]
str_test[776] = ["下列加热热源，化学实验室原则不得使用的是", "明火电炉", "水浴、蒸汽浴", "油浴、沙浴、盐浴", "电热板、电热套"]
str_test[777] = [
    "领取剧毒物品时，必须",
    "双人领用(其中一人必须是实验室的教师)",
    "单人领用",
    "双人领用(两人都是实验室的学生)",
    "双人领用(其中一人是实验室助教)",
]
str_test[778] = ["以下什么物质引起的皮肤灼伤禁用水洗?", "五氧化二磷", "五硫化磷", "五氯化磷", "以上都是"]
str_test[779] = ["搬运剧毒化学品后，应该：", "用水池的水洗手", "用流动的水洗手", "吃东西补充体力", "休息"]

str_test[780] = [
    "化学品的毒性可以通过皮肤吸收、消化道吸收及呼吸道吸收等三种方式对人体健康产生危害，下列不正确的预防措施是",
    "实验过程中使用三氯甲烷时戴防尘口罩",
    "实验过程中移取强酸、强碱溶液应带防酸碱手套",
    "实验场所严禁携带食物；禁止用饮料瓶装化学药品，防止误食",
    "称取粉末状的有毒药品时，要带口罩防止吸入",
]
str_test[781] = ["黄磷自燃应如何扑救", "用高压灭火器", "用高压水枪", "用雾状水灭火或用泥土覆盖", "以上都对"]
str_test[782] = ["铝粉、保险粉自燃时如何扑救", "用水灭火", "用泡沫灭火器", "用干粉灭火器", "用干砂子灭火"]
str_test[783] = [
    "强碱烧伤处理错误的是",
    "立即用1%～2%的醋酸冲洗",
    "立即用稀盐酸冲洗",
    "立即用大量水冲洗",
    "先进行应急处理，再去医院处理",
]
str_test[784] = [
    "容器中的溶剂或易燃化学品发生燃烧应如何处理？",
    "用灭火器灭火或加砂子灭火",
    "加水灭火",
    "用不易燃的瓷砖、玻璃片盖住瓶口",
    "用湿抹布盖住瓶口",
]
str_test[785] = [
    "溶剂溅出并燃烧应如何处理？",
    "马上使用灭火器灭火",
    "马上向燃烧处盖砂子或浇水",
    "马上用石棉布盖住燃烧处，尽快移去临近的其它溶剂，关闭热源和电源，再灭火",
    "以上都对",
]
str_test[786] = [
    "使用碱金属引起燃烧应如何处理？",
    "马上使用灭火器灭火",
    "马上向燃烧处浇水灭火",
    "马上用石棉布盖砂子盖住燃烧处，尽快移去临近其它溶剂，关闭热源和电源，再用灭火器灭火",
    "以上都对",
]
str_test[787] = [
    "试剂或异物溅入眼内，处理措施正确的是",
    "溴：大量水洗，再用1％NaHCO3溶液洗",
    "酸：大量水洗，用1～2％NaHCO3溶液洗",
    "碱：大量水洗，再以1％硼酸溶液洗",
    "以上都对",
]
str_test[788] = [
    "当不慎把少量浓硫酸滴在皮肤上(在皮肤上没形成挂液)时，正确的处理方法是",
    "用酒精棉球擦",
    "不作处理，马上去医院",
    "用碱液中和后，用水冲洗",
    "用水直接冲洗",
]
str_test[789] = [
    "一般无机酸、碱液和稀硫酸不慎滴在皮肤上时，正确的处理方法是",
    "用酒精棉球擦",
    "不作处理，马上去医院",
    "用水直接冲洗",
    "用碱液中和后，用水冲洗",
]

str_test[790] = ["皮肤若被低温（如固体二氧化碳、液氮）冻伤，应", "马上送医院", "用温水慢慢恢复体温", "用火烘烤", "应尽快浸入热水"]
str_test[791] = ["HCN无色，气味为", "无味", "大蒜味", "苦杏仁味", "烂苹果味"]
str_test[792] = ["易燃类液体的特点是", "闪点在25℃以下的液体，闪点越低，越易燃烧", "极易挥发成气体", "遇明火即燃烧", "以上都是"]
str_test[793] = [
    "对于一些吸入或食入少量即能中毒至死的化学试剂，生物试验中致死量（LD50）在50mg/kg以下的称为剧毒化学试剂，以下哪个不是剧毒化学试剂",
    "氰化钾",
    "苯",
    "三氧化二砷",
    "氯化汞",
]
str_test[794] = [
    "危险化学品的急性毒性表述中，半致死量LD50代表什么意义？",
    "致死量",
    "导致一半受试动物死亡的量",
    "导致一半受试动物死亡的浓度",
    "导致全部受试动物死亡的浓度",
]
str_test[795] = ["表示危险化学品的急性毒性的LD50的单位是什么？", "mg/kg", "g/kg", "mL/kg", "ug/kg"]
str_test[796] = [
    "下面哪些物质彼此混合时，不容易引起火灾？",
    "活性炭与硝酸铵",
    "金属钾、钠和煤油",
    "磷化氢、硅化氢、烷基金属、白磷等物质与空气接触",
    "可燃性物质（木材、织物等）与浓硫酸",
]
str_test[797] = [
    "2,4-二硝基苯甲醚、萘、二硝基萘等可升华固体药品燃烧应如何进行灭火",
    "用灭火器灭火",
    "火灭后还要不断向燃烧区域上空及周围喷雾水",
    "用水灭火，并不断向燃烧区域上空及周围喷雾水至可燃物完全冷却",
    "以上都是",
]
str_test[798] = ["不需在棕色瓶中或用黑纸包裹，置于低温阴凉处的药品是", "卤化银", "浓硝酸", "汞", "过氧化氢"]
str_test[799] = [
    "混和或相互接触时，不会产生大量热量而着火、爆炸的是",
    "（亚、次）氯酸盐和酸",
    "CrO3和可燃物",
    "KMnO4和可燃物",
    "CCl4和碱金属",
]

answer[700:799:1] = [
    3,
    4,
    4,
    3,
    4,
    1,
    4,
    2,
    2,
    2,
    4,
    1,
    4,
    4,
    1,
    2,
    3,
    1,
    1,
    2,
    2,
    3,
    1,
    4,
    3,
    1,
    3,
    2,
    1,
    1,
    1,
    4,
    2,
    2,
    3,
    4,
    2,
    1,
    2,
    4,
    4,
    4,
    3,
    2,
    4,
    3,
    1,
    1,
    1,
    1,
    3,
    3,
    4,
    1,
    2,
    2,
    4,
    3,
    2,
    1,
    1,
    4,
    4,
    2,
    4,
    3,
    1,
    3,
    2,
    4,
    2,
    1,
    3,
    4,
    1,
    3,
    1,
    1,
    4,
    2,
    1,
    3,
    4,
    2,
    1,
    3,
    3,
    4,
    4,
    3,
    2,
    3,
    4,
    2,
    2,
    1,
    2,
    4,
    3,
    4,
]

# answer[700:800:1]
# 800-900:1题目
str_test[800] = ["进入实验室时正确的做法是：", "按规定穿戴必要的工作服", "佩戴隐形眼镜", "披头散发", "穿拖鞋"]
str_test[801] = ["进行以下哪一项操作时，不需要佩戴防护具：", "危害物质操作研究", "烧制玻璃棒", "研究挥发性有机溶剂", "使用毒性、腐蚀性药品"]
str_test[802] = ["以下哪一项不属于国家标准中的爆炸品：", "高氯酸", "二亚硝基苯", "氧气", "四唑并-1-乙酸"]
str_test[803] = ["以下哪一项不属于国家规定的第二类危险化学品：", "氨气", "氧气", "氮（液化的）", "盐酸"]
str_test[804] = [
    "在实验室中可以进行的操作是：",
    "吃口香糖",
    "将食物储存在存有化学药品的冰箱中",
    "使用实验室的烧杯煮水喝",
    "避免在实验室中吃喝食物",
]
str_test[805] = ["以下实验用水中，纯化水平最低的是：", "纯水", "实验室Ⅱ级纯水", "去离子水", "超纯水"]
str_test[806] = ["以下实验用水中，纯化水平最高的是：", "纯水", "实验室Ⅱ级纯水", "去离子水", "超纯水"]
str_test[807] = ["以下选项中不属于评价超纯水水质常用指标的是：", "电阻率", "TOC总有机碳", "温度", "内毒素含量"]
str_test[808] = ["目前纯水的应用领域不包括：", "细菌细胞培养", "供ICU病人饮用", "电泳", "玻璃器皿清洗"]
str_test[809] = ["以下电导率值中，属于纯水的电导率值的是", "53μs/cm", "9μs/cm", "0.1μs/cm", "0.7μs/cm"]
str_test[810] = ["水的纯化技术不包括：", "蒸馏", "反渗透(RO)", "煮沸", "超滤"]
str_test[811] = ["以下选项中不属于超纯水使用要点的是：", "使用前煮沸", "取水时避免产生气泡", "即取即用", "排掉前端初期水"]
str_test[812] = [
    "以下行为中不能防止触电的是：",
    "不用潮湿的手接触电器",
    "在电线接头处上裹上绝缘胶布",
    "电器的金属外壳接地",
    "实验前先用试电笔测试高压电",
]
str_test[813] = [
    "以下行为中能够防止引起火灾的是：",
    "使用与实验室允许的用电量相符的保险丝",
    "使用高于实验室允许的用电量的保险丝",
    "在实验室中常备灭火器",
    "在实验室中常备防毒面具",
]
str_test[814] = ["操作以下哪种化学品时不需要在通风橱中进行：", "硫化氢", "氧气", "氯气", "二氧化氮"]
str_test[815] = ["以下药品中没有剧毒的是：", "氰化物", "硝酸汞", "氯化钡", "氮气"]
str_test[816] = ["以下药品中不容易爆炸的是：", "叠氮铝", "乙炔铜", "氯气", "高氯酸盐"]
str_test[817] = ["久藏的乙醚使用前应当：", "除去其中可能产生的过氧化物", "加热", "煮沸", "搅拌"]
str_test[818] = [
    "以下操作不能防止爆炸的是：",
    "使用可燃性气体时要防止气体逸出",
    "操作可燃性气体时严禁使用明火",
    "将高锰酸钾与任一强还原剂放在一起",
    "防止发生电火花",
]
str_test[819] = [
    "以下操作不能防止引起火灾的是：",
    "将金属钠隔绝空气保存",
    "将使用完的丙酮倒入下水道",
    "将金属氰化物隔绝空气保存",
    "严禁在易燃物旁使用明火",
]
str_test[820] = ["以下哪种物质着火时可以用水浇灭：", "金属钠", "电石", "苯", "纸张"]
str_test[821] = ["以下哪种物质不会灼伤皮肤：", "溴", "苯酚", "氮气", "液氮"]
str_test[822] = [
    "使用气体钢瓶的注意事项不包括：",
    "钢瓶应存放在阴凉、干燥、远离热源的地方",
    "使用时取下减压阀",
    "不要让油或易燃有机物沾染气瓶上",
    "不可把气瓶内气体用光",
]
str_test[823] = [
    "使用气体钢瓶的注意事项不包括：",
    "使吏用中的气瓶每五年应检查一次",
    "装腐蚀性气体的钢瓶每两年检查一次",
    "氢气瓶应放在远离实验室的专用小屋内，用紫铜管引入实验室",
    "开启总阀门时，不要将头或身体正对总阀门",
]
str_test[824] = ["电器在使用过程中出现以下哪种现象需要立即停止使用：", "出现火星", "散发异味", "出现微热", "发出怪声"]
str_test[825] = [
    "以下用电行为正确的是：",
    "超负荷用电",
    "将杂物放在远离电器的地方",
    "在打雷天气正常使用设备",
    "为了方便让电器处于长期通电状态",
]
str_test[826] = [
    "以下用电行为错误的是：",
    "用湿抹布清洁电器",
    "电器使用完毕后应拔掉电源插头",
    "不用手或铁丝、钉子、别针等金属制品去接触，探试电源插座内部",
    "不随意拆卸、安装电源线路、插座、插头等",
]
str_test[827] = [
    "发生触电事故后，正确的处理方法是：",
    "在连接电源的情况下抢救触电者",
    "远离触电者并拨打119，等待消防员来抢救触电者",
    "远离触电者并拨打120，等待医护人员来抢救触电者",
    "在切断电源后、保证自身安全的情况下，争分夺秒进行抢救",
]
str_test[828] = ["以下物质中不属于易燃易爆物质的是：", "纯水", "甲苯", "硝酸铵", "高氯酸"]
str_test[829] = [
    "以下哪种物体燃烧时能用水扑灭：",
    "能与水发生猛烈作用的物质",
    "不溶于水的易燃液体",
    "密度高于水的易燃液体",
    "密度低于水的易燃液体",
]
str_test[830] = [
    "以下操作中不能够防止化学烧伤的是：",
    "取用危险药品及强酸、强碱和氨水时，必须带橡皮手套和防护眼镜",
    "避免直接触及过热、过冷的物体",
    "稀释浓硫酸时必须在耐热容器中进行，在不断搅拌下将浓酸倒入水中",
    "如需将浓硫酸用碱液中和，必须先稀释",
]
str_test[831] = [
    "以下操作中不能够防止割伤的是：",
    "安装易碎裂的玻璃仪器时用布片包裹",
    "往玻璃管上套橡皮管时先浸湿橡皮管内口，再慢慢转动玻璃管",
    "容器中溶液超过半升时，应托扶瓶底移取",
    "在使用玻璃器皿时，先进行预热",
]
str_test[832] = [
    "以下急救处理错误的是：",
    "室内硫化氢泄露时立即离开现场",
    "手沾上硫酸时，应立即用大量水冲洗，然后用2%的小苏打水冲洗患部",
    "皮肤受到氢氧化钠伤害时，迅速用大量水冲洗，再用2%稀盐酸溶液充分洗涤",
    "有机化合物中毒视情况采取不同急救措施",
]
str_test[833] = [
    "以下用电行为正确的是：",
    "不能使用挂钩线、破股线、地爬线和绝缘不合格的导线接电",
    "将电话线、广播线与电力线混装在一起，同孔入室",
    "将灯头当做手电筒使用",
    "为了方便，将实验室内的某设备长期通电",
]
str_test[834] = ["以下物质中属于高闪点液体的是：", "乙醛", "环辛烷", "丙酮", "苯"]
str_test[835] = ["以下物质中属于中闪点液体的是：", "乙醛", "环辛烷", "丙酮", "苯"]
str_test[836] = ["以下闪点数值在低闪点范围内的是：", "-19℃", "0℃", "12℃", "25℃"]
str_test[837] = ["以下物品中，属于自燃物品的是：", "红磷", "硫磺", "三氯化钛", "金属钠"]
str_test[838] = ["第五类危险化学品指的是：", "易燃固体、自燃物品和遇湿易燃物品", "氧化剂和有机过氧化物", "压缩气体和液化气体", "毒害品"]
str_test[839] = ["以下哪一类化学品不属于《危险化学品安全管理条例》管理范围：", "放射性物品", "毒害品", "易燃液体", "爆炸品"]
str_test[840] = ["下列物品中，不属于毒害品的是：", "氰化物", "砷化物", "化学农药", "过氧化物"]
str_test[841] = ["我国关于危险化学品共有多少种分类：", "6", "7", "8", "9"]
str_test[842] = ["以下物质中不属于第八类危险化学品的是：", "硫酸", "氯化钠", "硫氢化钙", "二氯乙醛"]
str_test[843] = ["以下药品中，少量吸入就会致死的是：", "乙醇", "溴代烃", "乙醚", "三氧化二砷"]
str_test[844] = ["以下药品中，不属于无机药品的是：", "烷基化试剂", "氰化物", "氢氰酸", "黄磷"]
str_test[845] = ["以下物质中，不是有毒气体的是：", "氮气", "溴气", "二氧化硫", "光气"]
str_test[846] = ["下列哪一选项不会灼伤皮肤：", "液氮", "盐", "高温", "强碱"]
str_test[847] = ["下列药品中，应当专柜保管、使用应当记录的是：", "盐酸", "硫酸", "铅盐", "卤素"]
str_test[848] = [
    "下列哪一选项不符合化学试剂存放要求：",
    "无机酸和有机酸一起存放",
    "有机试剂放在铁制试剂橱",
    "无机强氧化剂放于避光的试剂柜中",
    "在药品柜上贴上分类药品标签",
]
str_test[849] = ["气体钢瓶的颜色不包括：", "天蓝色", "黑色", "棕色", "深紫色"]
str_test[850] = ["以下哪一选项中，气体钢瓶颜色和所存气体是不对应的：", "天蓝色氧气瓶", "深蓝色氩气瓶", "黄色氮气瓶", "黑色二氧化碳气瓶"]
str_test[851] = ["稀释浓硫酸的正确操作是：", "将水慢慢倒入浓硫酸中", "将浓硫酸慢慢倒入水中", "将水迅速倒入浓硫酸中", "将浓硫酸迅速倒入水中"]
str_test[852] = ["以下物质遇水不容易爆炸的是：", "钠", "钾", "钙", "氩气"]
str_test[853] = ["使用以下哪种物品不必定要在特殊排烟柜及桌上型抽烟管下进行操作：", "挥发性有机溶剂", "高腐蚀性药品", "弱酸弱碱", "有毒药品"]
str_test[854] = ["以下设备中，不属于化工容器类的是：", "填料塔", "槽", "罐", "釜"]
str_test[855] = ["以下设备中，不属于分离塔器类的是：", "填料塔", "搅拌塔", "浮阀塔", "泡罩塔"]
str_test[856] = ["反应器的类型不包括：", "管式反应器", "液态化反应器", "搅拌法反应器", "框式反应器"]
str_test[857] = ["加热炉的类型不包括：", "电加热炉", "管式裂解炉", "酒精加热炉", "废热锅炉"]
str_test[858] = ["不属于化工设备的是：", "加热设备", "变压器", "换热设备", "塔器"]
str_test[859] = [
    "下列对于离心机的维护中，错误的是：",
    "常用热水或蒸汽洗涤时,应经常加注润滑脂",
    "运转时检查轴承声音是否正常",
    "定期从主轴注油孔注入适量润滑脂",
    "每三年一次更换摩擦片",
]
str_test[860] = [
    "下列对于反应釜的维护中，错误的是：",
    "在搪玻璃反应釜温度骤冷骤热时，做好温度监测工作",
    "锅内压力、温度严格控制，不得超温超压",
    "按时加注润滑油",
    "罐内有压力时, 严禁带压紧固各受压元件",
]
str_test[861] = ["以下原因中不会造成反应釜壳体损坏的是：", "受介质腐蚀", "进出料阀堵塞", "热应力影响", "晶间腐蚀"]
str_test[862] = ["反应釜轴承器响声过大的原因不包括：", "螺栓松动", "弹性联轴器磨损", "垫圈错位", "间隙过大"]
str_test[863] = ["袋式除尘器的原理是：", "蒸馏", "化学反应", "高温", "过滤"]
str_test[864] = ["化工设备图的种类不包括：", "分支装配图", "总装配图", "部件装配图", "零件图"]
str_test[865] = ["化工设备的安全可靠性要求不包括：", "强度和刚度", "操作控制难度", "耐腐蚀性", "密封度"]
str_test[866] = [
    "造成水泵流量不够的原因不包括：",
    "吸水部分的滤水堵塞",
    "口环磨损,使口环与叶轮间隙过大",
    "系统总扬程高于泵的设计扬程",
    "吸水部分浸没深度不够",
]
str_test[867] = [
    "EYH二维运动混合机抽料速度太慢的原因不包括：",
    "滤布阻塞",
    "抽气系统有泄漏，宣盖未盖紧",
    "抽料管插入料桶太深",
    "传动链太松",
]
str_test[868] = [
    "U型管式换热器指的是：",
    "管束由弯管半径不等的U形管组成且管子两端都固定在同一管板上的管壳式换热器",
    "管束两端管板采用焊接方法与壳体固定连接的管壳式换热器",
    "两端管板中只有一端与壳体固定，另一端可相对壳体自由移动",
    "在芯筒与外筒之间的空间内将传热管按螺旋线形状交替缠绕而成，相邻两层螺旋状传热管的螺旋方向相反",
]
str_test[869] = [
    "下列操作中不能提高真空机组真空度的是：",
    "增添新油、换油",
    "开大冷却水阀",
    "清理油路或调节进油量调整转数使之符合规定更换阀片",
    "旋紧螺栓、用腊脂密封调整或更换零件",
]
str_test[870] = ["电加热釜的基本操作流程不包括：", "开启水阀", "开启凉油泵", "向夹套内补充凉油", "通过控制柜设置加热预置温度"]
str_test[871] = ["盐水或循环水管路的压力表数值合理的是：", "50MPa", "15MPa", "1MPa", "0.1MPa"]
str_test[872] = ["冷冻釜乙醇冷媒的合理使用温度范围是：", "-25℃到-45℃", "25℃到45℃", "25℃到-45℃", "-25℃到45℃"]
str_test[873] = ["设备管理中的“四懂”不包括：", "懂原理", "懂构造", "懂故障排除", "懂工艺流程"]
str_test[874] = ["化学安全法律法规不包括：", "危险化学品安全管理条例", "刑法", "易制毒化学品管理条例", "中华人民共和国监控化学品管理条例"]
str_test[875] = [
    "以下标准中，不属于化学品标准的是：",
    "GB 2626-2019",
    "GB/T 40640.4-2021",
    "ISO 257-2004",
    "ISO 1750 AMD 6-2018 ",
]
str_test[876] = ["国家标准的爆炸品中，包括危险化学品的有多少项：", "1", "2", "3", "4"]
str_test[877] = [
    "化学试剂现行的国家标准中不包括：",
    "GB/T 14305-1993",
    "GB 19083-2010",
    "GB/T 15347-1994",
    "GB/T 15899-1995",
]
str_test[878] = ["GB/T 1265-2003标准对应的化学试剂是：", "溴化氢", "溴化钾", "溴苯", "溴化钠"]
str_test[879] = ["化学试剂常用质量级别与标签颜色对应的是：", "优级纯-红标签", "分析纯-绿标签", "化学纯-蓝标签", "实验纯-紫标签"]
str_test[880] = ["主成分含量达到多少以上，属于5N当量试剂：", "99.9%", "99.99%", "99.999%", "99.9999%"]
str_test[881] = ["化学试剂1级标准划分的类别不包括：", "无机试剂", "标准试剂", "生化试剂", "实验试剂"]
str_test[882] = ["下列试剂中，含有剧毒的是：", "三氧化二砷", "氨气", "高锰酸钾", "氮气"]
str_test[883] = ["强氧化性化学试剂中不包括：", "过氧化酸", "盐酸", "高锰酸盐", "高氯酸盐"]
str_test[884] = ["下列化学物质中，不是红色的是：", "铜单质", "红磷", "氧化铜", "氧化亚铁"]
str_test[885] = ["水溶液呈蓝色的物质不包括：", "硫酸铜", "铜单质", "醋酸铜", "氯化铜"]
str_test[886] = ["1956年，日本某化工厂排放了含什么的废水，导致水俣病：", "氮", "铬", "镉", "汞"]
str_test[887] = [
    "伦敦烟雾事件的原因是：",
    "化工厂排放了含镉废水",
    "化工厂排放了含汞废水",
    "燃煤产生的二氧化硫转化为硫酸雾",
    "一战中使用的光气遗留",
]
str_test[888] = ["按环境要素分类，环境污染的分类不包括：", "大气污染", "水体污染", "生物污染", "土壤污染"]
str_test[889] = ["水污染的来源不包括：", "经处理后的化学实验用水的排放", "工业污水的排放", "生活污水的排放", "垃圾液的渗透"]
str_test[890] = ["大气中的污染物不包括：", "二氧化硫", "氮气", "氮氧化物", "碳氢化物"]
str_test[891] = ["“三废”不包括：", "废气", "废水", "废物", "废渣"]
str_test[892] = ["实验室中废气的处理方法不包括：", "冷凝法", "溶液吸收法", "固体吸收法", "直接排放到室外"]
str_test[893] = ["硅胶吸附剂可以处理的物质不包括：", "苯乙烯", "水", "乙炔", "二氧化硫"]
str_test[894] = ["化学药品中毒的可能途径不包括：", "皮肤吸收", "间接接触", "消化道吸收", "呼吸道吸收"]
str_test[895] = ["氰化钠的气味是：", "臭鸡蛋味", "酸味", "苦杏仁味", "水果芳香"]
str_test[896] = ["有臭鸡蛋气味的物质是：", "盐酸", "氯气", "乙酸乙酯", "硫化氢"]
str_test[897] = ["在以下哪种气体中，镁不可以燃烧：", "氩气", "氧气", "氯气", "氮气"]
str_test[898] = ["下列哪种物质在空气中燃烧产生的火焰不是蓝色的：", "氢气", "甲烷", "磷", "一氧化碳"]
str_test[899] = ["为了安全需要贮存于煤油中的金属是：", "铜", "铁", "钙", "钠"]

answer[800:899:1] = [
    1,
    2,
    3,
    4,
    4,
    1,
    4,
    3,
    2,
    2,
    3,
    1,
    4,
    1,
    2,
    4,
    3,
    1,
    3,
    2,
    4,
    3,
    2,
    1,
    3,
    2,
    1,
    4,
    1,
    3,
    2,
    4,
    3,
    1,
    2,
    4,
    1,
    3,
    2,
    1,
    4,
    3,
    2,
    4,
    1,
    1,
    2,
    3,
    1,
    4,
    3,
    2,
    4,
    3,
    1,
    2,
    4,
    3,
    2,
    4,
    1,
    2,
    3,
    4,
    1,
    2,
    3,
    4,
    1,
    2,
    1,
    4,
    1,
    3,
    2,
    1,
    3,
    2,
    4,
    3,
    3,
    1,
    1,
    2,
    4,
    2,
    4,
    3,
    3,
    1,
    2,
    3,
    4,
    1,
    2,
    3,
    4,
    1,
    3,
    4,
]

# answer[800:900:1]

# 900-1000:1题目
# answer[900:1000:1]
str_test[900] = ["低闪点液体是指闪点低于多少摄氏度的液体:", "-18℃", "18℃", "-23℃", "23℃"]
str_test[901] = ["下列哪个属于中闪点液体:", "乙醛", "丙酮", "苯", "氯苯"]
str_test[902] = ["高闪点液体是指闪点高于多少摄氏度的液体:", "-18℃", "18℃", "-23℃", "23℃"]
str_test[903] = ["下列哪个不属于高闪点液体:", "环辛烷", "甲醇", "氯苯", "苯甲醚"]
str_test[904] = ["下列哪个不是易燃气体:", "氧气", "氨气", "一氧化碳", "甲烷"]
str_test[905] = ["下列哪个不属于腐蚀品:", "硝酸", "硫氢化钙", "苯酚钠", "黄磷"]
str_test[906] = ["哪类有机物有损肝肾:", "醇类", "卤代烃", "醛类", "醚类"]
str_test[907] = ["哪类化合物对造血功能有影响:", "醇类", "醛类", "醚类", "胺类"]
str_test[908] = ["液溴一般有很强腐蚀性和挥发性，市售一般上层用什么封住:", "油", "石蜡", "水", "乙醇"]
str_test[909] = ["氧气瓶一般是什么颜色:", "棕色", "黑色", "天蓝色", "黄色"]
str_test[910] = ["氢气瓶一般是什么颜色:", "棕色", "黑色", "天蓝色", "深绿色"]
str_test[911] = ["压缩空气瓶一般是什么颜色:", "黄色", "天蓝色", "深绿色", "黑色"]
str_test[912] = ["哪个气体钢瓶是黄色的:", "氨气瓶", "氢气瓶", "氧气瓶", "氦气瓶"]
str_test[913] = ["根据有关规定，放空管一般不能低于物体多少米:", "4m", "3m", "2m", "1m"]
str_test[914] = ["HCN的气味是:", "无味", "苦杏仁味", "烧焦羽毛味", "汽油味"]
str_test[915] = ["苯急性中毒主要表现为对什么的麻醉作用:", "中枢神经系统", "呼吸系统", "消化系统", "脊椎"]
str_test[916] = ["高压电线断落地面时，应在导线断落点多少米内禁止人员靠近:", "5", "10", "15", "20"]
str_test[917] = [
    "实验时不慎将强酸溅入口中且已下咽，应先饮用大量水，再服用:",
    "氢氧化铝溶液，鸡蛋白",
    "乙酸果汁溶液，鸡蛋白",
    "盐水",
    "硫酸铜溶液",
]
str_test[918] = [
    "实验时不慎将强酸溅入口中且已下咽，应先饮用大量水，再服用::",
    "氢氧化铝溶液，鸡蛋白",
    "盐水",
    "乙酸果汁溶液，鸡蛋白",
    "硫酸铜溶液",
]
str_test[919] = ["进行危险性实验时，下列说法正确的是:", "可以单人操作", "必须要两人及以上", "必须要有三人", "必须要三人以上"]
str_test[920] = ["下列哪个是毒物侵入人体的基本途径:", "呼吸道", "皮肤", "消化道", "以上都是"]
str_test[921] = ["压力容器如灭菌锅，每天连续使用时间不能超过多少个小时:", "6", "7", "8", "9"]
str_test[922] = ["电气线路发生火灾，下列哪个不是线路方面的原因:", "电阻过大", "过载", "短路", "断路"]
str_test[923] = ["如被酸灼伤时，不可以用哪个溶液处理:", "1%的饱和碳酸氢钠", "1%的氢氧化钠", "稀氨水", "肥皂水水溶液"]
str_test[924] = ["乙炔瓶的颜色是:", "黑色", "棕色", "白色", "蓝色"]
str_test[925] = [
    "灭火的四种方法是:",
    "隔离法、窒息法、冷却法和扑打法",
    "隔离法、窒息法、冷却法和化学抑制法",
    "隔离法、泡沫法、冷却法和化学抑制法",
    "隔离法、扑打法、冷却法和化学抑制法",
]
str_test[926] = ["下列哪个化学品应放到防爆冰箱里:", "甲基丙烯酸甲酯", "乙醇", "乙醚", "苯"]
str_test[927] = ["国际规定，电压在( )伏以下不必考虑防止电击的危险。", "25", "35", "45", "55"]
str_test[928] = ["引起火灾蔓延的因素是:", "飞火", "热辐射", "热传导", "以上都是"]
str_test[929] = ["当发生电气火灾时，首先应该采取的措施是:", "打119", "灭火", "切断电源", "保护现场"]
str_test[930] = ["低压验电笔一般适用于交、直流电压为多少伏以下:", "100", "220", "250", "500"]
str_test[931] = ["当氧气瓶被有机物沾污时，应立即用什么洗净:", "四氯化碳", "酒精", "甘油", "水"]
str_test[932] = ["在做加热的实验时，液体量不能超过液体容量的多少:", "二分之一", "三分之一", "四分之三", "三分之二"]
str_test[933] = [
    "有关下列做法，错误的是:",
    "不准把食物、食具带进实验室",
    "在实验室内只能吃口香糖",
    "使用化学药品后须先洗净双手方能进食",
    "实验室内禁止吸烟",
]
str_test[934] = ["全国消防宣传日是每年的:", "9月9日", "10月9日", "11月9日", "12月9日"]
str_test[935] = ["易燃气体瓶与明火的距离应不小于多少米:", "5", "10", "15", "20"]
str_test[936] = [
    "铅被加热到（）以上就有大量铅蒸汽逸出，在空气中迅速氧化为氧化铅，形成烟尘。",
    "300℃",
    "350℃",
    "400℃",
    "500℃",
]
str_test[937] = [
    "有关自燃性试剂的存放，下列错误的是:",
    "单独储存",
    "储存于通风、阴凉、干燥处",
    "存放于试剂架上",
    "远离明火及热源，防止太阳直射",
]
str_test[938] = ["以下哪个药品不需要在储存在棕色瓶中或用黑纸包裹:", "卤化银", "催化剂", "浓硝酸", "过氧化氢"]
str_test[939] = ["以下物品属于剧毒化学试剂的是:", "乙醇", "环己烷", "氰化钾", "乙酸乙酯"]
str_test[940] = ["除了高温以外，下列物质会灼伤皮肤的是:", "KBr溶液", "NaBr溶液", "稀草酸", "液氮"]
str_test[941] = ["γ射线与物质相互作用的主要方式不包括:", "韧致辐射效应", "光电效应", "康普顿效应", "电子对效应"]
str_test[942] = [
    "氢氟酸灼伤皮肤后，应首先采取的立即措施是:",
    "用大量流动清水彻底冲洗",
    "脱去被污染的衣物",
    "用葡萄糖酸钙软膏涂敷按摩",
    "用肥皂水或2%～5%碳酸氢钠冲洗",
]
str_test[943] = ["下列的高压气体钢瓶可以混放在同一个房间:", "氯气与氨气", "氢气与氧气", "氯气和氧气", "乙炔与氧气"]
str_test[944] = [
    "有关硝酸铵，下列说法中错误的是:",
    "皮肤接触没有问题",
    "与易燃物混合可能爆炸",
    "强氧化剂，可做烟花",
    "与还原物、有机物混合可能爆炸",
]
str_test[945] = ["下列物质不属于剧毒物的是:", "氰化钠", "盐酸", "乙酸汞", "三氧化二砷"]
str_test[946] = ["下列物品不属于剧毒物品的是:", "三氯化磷", "甲基异氰酸酯", "丙烯醛", "浓硫酸"]
str_test[947] = ["有下列气体产生时须在通风橱内操作的是:", "氮气", "氧气", "二氧化碳", "硫化氢"]
str_test[948] = ["下面试剂易侵蚀玻璃而影响纯度，应保存在塑料瓶中的是:", "王水", "浓硫酸", "氢氟酸", "冰醋酸"]
str_test[949] = ["实验室常用的重铬酸钾洗液，当它失效时洗液颜色变为:", "无色", "绿色", "乳白色", "浅黄色"]
str_test[950] = ["关于易燃液体的安全标志，下列描述中错误的是:", "图形为火焰", "图形的颜色为黑色", "底色为粉红色", "文字的颜色为黑色"]
str_test[951] = ["下列哪个是高毒性药品砒霜:", "三氧化二砷", "砷", "砷酸", "砷酸钠"]
str_test[952] = [
    "未反应完的活泼金属残余物应:",
    "直接作为废液处理",
    "放回原试剂瓶",
    "暴露在空气中使其氧化完全",
    "缓慢滴加无水乙醇将所有金属反应完毕后，整体作为废液处理",
]
str_test[953] = [
    "危险化学品的LD50代表 :",
    "致死量",
    "致死浓度",
    "导致一半受试动物死亡的致死浓度",
    "导致一半受试动物死亡的有害物质剂量",
]
str_test[954] = ["低毒药品是指大鼠一次经口LD50为:", "≤500mg/kg", "500~5000mg/kg", ">5g/kg", "以上都不是"]
str_test[955] = [
    "中毒药品是指大鼠一次经口LD50为:",
    "1~50mg/kg",
    "50mg/kg",
    "50~500mg/kg",
    "500~5000mg/kg",
]
str_test[956] = [
    "高毒药品是指大鼠一次经口LD50为:",
    "50mg/kg",
    "50~500mg/kg",
    "500~5000mg/kg",
    "1~50mg/kg",
]
str_test[957] = [
    "CO进入人体之后会和血液中的（）结合，引起机体组织出现缺氧，导致人体窒息死亡。",
    "球蛋白",
    "白蛋白",
    "血红蛋白",
    "纤维蛋白原",
]
str_test[958] = ["通用塑料制品的加热温度不能超过:", "60℃", "55℃", "50℃", "40℃"]
str_test[959] = ["酒精灯内的酒精量最多可以加多少:", "加满", "三分之二", "二分之一", "三分之一"]
str_test[960] = ["在氯气使用范围多少米以内设置危险气体浓度监测仪和报警装置:", "2.5", "2", "1.5", "1"]
str_test[961] = ["有关丙酮的叙述错误的是:", "具有高度易燃性", "不溶于水", "对神经系统有麻醉作用，并对黏膜有刺激作用", "极易挥发"]
str_test[962] = [
    "有关苯的叙述错误的是:",
    "短期接触，苯对中枢神经系统产生麻痹作用，引起急性中毒",
    "长期接触，苯会对血液造成极大伤害，引起慢性中毒",
    "毒性比甲苯低",
    "对皮肤、粘膜有刺激作用，是致癌物质",
]
str_test[963] = ["氧气瓶不得靠近热源，与明火的距离一般不得小于多少米", "10", "15", "20", "25"]
str_test[964] = ["下列哪个药品不需要放在干燥器内:", "盐酸", "氢化钙", "五氧化二磷", "三氯化磷"]
str_test[965] = ["使用和保存强氧化剂时，应注意储存温度低于多少℃:", "20", "25", "30", "35"]
str_test[966] = ["下面所列试剂不需要分开保存的是:", "乙醚与高氯酸", "苯与过氧化氢", "丙酮与硝基化合物", "浓硫酸与盐酸"]
str_test[967] = [" 下列物质中具有强腐蚀性，使用时须做必要防护的是:", "硼酸", "硝酸", "稀醋酸", "稀硫酸"]
str_test[968] = ["静电电压最高可达（ ），放电时易产生静电火花，引起火灾。:", "220伏", " 上万伏", "500伏", "上千伏"]
str_test[969] = ["箱式电阻炉（马弗炉）使用过程中，当温度降至（ ）以下，才可以打开炉门。", "100℃", "50℃", "200℃", "25℃"]
str_test[970] = [" 易燃化学试剂允许存放最高室温不得超过多少℃。", "30", "35", "40", "45"]
str_test[971] = [
    "国家标准(GB2893-82)中规定的四种安全色是:",
    "赤、蓝、黄、绿",
    "赤、橙、黄、绿",
    "红、蓝、黄、绿",
    "紫、蓝、黄、绿",
]
str_test[972] = ["实验室常用溶剂应:", "按名称字母顺序存放", "按药品类别分开存放", "按生产日期存放", "按保质期存放"]
str_test[973] = ["在蒸馏低沸点（低于80℃）有机化合物时应采取（ ）加热。", "酒精灯加热", "煤气灯", "沙浴", "热水浴"]
str_test[974] = ["一般将闪点在多少°C以下的化学试剂列入易燃化学试剂", "10", "15", "20", "25"]
str_test[975] = ["显微镜的物镜和目镜如有灰尘应该要用（ ）擦拭。", "纱布", "毛刷", "镜头纸", "卫生纸"]
str_test[976] = ["恒温箱的使用最高温度为:", "60℃", "65℃", "70℃", "75℃"]
str_test[977] = ["干燥箱的使用温度范围是多少:", "50~250℃", "25~250℃", "50~500℃", "25~500℃"]
str_test[978] = ["下列物质应避免与水接触以免发生危险的是：", "碳酸钙", "碳化钙", "氯化钙", "硫酸钙"]
str_test[979] = ["下面溶剂中不属于易燃类液体（闪点在25℃以下）的是（ ）。", "甲醇", "四氯化碳", "乙醇", "甲苯"]
str_test[980] = ["分光光度计的吸光值在多少时准确度最高:", "0.2~0.7", "0.2~0.4", "0.4~0.7", "<0.1"]
str_test[981] = [" 普通玻璃制品的加热温度不能超过（ ）。:", "100℃", "180℃", "200℃", "280℃"]
str_test[982] = ["塑料、有机玻璃制品的加热温度不能超过:", "40℃", "50℃", "60℃", "70℃"]
str_test[983] = ["汽油的爆炸极限是:", " 7.2%~1.4%", " 7.6%~2.4%", " 7.2%~2.4%", " 7.6%~1.4%"]
str_test[984] = ["用光电池为检测器的分光光度计连续使用不应超过（ ）h。", "4", "3", "2", "1"]
str_test[985] = ["分光光度计的比色皿盛样品液应为（ ）。", "装满", "二分之一", "三分之一", "三分之二"]
str_test[986] = ["下列物质贮存于空气中易发生爆炸的是（ ）。", " 苯乙烯", "苯", "甲苯", "对二甲苯"]
str_test[987] = ["欲除去氯气时，以下物质作为吸收剂最为有效的是（ ）。", "氯化钙", "硫代硫酸钠", "稀硫酸", "氢氧化铅"]
str_test[988] = ["减压蒸馏时应用下列器皿作为接收瓶和反应瓶的是（ ）。", "圆底烧瓶", "锥形瓶", "试管", "烧杯"]
str_test[989] = ["下列不可以放入105℃干燥箱干燥的是（ ）。", "锥形瓶", "量筒", "烧杯", "试管"]
str_test[990] = [
    "1000级超净间的定义是:",
    "每1立方英尺内直径大于1微米的灰尘不超过1000个",
    "每1立方米内直径大于1微米的灰尘不超过1000个",
    "每1立方米内直径大于0.5微米的灰尘不超过1000个",
    "每1立方英尺内直径大于0.5微米的灰尘不超过1000个",
]
str_test[991] = [
    "以下对放射性垃圾的安全管理描述错误的是（ ）。",
    "将放射性垃圾放入专用容器收集、包装、储存，由专业部门统一回收处理",
    "严禁放射性垃圾放入非放射性垃圾",
    "允许非放射性垃圾混入放射性垃圾",
    "放射性垃圾和非放射性垃圾必须分开放置",
]
str_test[992] = [
    "使用离心机时，下列操作错误的是（ ）。",
    "离心管必须盖紧盖子",
    "可以用盐溶液或次氯酸盐溶液平衡空离心管",
    "使用固定角度的离心转子时，必须注意离心管不要装的太满以防溢出",
    "每次使用后要清除离心桶、转子、离心机腔的污染",
]
str_test[993] = [
    "正确使用气体钢瓶的原则是:",
    "检查减压阀是否关紧，方法是顺时针旋转调压手柄至螺杆松动为止",
    "迅速地顺时针转动调压手柄，至低压表显示出实验所需压力为止",
    "停止使用时，先关闭减压阀再关闭减压阀",
    "打开钢瓶总阀门，此时高压表显示出瓶内贮气总压力",
]
str_test[994] = [
    "高压容器的工作压力范围是：",
    "0.1Mpa≤P<1.6Mpa",
    "1.6 Mpa≤P<10 Mpa",
    "10 Mpa≤P<100 Mpa",
    "P>100Mpa",
]
str_test[995] = [
    "中压容器的工作压力范围是:",
    "<0.1Mpa",
    "0.1Mpa≤P<1.6Mpa",
    "1.6 Mpa≤P<10 Mpa",
    "10 Mpa≤P<100 Mpa",
]
str_test[996] = [
    "低压容器的工作压力范围是",
    "0.1Mpa≤P<1.6Mpa",
    "1.6 Mpa≤P<10 Mpa",
    "10 Mpa≤P<100 Mpa",
    "P>100Mpa",
]
str_test[997] = ["高压氧气瓶使用时应保持瓶内压力在多少MPa以上。", "0.2", "0.5", "1", "1.5"]
str_test[998] = ["我国气体钢瓶常用的颜色标记中，氮气的瓶身和标字颜色分别为：", "黑 白", "黑 黄", "绿 黄", "绿 白"]
str_test[999] = ["在作业场所液化气浓度较高时，应该佩戴（ ）。", "眼罩", "面罩", "防毒面罩", "口罩"]
# answer[900:1000:1]=[1,3,4,2,1,4,2,4,3,3,4,4,1,2,2,1,4,1,3,2,4,3,4,2,3,2,1,1,4,3,4,1,4,2,3,1,3,3,2,3,4,1,2,3,1,2,4,4,3,2,3,1,4,4,2,3,4,3,1,2,4,2,3,1,1,3,4,2,2,3,1,3,2,4,4,3,1,1,2,2,1,2,3,4,3,4,1,2,1,2,4,3,2,4,3,3,1,2,2,2]
answer[900:1000:1] = [
    1,
    3,
    4,
    2,
    1,
    4,
    2,
    4,
    3,
    3,
    4,
    4,
    1,
    2,
    2,
    1,
    4,
    1,
    3,
    2,
    4,
    3,
    4,
    2,
    3,
    2,
    1,
    1,
    4,
    3,
    4,
    1,
    4,
    2,
    3,
    1,
    3,
    3,
    2,
    3,
    4,
    1,
    2,
    3,
    1,
    2,
    4,
    4,
    3,
    2,
    3,
    1,
    4,
    4,
    2,
    3,
    4,
    3,
    1,
    2,
    4,
    2,
    3,
    1,
    1,
    3,
    4,
    2,
    2,
    3,
    1,
    3,
    2,
    4,
    4,
    3,
    1,
    1,
    2,
    2,
    1,
    2,
    3,
    4,
    3,
    4,
    1,
    2,
    1,
    2,
    4,
    3,
    2,
    4,
    3,
    3,
    1,
    2,
    2,
    2,
]


# 1000-1100:1题目
# answer[1000:1100:1]
str_test[1000] = ["实验室存放化学易燃物品的水箱或水柜,一般使用年限为几年", "5年", "8年", "10年", "12年"]
str_test[1001] = ["一般的易燃物质的闪点低于多少摄氏度", "88", "76", "66", "50"]
str_test[1002] = [
    "实验室生物安全等级分四级,哪级生物安全防护要求最高",
    "一级(BSL-1)",
    "二级(BSL-2)",
    "三级(BSL-3)",
    "四级(BSL-4)",
]
str_test[1003] = [
    "涉及生物安全性的动物实验,必须在哪―种实验室中进行",
    "净化式实验室",
    "普通实验室",
    "BSL-1以上生物安全实验室",
    "正压实验室",
]
str_test[1004] = [
    "实验室内的浓酸、浓碱处理,一般可",
    "中和后倾倒,并用大量的水冲洗管道",
    "不经处理,沿下水道流走",
    "不需中和,直接向下水道倾到",
    "中和后沿下水道流走",
]
str_test[1005] = [
    "使用离心机时下列哪种操作是错误的",
    "离心机必须盖紧盖子",
    "不需要考虑离心管的对角平衡",
    "液体不能超过离心管2/3",
    "每次使用后要清洁离心机腔",
]
str_test[1006] = [
    "需要你将硫酸、氢氟酸、盐酸和氢氧化钠各一瓶从化学品柜搬到通风橱内，正确的方法是",
    "硫酸和盐酸同一次搬运,氢氟酸和氢氧化钠同一次搬运",
    "硫酸和氢氟酸同一次搬运,盐酸和氢氧化钠同一次搬运",
    "硫酸和氢氧化钠同一次搬运,盐酸和氢氟酸同一次搬运",
    "硫酸和盐酸同一次搬运,氢氟酸、氢氧化钠分别单独搬运",
]
str_test[1007] = [
    "生产、经营、储存、运输、使用危险化学品和处置废弃危险化学品的单位，其（）必须保证本单位危险化学品的安全管理符合有关法律、法规、规章的规定和国家标准,并对本单位危险化学品的安全负责。",
    "主要负责人",
    "技术人员",
    "从业人员",
    "管理人员",
]
str_test[1008] = ["氢气瓶的规定涂色为()", "淡绿", "淡黄", "银灰", "紫红"]
str_test[1009] = ["HCN无色,气味为", "无味", "大蒜味", "苦杏仁味", "臭鸡蛋气味"]
str_test[1010] = [
    "对于一些吸入或食入少里即能中毒至死的化学试剂，生物试验中致死里(LD50)在50mg/kg以下的称为剧毒化学试剂。以下哪个不是剧毒化学试剂:",
    "苯",
    "氰化钾",
    "三氧化二砷",
    "氯化汞",
]
str_test[1011] = [
    "遇水发生剧烈反应,容易产生爆炸或燃烧的化学品是",
    "K、Na、Mg、Ca、Li、AlH3、电石",
    "K、Na、ca、Li、AlH3、Mg0、电石",
    "K、Na、Ca、Li、AlH3、电石",
    "K、Na、Mg、Li、AlH3、电石",
]
str_test[1012] = ["下列哪种物质与乙醇混溶时易发生爆炸?", "盐酸", "乙醚", "高氯酸", "丙酮"]
str_test[1013] = ["火灾发生时,湿毛巾折叠8层为宜,其烟雾浓度消除率可达:", "0.4", "0.6", "0.8", "0.9"]
str_test[1014] = [
    "为了防止在开启或关闭玻璃容器时发生危险，下列哪一种瓶塞不适宜作为盛放具有爆炸危险性物质的玻璃容器的瓶塞?",
    "软木塞",
    "磨口玻璃塞",
    "胶皮塞",
    "橡胶塞",
]
str_test[1015] = ["重大事故是指死亡多少人以上", "2", "3", "4", "5"]
str_test[1016] = [
    "由于剧毒化学品的伤害巨大，后果严重，因此与剧毒化学品相关的各类事件均为(）",
    "I级(特别重大）",
    "II级（重大)",
    "III级(较大)",
    "IV级(—般）",
]
str_test[1017] = [
    "实验室的化学试剂或化学品容器必须贴有（），标示其所装化学品的名称、浓度、潜在危险及制造日期,并列明紧急应变资料.",
    "供货商电话信息",
    "商品价格",
    "供货商logo",
    "标签",
]
str_test[1018] = ["铝粉、保险粉自燃时的扑救措施是", "用水灭火", "用泡沫灭火器", "用干粉灭火器", "用干砂子灭火"]
str_test[1019] = ["下列物质会引发爆炸的是（)", "氧化锌", "三硝基甲苯", "四氯化碳", "氧化铁"]
str_test[1020] = ["CO呈()。", "酸味", "烂苹果味", "无味", "臭鸡蛋气味"]
str_test[1021] = ["钠,钾等碱金属须贮存于( ) 。", "水中", "酒精中", "煤油中", "暴露在空气中"]
str_test[1022] = [
    "领取剧毒物品时,必须( )。",
    "双人领用(其中一人必须是实验室的教师)",
    "单人领用",
    "双人领用(两人都是实验室的学生)",
    "双人领用(两人都是实验室的老师)",
]
str_test[1023] = [
    "当有危害的化学试剂发生泄漏、洒落时应()。",
    "首先做好个人防护，再按照该化学品的应急处理要求做进一步处理",
    "赶'紧打扫干净或收拾起来",
    "收集掩埋",
    "呼叫老师",
]
str_test[1024] = [
    "当有危害的化学试剂发生泄漏、洒落或堵塞时应（)。",
    "首先避开并想好应对的办法再处理",
    "赶紧打扫干净或收拾起来",
    "收集掩埋",
    "呼叫老师",
]
str_test[1025] = ["大里试剂应放在()。", "试剂架上", "实验室内试剂柜中", "实验台下柜中", "试剂库内"]
str_test[1026] = [
    "带油污（如凡士林或石蜡油)的玻璃器皿，在洗前尽里去除油污，然后放在（〉中煮两次，再用洗涤剂和热水洗刷。",
    "市售洗涤剂",
    "稀盐酸或铬酸洗涤液",
    "5%的苏打液",
    "水",
]
str_test[1027] = [
    "进入化学清洗间，下列陈述错误的是( )。",
    "使用规定类型的手套时,注意检查手套是否碱损",
    "不要用手套碰自己的脸，如果需要扶正眼镜或者整理头发，用胳膊或者肩膀，手套上有可能带有危险化学品",
    "严格禁止将头部伸入通风橱",
    "仅在化学间用自来水或去离子水,不接触化学品，可以不戴防护手套",
]
str_test[1028] = ["生物材料在匀浆或搅拌后,容器应在( ）开启。", "实验台上", "生物安全柜内", "无菌室内", "通风橱"]
str_test[1029] = [
    "化学品的毒性可以通过皮肤吸收﹑消化道吸收及呼吸道吸收等三种方式对人体健康产生危害，下列预防措施不正确的是()。",
    "实验过程中使用三氯甲烷时戴防尘口墨",
    "实验过程中移取强酸、强碱溶液应带防酸碱手套",
    "实验场所严禁携带食物:禁止用饮料瓶装化学药品,防止误食",
    "称取粉末状的有毒药品时,要带口罩防止吸入",
]
str_test[1030] = [
    "有毒化学品可以通过皮肤、消化道及呼吸系统等三种主要方式对人体健康产生危害，下列防护措施中不正确的是()。",
    "实验过程中使用三氯甲烷时戴防尘口罩",
    "实验过程中移取强酸、强碱溶液应带防酸碱手套",
    "实验场所严禁携带食物:禁止用饮料瓶装化学药品,防止误食",
    "称取粉末状的药品时,要带过滤式防尘口罩防止吸入",
]
str_test[1031] = ["下列不可以放入105℃干燥箱干燥的是（ )。", "烧杯", "锥形瓶", "里筒", "培养皿"]
str_test[1032] = ["倾倒液体试剂时,瓶上标签应朝( )。", "上方", "下方", "左方", "右方"]
str_test[1033] = ["清洁分光光度计比色皿的透光面可以用()擦拭。", "纱布", "毛刷", "镜头纸", "源纸"]
str_test[1034] = ["高毒性药品砒霜是（)。", "三氧化二砷", "三氯化砷", "砷酸", "砷酸钠"]
str_test[1035] = [
    "为了防止在开启或关闭玻璃容器时发生危险，下列瓶塞中不适宜作为盛放具有爆炸危险性物质的玻璃容器的瓶塞的是()。",
    "软木塞",
    "磨口玻璃塞",
    "胶皮塞",
    "橡胶塞",
]
str_test[1036] = [
    "不慎发生意外,下列操作正确的是( )。",
    "如果不慎将化学品弄酒或污染，立即自行回收或者清理现场，以免对他人产生危险",
    "任何时候见到他人洒落的液体不要首先认为是水，应置之不理，以免发生危险",
    "pH值中性即意味着液体是水,自行清理即可",
    "不慎将化学试剂弄到衣物和身体上,立即用大里清水冲洗10-15分钟",
]
str_test[1037] = ["下列不属于剧毒化学品的是（)。", "氰化钾", "氯化汞", "铊", "甲醛"]
str_test[1038] = ["下列不是发生爆炸的基本因素的是（)。", "温度", "压力", "湿度", "着火源"]
str_test[1039] = [
    "关于氢氟酸的描述错误的是()。",
    "稀的氢氟酸危害性很低,不会产生严重烧伤",
    "氢氟酸蒸气溶于眼球内的液体中会对人的视力造成永久损害",
    "使用氢氟酸一定要戴防护手套,工作中注意不要接触氢氟酸蒸汽",
    "氢氟酸有强烈的腐蚀性和危害性，皮肤接触氢氟酸后可出现疼痛及灼伤，随时间疼痛渐剧，皮肤下组织被破坏。",
]
str_test[1040] = [
    "生石灰烧伤应( ) 。",
    "立即用大里水冲洗",
    "立即用1%~2%的醋酸冲洗",
    "先用卫生纸或干布尽里清除皮肤上的生石灰,再用大里水清洗",
    "立即去医院处理",
]
str_test[1041] = ["用过的废洗液应( )。", "可直接倒入下水道", "可以用来洗厕所", "合理回收", "作为废液交相关部门统一处理"]
str_test[1042] = [
    "把玻璃管或温度计插入橡皮塞或软木塞时，常常会折断而使人受伤。下列操作方法不正确的是()。",
    "可在玻璃管上沾些肥皂水或甘油等作润骨剂",
    "橡皮塞等钻孔时，打出的孔比管径略小，可用圆锉把孔锉一下,适当扩大孔径",
    "一手拿着塞子:一手拿着玻璃管,边旋转边慢慢地把玻璃管插入塞子中",
    "操作时双手距离较远",
]
str_test[1043] = ["氯仿的毒性级别是( )。", "剧毒", "高毒", "中等毒性", "低毒"]
str_test[1044] = ["甲醛的毒性级别是（ )。", "剧毒", "高毒", "中等毒性", "低毒"]
str_test[1045] = ["丙酮的毒性级别是（)。", "剧毒", "高毒", "低毒", "微毒"]
str_test[1046] = ["苯的毒性级别是( )。", "剧毒", "高毒", "低毒", "微毒"]
str_test[1047] = ["甲苯的毒性级别是( )。", "剧毒", "高毒", "低毒", "微毒"]
str_test[1048] = ["玻璃电极的玻璃膜表面若粘有油污,使用（）浸洗，最后用蒸馏水洗净。", "酒精和四氯化碳", "四氯化碳", "酒精", "乙醇"]
str_test[1049] = [
    "配制稀硫酸时,应()。",
    "将水慢慢分批倒入酸中,并不时搅拌",
    "将浓硫酸慢慢分批加入水中,并不时搅拌己.",
    "将水和浓硫酸同时倒入容器中,并不时搅拌",
    "将浓硫酸快速加入水中,并迅速搅拌",
]
str_test[1050] = [
    "下列药品按毒性从大到小排序,正确的是()。",
    "甲醛、苯、甲苯、丙酮",
    "苯、甲醛、甲苯、丙酮",
    "甲苯、甲醛、苯、丙酮",
    "甲苯、甲醛、丙酮、苯",
]
str_test[1051] = [
    "按毒性从大到小将以下药品排序正确的是（)。",
    "甲醛、苯、苯乙烯、丙酮",
    "苯、甲醛、甲苯、丙酮",
    "甲苯、甲醛、苯、丙酮",
    "甲苯、甲醛、丙酮、苯",
]
str_test[1052] = ["以下药品(试剂)中应放在防爆水箱里保存的是（ )。", "甲基丙烯酸甲酯", "乙醚", "苯", "甲苯"]
str_test[1053] = ["毒物进入人体最主要、最常见的途径是()。", "呼吸道", "皮肤", "眼睛", "消化道"]
str_test[1054] = [
    "国家标准(GB2893-82)中规定的四种安全色是（) 。",
    "红、蓝、黑、绿",
    "红、青、黄、绿",
    "白、蓝、黄、绿",
    "红、蓝、黄、绿",
]
str_test[1055] = [
    "盐酸、甲醛溶液、乙醚等易挥发试剂存放时应()。",
    "和其它试剂混放",
    "放在水箱中",
    "放在干燥通风处且瓶口进行蜡封",
    "放在通风橱",
]
str_test[1056] = [
    "如果在试验过程中,闻到烧焦的气味应() 。",
    "关机走人",
    "打开通风装置通风",
    "立即断电并报告相关负责人员",
    "请同实验的人帮忙检查",
]
str_test[1057] = ["下列物质中,与乙醇混溶时易发生爆炸的是( ) 。", "高氯酸", "乙醚", "水", "丙酮"]
str_test[1058] = ["乙醇的毒性级别是()。", "高毒", "中等毒性", "低毒", "微毒"]
str_test[1059] = ["甲醇的毒性级别是( )。", "高毒", "中等毒性", "低毒", "微毒"]
str_test[1060] = ["金属Hg可以在常温下() 。", "不挥发", "慢慢挥发", "很快挥发", "立即挥发"]
str_test[1061] = [
    "皮肤接触了高温﹑低温和腐蚀性物质都会造成灼伤。如果发生意外正确的处理方法是( ) 。",
    "不管什么情况,马上送医院就医",
    "被碱灼伤时先用水冲洗,然后用3%的硼酸或2%的醋酸清洗,严重时就医",
    "金属钠溅入眼内,立即用大里水冲洗",
    "浓硫酸沾到皮肤上,直接用水冲洗",
]
str_test[1062] = ["从安全角度考虑,设备停电必须有一个明显的()。", "标示牌", "接地处", "断开点", "警告牌"]
str_test[1063] = ["下列物质贮存于空气中易发生爆炸的是（) 。", "对二甲苯", "苯", "甲苯", "苯乙烯"]
str_test[1064] = ["减压蒸溜时应用下列器皿作为接收瓶和反应瓶的是（ ) 。", "薄壁试管", "锥形瓶", "平底烧瓶", "圆底烧瓶"]
str_test[1065] = ["实验室常用溶剂应（ )。", "按药品类别分开存放", "按字母顺序存放", "按生产日期存放", "按取用频率存放"]
str_test[1066] = ["危险化学品的急性毒性中LD50的单位是（)。", "mg/kg", "g/kg", "mL/kg", "mL"]
str_test[1067] = ["汽油的爆炸极限是（ )。", "7.6%~1.4%", "5.3%~1%", "7.1%~3.4%", "7.5%~2.4%"]
str_test[1068] = ["恒温培养箱的使用最高温度为（)。", "60℃", "100℃", "45℃", "200℃"]
str_test[1069] = ["K、Na、Mg、 Ca、 Li、AlH3、MgO、电石中,遇水发生激烈反应的有（)。", "5种", "6种", "7种", "8种"]
str_test[1070] = ["静电电压最高可达( ）,放电时易产生静电火花,引起火灾。", "50V", "上万伏", "220V", "380V"]
str_test[1071] = [
    "干燥箱的使用温度范围为()，常用鼓风式电热箱以加速升温。",
    "50-350℃",
    "50-150℃",
    "50-200℃",
    "50-250℃",
]
str_test[1072] = ["塑料、有机玻璃制品的加热温度不能超过()。", "40℃", "60℃", "80℃", "100℃"]
str_test[1073] = ["用光电池为检测器的分光光度计连续使用不应超过( )h", "4", "2", "1", "没有限制"]
str_test[1074] = [
    "以下是溴灼伤处理方法，正确的顺序为()。1.送医院。2.立即用大里水洗。3.用乙醇擦至灼伤处为白色。",
    "231",
    "213",
    "321",
    "123",
]
str_test[1075] = ["易燃化学试剂允许存放最高室温不得超过（)。", "20℃", "30℃", "40℃", "10℃"]
str_test[1076] = [
    "箱式电阻炉使用过程中，当温度升至()以上后，不得打开炉门进行激烈冷却，以免烧坏炉衬和电热元件。",
    "200℃",
    "400℃",
    "550℃",
    "800℃",
]
str_test[1077] = ["箱式电阻炉（马弗炉)使用过程中，当温度降至（)以下,才可以打开炉门。", "200℃", "400℃", "550℃", "800℃"]
str_test[1078] = ["分光光度计的比色皿盛样品液应为()。", "2/3左右", "1/2左右", "装满", "任意"]
str_test[1079] = ["普通玻璃制品的加热温度不能超过()。", "180℃", "250℃", "140℃", "200℃"]
str_test[1080] = ["干粉灭火器不适宜扑救()。", "石油产品", "有机溶剂", "油漆", "金属燃烧"]
str_test[1081] = [
    "实验室仪器设备用电或线路发生故障着火时，应立即()，并组织人员用灭火器进行灭火。",
    "将贵重仪器设备迅速转移",
    "切断现场电源",
    "将人员疏散",
    "迅速撤离现场",
]
str_test[1082] = ["下列物质中,二氧化碳灭火器不适宜扑救（)。", "贵重仪器设备", "档案资料", "计算机", "钾、钠、镁、铝等物质"]
str_test[1083] = ["实验间仪器着火应使用的灭火器是()。", "二氧化碳灭火器", "泡沫灭火器", "干粉灭火器", "1211灭火器"]
str_test[1084] = ["扑灭电器火灾不宜使用的灭火器是（ )。", "二氧化碳灭火器", "干粉灭火器", "泡沫灭火器", "灭火砂"]
str_test[1085] = [
    "当打开房门闻到燃气气味时,要迅速( ）,以防止引起火灾。",
    "打开燃气灶具查找漏气部位",
    "打开门窗通风",
    "迅速撤离",
    "关闭房门",
]
str_test[1086] = [
    "发生电气火灾后,首先应该采取的第一条措施是〈 )。",
    "打电话报警",
    "切断电源",
    "扑灭明火",
    "保护现场,分析火因,以便采取措施,杜绝隐患",
]
str_test[1087] = ["从火灾现场撤离时,不应采取（)。", "乘坐电梯", "佩戴防毒面具或手头湿的毛巾", "衣物捂住口鼻保持低姿", "从安全通道撤离"]
str_test[1088] = [
    "在火灾初发阶段,应采取的撤离方法有() 。",
    "乘坐电梯",
    "用湿毛巾捂住口皇低姿从安全通道撤离",
    "跳楼逃生",
    "跑到楼顶呼救",
]
str_test[1089] = [
    "发生电器着火应()。",
    "别管它,赶紧跑",
    "保障安全的情况下先灭火,然后关电源",
    "保障安全情况下先关掉电源,然后灭火",
    "拨打火警",
]
str_test[1090] = ["烟头的中心温度大概是（）度", "200-300", "400-500", "900-1000", "700-800"]
str_test[1091] = ["存放危险化学药品的冰箱应使用（ )冰箱，并在冰箱门上粘贴警示标志。", "普通", "防爆", "一级能耗", "节能环保"]
str_test[1092] = [
    "使用大型仪器必须按规定填写( )，出现故障或仪器异常时应记录情况，以便检查和维修。",
    "申请书",
    "仪器使用登记本",
    "试验计划",
    "实验室进出记录本",
]
str_test[1093] = [
    "放射工作人员必须参加指定医疗单位的职业病体检、政府环境主管部门举办的辐射安全与防护知识培训，每（）个月接受个人剂量监则—次,持证上岗。",
    "3",
    "6",
    "9",
    "12",
]
str_test[1094] = [
    "实验室的化学试剂或化学品容器必须贴有(），标示其所装化学品的名称、浓度、潜在危险及制造日期,并列明紧急应变资料。",
    "供货商电话信息",
    "商品价格",
    "标签",
    "供货商logo",
]
str_test[1095] = [
    "如需在办公时间以外使用实验室,使用者须向学院或相关单位备案方可使用:如需晚上11点后继续使用实验室，使用者须向学院或相关单位递交(),获批后报实验室与设备管理处备案方可使用，并在大楼物管处登记。",
    "实验室使用申请",
    "试验计划方案",
    "通宵使用实验室申请书",
    "研究生证",
]
str_test[1096] = [
    "显微镜的油镜使用后，应先用擦镜纸将镜头上的油渍擦去，再用蘸有少许()的擦镜纸擦2-3次，最后用干净的擦镜纸将上述溶剂擦去。",
    "二甲苯",
    "酒精",
    "洗涤剂",
    "汽油",
]
str_test[1097] = [
    "在宿舍楼里你发现自己没带宿舍门的钥匙,应该（)。",
    "直接撬锁",
    "打114查询开锁公司电话",
    "找宿舍管理员借钥匙",
    "用IC卡之类的卡片“谨慎”地自助",
]
str_test[1098] = ["实验室内的插座距地面的高度一般不低于()。", "0.3米", "0.2米", "0.1米", "0.5米"]
str_test[1099] = [
    "关于在实验室做实验,下列做法错误的是（ )。",
    "为了熟悉实验室环境,随意翻动实验室内物品",
    "手上有伤口时,可以申请停做生物解剖实验",
    "实验的过程中使用火炉等设备时,保证有人看守",
    "进入实验室时,更换规定的实验服",
]
# answer[1000:1100:1]=[3,3,4,3,1,2,4,4,1,3,1,3,3,2,2,2,1,4,4,2,3,3,1,1,1,4,3,4,2,1,1,3,1,3,1,2,4,4,3,1,3,4,4,3,3,3,2,3,1,2,2,2,1,1,4,3,3,1,4,3,2,2,3,4,4,1,1,1,1,2,2,4,2,2,1,2,1,1,1,1,4,2,4,1,3,2,2,2,2,3,4,2,2,1,3,3,1,3,1,1,]
answer[1000:1100:1] = [
    3,
    3,
    4,
    3,
    1,
    2,
    4,
    4,
    1,
    3,
    1,
    3,
    3,
    2,
    2,
    2,
    1,
    4,
    4,
    2,
    3,
    3,
    1,
    1,
    1,
    4,
    3,
    4,
    2,
    1,
    1,
    3,
    1,
    3,
    1,
    2,
    4,
    4,
    3,
    1,
    3,
    4,
    4,
    3,
    3,
    3,
    2,
    3,
    1,
    2,
    2,
    2,
    1,
    1,
    4,
    3,
    3,
    1,
    4,
    3,
    2,
    2,
    3,
    4,
    4,
    1,
    1,
    1,
    1,
    2,
    2,
    4,
    2,
    2,
    1,
    2,
    1,
    1,
    1,
    1,
    4,
    2,
    4,
    1,
    3,
    2,
    2,
    2,
    2,
    3,
    4,
    2,
    2,
    1,
    3,
    3,
    1,
    3,
    1,
    1,
]

# 1100-1200:1题目
# answer[1100:1200:1]
str_test[1100] = ["下面哪一个不是实验纯水的检验指标:", "电阻率", "酸碱度", "钙镁离子", "铝离子"]
str_test[1101] = ["在使用酸碱度检验纯水时水的ph要求为多少:", "6-7", "7-8", "6-8", "5-9"]
str_test[1102] = ["实验中多取得的试剂如何处理:", "倒回原试剂瓶", "倒入下水道", "倒入废液桶", "直接做实验"]
str_test[1103] = ["下面哪一步不是使用移液管的操作:", "洗涤", "移取溶液", "使用完再次洗涤", "使用完不用洗涤"]
str_test[1104] = ["使用HF做滴定实验的时候使用哪种滴定管:", "酸式滴定管", "碱式滴定管", "不能做滴定实验", "不了解"]
str_test[1105] = ["滴定管的使用中错误的是:", "初始滴定一定要到零刻度线", "正视读取数值", "管口与锥形瓶接触", "滴定时不成水线"]
str_test[1106] = ["下面对容量仪器的操作错误的是:", "烘干", "视线与刻度在同一水平上", "凹液面最低处读取", "壁上不挂水珠"]
str_test[1107] = ["实验室中能否乱拉乱接电线:", "能", "不能", "不清楚", "请教老师"]
str_test[1108] = ["实验室中能否使用湿抹布:", "能", "不能", "不清楚", "请教老师"]
str_test[1109] = ["实验室中能否使用湿抹布擦拭带点电器:", "能", "不能", "不清楚", "请教老师"]
str_test[1110] = ["实验室中电器发生火灾应首先做什么:", "直接用水扑灭", "直接用灭火器扑灭", "先断开电源", "立即逃跑"]
str_test[1111] = ["发现有人触电时应怎么做:", "直接拉开", "直接进行急救", "请教老师", "先切断电源再进行急救"]
str_test[1112] = ["实验室电器冒烟时怎么做:", "当做无事发生", "请教老师", "切断电源", "用水扑灭"]
str_test[1113] = ["实验室中能否随意搬动气瓶:", "不能", "随意", "能", "不清楚"]
str_test[1114] = ["气瓶放置需不需要有一定的放倒措施:", "需要", "不需要", "不清楚", "请教老师"]
str_test[1115] = ["易燃气瓶与明火的距离应该大于多少米:", "5", "10", "15", "20"]
str_test[1116] = ["易燃气瓶需不需要放在室外:", "需要", "不需要", "不清楚", "请教老师"]
str_test[1117] = ["有毒气瓶需不需要放在室外:", "需要", "不需要", "不清楚", "随意放"]
str_test[1118] = ["使用减压阀不需要做什么:", "擦净出口的水", "擦净出口的灰尘", "带上安全帽", "带上手套"]
str_test[1119] = ["使用有毒气体时不需要做什么:", "戴防护眼镜", "带上面罩", "戴上安全帽", "戴上手套"]
str_test[1120] = ["通风橱的作用是什么:", "保护实验人员", "保护实验不受干扰", "做装饰用", "没作用"]
str_test[1121] = ["在通风橱中进行危险反应时需不需要戴防护眼镜:", "需要", "不需要", "不清楚", "请教老师"]
str_test[1122] = ["实验人员能否将头伸进通风橱内:", "不可以", "可以", "不清楚", "请教老师"]
str_test[1123] = ["通风橱中能否放置非必要的物品:", "能", "不能", "不清楚", "随意放"]
str_test[1124] = ["实验物品放置在通风橱内应距离调节门多远:", "1m", "0.5m", "0.3m", "0.15m"]
str_test[1125] = ["通风橱为耐腐蚀材料,若有试剂喷溅需要清除吗:", "需要", "不需要", "不清楚", "都可以"]
str_test[1126] = ["实验室内能否存放氢气钢瓶:", "能", "不能", "不清楚", "都可以"]
str_test[1127] = ["使用液氮时需要戴手套吗:", "需要", "不需要", "不清楚", "都可以"]
str_test[1128] = ["实验服长度能否超过膝盖:", "能", "不能", "不清楚", "都可以"]
str_test[1129] = ["进入实验室能否穿拖鞋:", "能", "不能", "不清楚", "都可以"]
str_test[1130] = ["使用离心机需不需要盖盖子:", "需要", "不需要", "不清楚", "都可以"]
str_test[1131] = ["使用离心机能否直接调节至所需的速度:", "能", "不能", "不清楚", "都可以"]
str_test[1132] = ["离心操作结束时可以直接打开盖子吗:", "可以", "不可以", "不清楚", "都可以"]
str_test[1133] = ["塑料离心管中能否放入热溶液:", "能", "不能", "不清楚", "都可以"]
str_test[1134] = ["塑料离心管能否放入有机溶液:", "能", "不能", "不清楚", "都可以"]
str_test[1135] = ["离心的溶液一般中离心管体积的多少:", "放满", "1/4", "1/3", "1/2"]
str_test[1136] = ["实验室的冰箱需要防爆装置吗:", "需要", "不需要", "不清楚", "都可以"]
str_test[1137] = ["实验室冰箱和冰柜可以存放食品吗:", "可以", "不可以", "不清楚", "都可以"]
str_test[1138] = ["放于实验室冰箱内的容器需要全部密封吗:", "需要", "不需要", "不清楚", "都可以"]
str_test[1139] = ["放于冰箱中的化学品都需要有规范的标签吗:", "需要", "不需要", "都可以", "自己认得就行"]
str_test[1140] = ["实验室使用烘箱时温度一般不超过多少度:", "30度", "50度", "70度", "100度"]
str_test[1141] = ["使用烘箱时能否将不同的样品同时放入烘干:", "能", "不能", "不清楚", "都可以"]
str_test[1142] = ["油浴加热一般使用什么油:", "汽油", "食用油", "硅油", "石油"]
str_test[1143] = ["在进行加热操作时需要需要有人值守:", "需要", "不需要", "不清楚", "都可以"]
str_test[1144] = ["进入实验室能否携带和使用手机:", "能", "不能", "不清楚", "都可以"]
str_test[1145] = ["本科生在进行实验时需要都指导老师在场吗:", "需要", "不需要", "不清楚", "都可以"]
str_test[1146] = ["实验室可以自己安装火炉或燃气炉吗:", "可以", "不可以", "不清楚", "看情况"]
str_test[1147] = ["实验室三废不包括什么:", "废气", "废液", "固体废弃物", "生活废弃物"]
str_test[1148] = ["危险化学废弃物需要分类收集吗:", "需要", "不需要", "不清楚", "看情况"]
str_test[1149] = ["能否将普通的化学废液倒入下水道:", "可以", "不可以", "不清楚", "看情况"]
str_test[1150] = ["过氧化物与有机物废液能否混合处理:", "可以", "不可以", "不清楚", "看情况"]
str_test[1151] = ["易燃易爆试剂需要需要单独收集:", "需要", "不需要", "不清楚", "看情况"]
str_test[1152] = ["实验室能否大量堆放化学废弃物:", "能", "不能", "不清楚", "看情况"]
str_test[1153] = ["废气能否直接通过通风设备排放:", "可以", "不可以", "少量可以", "不清楚"]
str_test[1154] = ["少量有毒废气能否通过通风橱直接排放:", "可以", "不可以", "不清楚", "看情况"]
str_test[1155] = ["大量的有毒气体不可以怎么处理:", "吸收处理", "与氧气充分燃烧", "直接排放", "不处理"]
str_test[1156] = ["实验室中中毒如何处理:", "不理会", "自行解毒", "立即到医院", "告诉同学"]
str_test[1157] = ["实验时被利器割伤怎么办:", "清水冲洗", "立即去医院", "不理会", "不清楚"]
str_test[1158] = ["实验药品弄到眼睛里怎么处理:", "立即用清水冲洗", "立即去医院", "报告老师", "不清楚"]
str_test[1159] = ["实验时着火怎么办:", "用水扑灭", "用灭火器扑灭", "立即报告老师", "不理会"]
str_test[1160] = ["衣服着火了怎么办:", "用水扑灭", "灭火器扑灭", "不理会", "躺地上来回滚动"]
str_test[1161] = ["实验室发生火灾怎么办:", "告诉同学并立即离开", "报告老师", "不理会", "不清楚"]
str_test[1162] = ["水废弃物能否直接倒入下水道:", "能", "不能", "不清楚", "看情况"]
str_test[1163] = ["实验室用水分为多少个级别:", "2", "3", "4", "5"]
str_test[1164] = ["去离子水为纯净水吗:", "是", "不是", "不清楚", "看情况"]
str_test[1165] = ["一级水电导率低于多少:", "0.1", "0.2", "0.3", "0.4"]
str_test[1166] = ["二级水电导率低于多少:", "0.5", "1", "1.5", "2"]
str_test[1167] = ["三级水电导率低于多少:", "3", "5", "8", "10"]
str_test[1168] = ["实验室中能否使用闸刀开关:", "能", "不能", "不清楚", "看情况"]
str_test[1169] = ["实验室接线板能否直接放在地面上:", "可以", "不可以", "不清楚", "看情况"]
str_test[1170] = ["实验室使用高压气瓶时能否全部用尽:", "能", "不能", "看情况", "不清楚"]
str_test[1171] = ["高压气瓶余压一般为多少:", "2", "4", "6", "8"]
str_test[1172] = ["易燃易爆物质残渣能否直接倒入废液桶:", "能", "不能", "不清楚", "看情况"]
str_test[1173] = ["实验室发生火灾时应怎么办:", "先切断电源后逃离", "直接逃离", "报告老师", "不理会"]
str_test[1174] = ["酒精着火时能否使用水灭火:", "可以", "不可以", "不清楚", "看情况"]
str_test[1175] = ["金属钠着火时怎么办:", "用水扑灭", "用棉布扑灭", "用砂子扑灭", "不理会"]
str_test[1176] = ["实验室中烫伤怎么办:", "先用酒精消毒", "直接使用烫伤膏", "直接用水冲洗", "不处理"]
str_test[1177] = [" 在实验室中，应该穿着什么样的服装:", "白色实验服", "旧衣服", "短裤", "工作服"]
str_test[1178] = [
    "在实验室中，你应该怎样处理化学品:",
    "把它们放在易燃物品旁边",
    "把它们放在易燃物品上方",
    "把它们放在易燃物品之外的地方",
    "把它们放在易燃物品里面",
]
str_test[1179] = ["在进行化学反应时，你应该怎样处理可能会引起火灾或者爆炸的物质:", "随意使用", "谨慎使用", "随意扔掉", "远离其他易燃物质"]
str_test[1180] = [
    "在进行化学反应时，你应该怎样处理可能会引起皮肤刺激或者眼刺激的物质:",
    "随意使用",
    "谨慎使用",
    "随意扔掉",
    "远离其他易刺激物质",
]
str_test[1181] = ["当你在进行化学反应时，你是否应该戴上手套:", "是", "不是", "不一定", "看情况"]
str_test[1182] = ["当你在进行化学反应时，你是否应该避免食用或者吸入未经处理的原料或产物:", "是", "不是", "不一定", "看情况"]
str_test[1183] = [
    "当你在进行化学反应时，如果出现了危险情况（如泄露成分危险水平很高) ，你该怎么办:",
    "立即退出",
    "尽快退出",
    "尝试修复",
    "立即报警",
]
str_test[1184] = ["处理大量回流物时要使电子雾:", "是", "不是", "不一定", "看情况"]
str_test[1185] = [
    "当使用明火作为加火工具时,要注意什么:",
    "避免将明火带入办公区域",
    "直接使用最大火量",
    "缓慢加至最大火量",
    "没有需要注意的",
]
str_test[1186] = ["挪用干净玻璃仪器时,能否使用手指接触仪器内部:", "可以", "不可以", "不一定", "看情况"]
str_test[1187] = ["洗净的仪器能否使用抹布擦拭:", "可以", "不可以", "不一定", "看情况"]
str_test[1188] = ["使用铅笔做标记时,要写在玻璃仪器的哪里:", "磨砂玻璃处", "光滑玻璃处", "随意写", "不能标记"]
str_test[1189] = ["使用油性笔标记时应写在玻璃仪器的哪里:", "磨砂玻璃处", "光滑玻璃处", "随意写", "不能标记"]
str_test[1190] = [
    "在实验室中，应该如何处理化学品的废弃物:",
    "把废弃物直接丢弃 ",
    "把废弃物进行分类处理 ",
    "把废弃物直接倒入水龙头里",
    "把废弃物直接倒入厕所里",
]
str_test[1191] = [
    "在化学实验中，如何正确使用易燃易爆的化学品:",
    "在通风条件不好的地方使用",
    "在无人的情况下使用",
    "在有人看管的情况下使用",
    "在无法避免的情况下使用",
]
str_test[1192] = ["能否使用石蜡封闭精细药品的瓶口:", "能", "不能", "不一定", "看情况"]
str_test[1193] = ["实验产生的空试剂瓶如何处理:", "直接丢弃", "集中收集统一处理", "放着不管", "不清楚"]
str_test[1194] = ["废液桶中废液多少时应更换新桶:", "1/2", "3/4", "4/5", "5/6"]
str_test[1195] = ["标签纸贴在试剂瓶的哪一部分:", "瓶口", "瓶底", "2/3处", "不用贴"]
str_test[1196] = ["实验室中能否使用滤纸称量药品:", "可以", "不可以", "不一定", "看情况"]
str_test[1197] = ["实验中酚触及皮肤时使用什么处理:", "水", "水和肥皂水", "水和乙醇", "乙醇"]
str_test[1198] = ["导线着火时能否使用二氧化碳灭火器灭火:", "能", "不能", "不一定", "看情况"]
str_test[1199] = ["实验结束后能否直接离开实验室:", "能", "不能", "看情况", "不一定"]

answer[1100:1200:1] = [
    4,
    1,
    3,
    4,
    2,
    1,
    1,
    2,
    1,
    2,
    3,
    4,
    3,
    1,
    1,
    2,
    1,
    1,
    4,
    3,
    1,
    1,
    1,
    2,
    4,
    1,
    2,
    1,
    2,
    2,
    1,
    2,
    2,
    2,
    2,
    4,
    1,
    2,
    1,
    1,
    2,
    2,
    3,
    1,
    2,
    1,
    2,
    4,
    1,
    2,
    2,
    1,
    2,
    3,
    1,
    4,
    3,
    1,
    1,
    2,
    4,
    1,
    4,
    2,
    2,
    1,
    2,
    5,
    2,
    2,
    2,
    2,
    2,
    1,
    1,
    3,
    1,
    1,
    3,
    4,
    2,
    1,
    1,
    1,
    1,
    1,
    2,
    2,
    1,
    2,
    2,
    3,
    2,
    2,
    3,
    3,
    2,
    2,
    2,
    2,
]


global n, num
n = 0

# li = list(np.arange(0, 100))
# 从列表 items 中随机取出100 个元素，但不改变原列表。

# 目前题目有600题，如果增加到1200题，则具体数据需要调整
##题目已增加到1200题

add_selectbox = st.sidebar.radio("选择做题数目", ("10题", "20题", "40题", "60题", "100题"))
if add_selectbox == "10题":
    num = 10
    # input_max = 60 - 1
    # step = 60
    input_max = 120 - 1
    step = 120
elif add_selectbox == "20题":
    num = 20
    # input_max = 30 - 1
    # step = 30
    input_max = 60 - 1
    step = 60
elif add_selectbox == "40题":
    num = 40
    # input_max = 15 - 1
    # step = 15
    input_max = 30 - 1
    step = 30
elif add_selectbox == "60题":
    num = 60
    # input_max = 10 - 1
    # step = 10
    input_max = 20 - 1
    step = 20
elif add_selectbox == "100题":
    num = 100
    # input_max = 6 - 1
    # step = 6
    input_max = 12 - 1
    step = 11


# step=1#调试用
st.header("有关化学化工实验室安全考试")
st.subheader("点击左上角的→可选择题目数量")

st.text("  本软件代码由方利国开发，题目由2022化学与化工学院Python软件")
st.text("开发小组成员杨思维、曾佩欣、陈千潼、翁艺芝、李雨婕、谭杰提供,")
st.text("发现错误之处请联系lgfang@scut.edu.cn,不胜感谢。")
st.text("点击左上方的>可以选择考题数量")
name = st.text_input("请输入您的姓名", "张三")
sel_no = st.number_input(
    "选择一个试卷序列号", value=3, min_value=0, max_value=input_max, step=1, format="%i"
)
# if st.button('开始做题'):
# test_num = rnd.sample(li, num)
# if st.button('开始做题'):
# streamlit run "g:/safe1_test.py"
# num=10
# test_num =rnd.sample(li, num)
dt = datetime.datetime.now()
st.subheader("当前时间" + str(dt))

with st.form("my_form"):
    for i in range(num):
        str_k = "第" + str(i + 1) + "题"
        st.subheader(str_k)
        # k=test_num[i]
        k = i * step + sel_no
        k = int(k)
        select = st.radio(
            str_test[k][0],
            (str_test[k][1], str_test[k][2], str_test[k][3], str_test[k][4]),
            horizontal=True,
        )  # 前面题目，后面4个选项
        if select == str_test[k][answer[k]]:  # 这里填正确答案,目前题目从0-1199
            n = n + 1
    submitted = st.form_submit_button("点击提交")
    if submitted:

        # end_time = time.time()
        end_time = time.process_time()
        time_use = end_time - start_time
        # con_num=1
        str_finsh = "欢迎您" + name + ",已完成考试,试卷序号为" + str(sel_no) + ",选择题目数为" + str(num)
        st.subheader(str_finsh)
        str_time = "考试用时" + str(time_use) + "秒"

        # st.subheader(str_time)
        # for i in range(num):
        # k=test_num[i]
        # if select ==str_test[k][answer[k-100]] :  #这里填正确答案,目前题目从100 199
        # n=n+1
        if n / num > 0.9:
            str_n = str(n)
            sstr = (
                "恭喜您答对"
                + str_n
                + "题,答对率为"
                + str(int(100 * 100 * n / num + 0.5) / 100)
                + "%，是个化工实验室安全大行家"
            )
            st.subheader(sstr)
            # st.experimental_rerun()
        elif n / num > 0.6:
            str_n = str(n)
            sstr = (
                "恭喜您答对"
                + str_n
                + "题,答对率为"
                + str(int(100 * 100 * n / num + 0.5) / 100)
                + "%，本次成绩不错，还有提升空间"
            )
            st.subheader(sstr)
            # st.experimental_rerun()
        elif n / num <= 0.6:
            str_n = str(n)
            sstr = (
                "本次只答对"
                + str_n
                + "题,答对率为"
                + str(int(100 * 100 * n / num + 0.5) / 100)
                + "%，成绩不理想，请多多学习"
            )
            st.subheader(sstr)
        fig = plt.figure(num="Correct Answer Chart", figsize=(8, 8))
        labels = ["Correct", "Mistake"]
        C_M_data = [n / num, 1 - n / num]  # 正确与错误数据
        colors = ["lightblue", "red"]  # 颜色
        explode = (0.1, 0.1)  # 间隔距离，半径的比例
        plt.pie(
            C_M_data,
            explode=explode,
            labels=labels,
            startangle=45,
            shadow=True,
            colors=colors,
            autopct="%3.1f%%",
        )
        # st.subheader("*******答题对错率图******")
        plt.title("Question Answering Correct and Mistake Rate Chart")

        st.pyplot(fig)
        dt = datetime.datetime.now()
        st.subheader("当前时间" + str(dt))
        str_finsh1 = str_finsh + "请截屏成绩发给指定人员或地址"
        sstr = (
            "本次只答对"
            + str(n)
            + "题,答对率为"
            + str(int(100 * 100 * n / num + 0.5) / 100)
            + "%"
        )
        sstr = sstr + str_finsh1
        add_selectbox = st.sidebar.subheader(sstr)
        add_selectbox = st.sidebar.subheader("##若要继续考试可重新选择左边的答题数目或改变右上方试卷序号##")
